Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: es, fr, pt

source: API Reference
es: Referencia API
fr: Référence API
pt: Referência de API

source: AMRnet provides a comprehensive RESTful API for programmatic access to all antimicrobial resistance surveillance data. The API supports multiple data formats, filtering options, and authentication methods to suit different use cases.
es: AMRnet proporciona una API completa de RESTful para el acceso programático a todos los datos de vigilancia de resistencia antimicrobiana. La API soporta múltiples formatos de datos, opciones de filtrado y métodos de autenticación para adaptarse a diferentes casos de uso.
fr: AMRnet fournit une API complète RESTful pour un accès programmatique à toutes les données de surveillance de résistance aux antimicrobiens. L'API prend en charge plusieurs formats de données, des options de filtrage et des méthodes d'authentification qui conviennent à différents cas d'utilisation.
pt: O AMRnet fornece uma API RESTful abrangente para acesso programático a todos os dados de vigilância da resistência antimicrobiana. A API suporta vários formatos de dados, opções de filtragem e métodos de autenticação para atender a diferentes casos de uso.

source: Quick Start
es: Inicio rápido
fr: Démarrage rapide
pt: Início rápido

source: The AMRnet API is available at ``https://api.amrnet.org`` and provides access to surveillance data for multiple organisms. All endpoints return JSON by default, with optional CSV export capabilities.
es: La API de AMRnet está disponible en ``https://api.amrnet.org`` y proporciona acceso a datos de vigilancia para múltiples organismos. Todos los endpoints devuelven JSON por defecto, con capacidades opcionales de exportación CSV.
fr: L'API AMRnet est disponible sur ``https://api.amrnet.org`` et fournit un accès aux données de surveillance pour plusieurs organismes. Tous les terminaux retournent JSON par défaut, avec des capacités d'exportation CSV optionnelles.
pt: A API AMRnet está disponível no ``https://api.amrnet.org`` e fornece acesso aos dados de vigilância para vários organismos. Todos os endpoints retornam JSON por padrão, com capacidades opcionais de exportação de CSV para CSV.

source: Basic Usage
es: Uso Básico
fr: Utilisation de base
pt: Uso básico

source: Authentication
es: Autenticación
fr: Authentification
pt: Autenticação

source: The AMRnet API supports multiple authentication methods depending on your usage requirements:
es: La API de AMRnet soporta múltiples métodos de autenticación dependiendo de sus requisitos de uso:
fr: L'API AMRnet prend en charge plusieurs méthodes d'authentification en fonction de vos besoins d'utilisation :
pt: A API AMRnet suporta múltiplos métodos de autenticação, dependendo dos seus requisitos de uso:

source: Public Access
es: Acceso público
fr: Accès public
pt: Acesso Público

source: Basic read access to all published datasets is available without authentication. Rate limits apply:
es: El acceso básico de lectura a todos los conjuntos de datos publicados está disponible sin autenticación. Se aplican los límites:
fr: L'accès en lecture de base à tous les jeux de données publiés est disponible sans authentification. Les limites de taux s'appliquent :
pt: Acesso de leitura básico a todos os datasets publicados está disponível sem autenticação. Limites de taxa aplicados:

source: **Rate Limit**: 1000 requests per hour per IP
es: **Límite de tasas**: 1000 solicitudes por hora por IP
fr: **Limite de tarification**: 1000 demandes par heure par IP
pt: **Limite de taxa**: 1000 pedidos por hora por IP

source: **Data Limit**: 10,000 records per request
es: **Límite de datos**: 10.000 registros por solicitud
fr: **Limite de données** : 10 000 enregistrements par requête
pt: **Limite de dados**: 10.000 registros por pedido

source: **Export Limit**: 50,000 records per day
es: **Límite de exportación**: 50.000 registros por día
fr: **Limite d'exportation**: 50 000 enregistrements par jour
pt: **Limite de exportação**: 50.000 registros por dia

source: API Key Authentication
es: Autenticación de clave API
fr: Authentification de la clé API
pt: Autenticação de Chave API

source: For higher rate limits and bulk data access, register for a free API key at `amrnet.org/api/register <https://amrnet.org/api/register>`_.
es: Para límites de velocidad más altos y acceso a datos a granel, registra una clave API gratuita en `amrnet.org/api/register <https://amrnet.org/api/register>`_.
fr: Pour obtenir des limites de taux plus élevées et un accès groupé aux données, inscrivez-vous pour obtenir une clé API gratuite à `amrnet.org/api/register <https://amrnet.org/api/register>`_.
pt: Para maiores limites de taxa e acesso em massa de dados, registre-se para uma chave de API gratuita em `amrnet.org/api/register <https://amrnet.org/api/register>`_.

source: **API Key Benefits:**
es: **Beneficios de clave API:**
fr: **Avantages clés de l'API:**
pt: **Benefícios chave da API:**

source: **Rate Limit**: 10,000 requests per hour
es: **Límite de tarifa**: 10.000 solicitudes por hora
fr: **Limite de tarification**: 10 000 demandes par heure
pt: **Limite de taxa**: 10.000 pedidos por hora

source: **Data Limit**: 100,000 records per request
es: **Límite de datos**: 100.000 registros por solicitud
fr: **Limite de données** : 100 000 enregistrements par requête
pt: **Limite de dados**: 100.000 registros por pedido

source: **Export Limit**: 1,000,000 records per day
es: **Límite de exportación**: 1.000.000 registros por día
fr: **Limite d'exportation** : 1 000 000 enregistrements par jour
pt: **Limite de exportação**: 1,000.000 registros por dia

source: **Priority Support**: Faster response times
es: **Soporte de prioridad**: tiempos de respuesta más rápidos
fr: **Support prioritaire** : temps de réponse plus rapide
pt: **Suporte prioridade**: tempos de resposta mais rápidos

source: OAuth2 Authentication
es: Autenticación de OAuth2
fr: Authentification OAuth2
pt: Autenticação OAuth2

source: For institutional access and advanced features, OAuth2 authentication is available. Contact us at ``amrnetdashboard@gmail.com`` for institutional access.
es: Para el acceso institucional y características avanzadas, la autenticación de OAuth2 está disponible. Contáctenos en ``amrnetdashboard@gmail.com`` para el acceso institucional.
fr: Pour un accès institutionnel et des fonctionnalités avancées, l'authentification OAuth2 est disponible. Contactez-nous à ``amrnetdashboard@gmail.com`` pour un accès institutionnel.
pt: Para acesso institucional e recursos avançados, a autenticação OAuth2 está disponível. Contate-nos em ``amrnetdashboard@gmail.com`` para acesso institucional.

source: Available Endpoints
es: Endpoints disponibles
fr: Points de terminaison disponibles
pt: Pontos finais disponíveis

source: The AMRnet API provides consistent endpoints across all supported organisms with standardized query parameters and response formats.
es: La API de AMRnet proporciona puntos finales consistentes en todos los órganos soportados con parámetros de consulta estandarizados y formatos de respuesta.
fr: L'API AMRnet fournit des terminaux cohérents à tous les organismes pris en charge avec des paramètres de requête normalisés et des formats de réponse.
pt: A API AMRnet fornece endpoints consistentes em todos os organismos suportados com parâmetros de consulta padronizados e formatos de resposta.

source: Organism Data Endpoints
es: Puntos finales de datos del organismo
fr: Points de terminaison des données de l'organisme
pt: Fim dos Dados do Organismo

source: Supported Organisms
es: Organismos soportados
fr: Organismes pris en charge
pt: Organismos Suportados

source: Organism
es: Organismo
fr: Organisme
pt: Organismo

source: Description
es: Descripción
fr: Libellé
pt: Descrição:

source: Typhoid fever pathogen data
es: Datos de patógeno de fiebre tifoide
fr: Données pathogènes de la fièvre typhoïde
pt: Dados patogênicos da febre Typhoid

source: pneumoniae resistance data
es: datos de resistencia pneumoniae
fr: données de résistance pneumoniae
pt: Dados de resistência pneumoniae

source: Gonorrhea pathogen data
es: Datos de patógeno de Gonorrhea
fr: Données pathogènes de la gonorrhée
pt: Dados patogênicos da Gonorrhea

source: coli resistance patterns
es: patrones de resistencia al coli
fr: motifs de résistance au coli
pt: padrões de resistência a coli

source: Diarrheal E. coli strains
es: cepas diarreicas E. coli
fr: déformations de Diarrheal E. coli
pt: Diarreia E. coli strains

source: Shigella species data
es: Datos de especies de Shigella
fr: Données sur les espèces de Shigella
pt: Dados da espécie Shigella

source: *S.* enterica (Invasive)
es: *S.* enterica (Invasiva)

source: Invasive Salmonella strains
es: cepas de salmonela invasivas
fr: Souches invasives de salmonelle
pt: Habilidades Invasivas de Salmonela

source: Base Data Access
es: Acceso Base de Datos
fr: Accès aux données de base
pt: Acesso Base aos Dados

source: **Example Response:**
es: **Respuesta de ejemplo:**
fr: **Exemple de Réponse :**
pt: **Resposta de exemplo:**

source: Summary Statistics
es: Estadísticas del resumen
fr: Statistiques sommaires
pt: Estatísticas Resumidas

source: Country-Specific Data
es: Datos específicos del país
fr: Données spécifiques à un pays
pt: Dados específicos do País

source: **Example:**
es: **Ejemplo:**
fr: **Exemple :**
pt: **Exemplo:**

source: Temporal Trends
es: Tendencias temporales
fr: Tendances temporelles
pt: Tendências temporais

source: Query Parameters
es: Parámetros de consulta
fr: Paramètres de requête
pt: Parâmetros da consulta

source: All organism endpoints support consistent query parameters for filtering and customization:
es: Todos los extremos del organismo soportan parámetros de consulta consistentes para filtrar y personalizar:
fr: Tous les terminaux de l'organisme supportent des paramètres de requête cohérents pour le filtrage et la personnalisation :
pt: Todos os pontos de extremidade de organismos suportam parâmetros consistentes de consulta para filtragem e personalização:

source: Filtering Parameters
es: Parámetros de filtrado
fr: Paramètres de filtrage
pt: Parâmetros de Filtragem

source: Filter Parameters
es: Filtrar parámetros
fr: Paramètres de filtre
pt: Parâmetros do Filtro

source: Parameter
es: Parámetro
fr: Paramètre
pt: Parâmatro

source: Type
es: Tipo
fr: Type de texte
pt: tipo

source: ``country``
es: ``país``
pt: ``país``

source: string
es: cadena
fr: chaîne de caractères
pt: sequência

source: ISO 3166-1 alpha-3 country code (e.g., BGD, IND, USA)
es: ISO 3166-1 alpha-3 código de país (por ejemplo, BGD, IND, USA)
fr: Code pays ISO 3166-1 alpha-3 (par exemple, BGD, IND, USA)
pt: Código de país ISO 3166-1 alpha-3 (por exemplo, BGD, IND, EUA)

source: ``year_start``
es: ``año_inicio``
pt: ``ano_começo_ano``

source: integer
es: entero
fr: entier
pt: inteiro

source: Start year for date range filtering
es: Año de inicio para filtrado de fecha
fr: Année de début pour le filtrage de la plage de dates
pt: Ano inicial para filtragem do intervalo de datas

source: ``year_end``
es: ``fin de año``
pt: ``ano_fim``

source: End year for date range filtering
es: Fin de año para filtrado de fecha
fr: Fin de l'année pour le filtrage de la plage de dates
pt: Fim do ano para filtragem do intervalo de datas

source: ``resistance``
es: ``resistencia``
pt: ``resistência``

source: Filter by resistance to specific antibiotic
es: Filtrar por resistencia al antibiótico específico
fr: Filtrer par résistance à un antibiotique spécifique
pt: Filtrar por resistência a antibióticos específicos

source: ``genotype``
es: ``genotipo``
fr: 'génotype'
pt: ``genotipo``

source: Filter by specific genotype or lineage
es: Filtrar por genotipo o linaje específico
fr: Filtrer par génotype ou ligne spécifique
pt: Filtrar por genótipo específico ou linhagem

source: ``source``
es: ``fuente``
pt: ``origem``

source: Sample source (blood, urine, stool, etc.)
es: Fuente de ejemplo (sangre, orina, estool, etc.)
fr: Source d'échantillon (sang, urine, sel, etc.)
pt: Exemplo de fonte (sangue, urine, stool, etc.)

source: ``region``
es: ``región``
pt: ``região``

source: Geographic region filter
es: Filtro geográfico de región
fr: Filtre de région géographique
pt: Filtro de região geográfica

source: Pagination Parameters
es: Parámetros de paginación
fr: Paramètres de pagination
pt: Parâmetros de paginação

source: ``page``
es: ``página``
pt: ``página``

source: Page number (default: 1)
es: Número de página (por defecto: 1)
fr: Numéro de page (par défaut: 1)
pt: Número da página (padrão: 1)

source: ``per_page``
es: ``por_página``

source: Records per page (max: 10,000)
es: Registros por página (máximo: 10,000)
fr: Enregistrements par page (max : 10 000)
pt: Registros por página (máx: 10.000)

source: Total record limit
es: Límite total de registros
fr: Limite totale de l'enregistrement
pt: Limite total de registros

source: Number of records to skip
es: Número de registros a omitir
fr: Nombre d'enregistrements à ignorer
pt: Número de registros a ignorar

source: Format Parameters
es: Parámetros de formato
fr: Paramètres de format
pt: Parâmetros de formato

source: ``format``
es: ``formato``
pt: ``formato``

source: Response format: json (default), csv, tsv
es: Formato de respuesta: json (por defecto), csv, tsv
fr: Format de réponse : json (par défaut), csv, tsv
pt: Formato de resposta: json (padrão), csv, tsv

source: ``fields``
es: ``campos``

source: Comma-separated list of fields to include
es: Lista separada por comas de campos a incluir
fr: Liste de champs séparés par des virgules à inclure
pt: Lista de campos a incluir separados por vírgula

source: ``exclude``
es: ``excluir``

source: Comma-separated list of fields to exclude
es: Lista separada por comas de campos a excluir
fr: Liste de champs séparés par des virgules à exclure
pt: Lista de campos separados por vírgula para excluir

source: Example Queries
es: Ejemplos de consultas
fr: Exemples de requêtes
pt: Exemplo de consultas

source: Here are practical examples demonstrating common API usage patterns:
es: Aquí hay ejemplos prácticos que demuestran patrones de uso comunes de la API:
fr: Voici des exemples pratiques démontrant des modèles d'utilisation courants de l'API :
pt: Aqui estão exemplos práticos que demonstram padrões comuns de uso da API:

source: Basic Filtering
es: Filtrado básico
fr: Filtrage de base
pt: Filtro Básico

source: Advanced Filtering
es: Filtrado avanzado
fr: Filtrage avancé
pt: Filtro Avançado

source: Data Export
es: Exportar datos
fr: Export des données
pt: Exportação de Dados

source: Programming Examples
es: Ejemplos de programación
fr: Exemples de programmation
pt: Exemplos de programação

source: Python Integration
es: Integración de Python
fr: Intégration de Python
pt: Integração Python

source: R Integration
es: R Integración
fr: Intégration R
pt: Integração R

source: JavaScript/Node.js Integration
es: Integración JavaScript/Node.js
fr: Intégration de JavaScript/Node.js
pt: Integração de JavaScript/Node.js

source: Error Handling
es: Manejo de errores
fr: Gestion des erreurs
pt: Tratamento de erros

source: The AMRnet API uses standard HTTP status codes and provides detailed error messages to help diagnose issues:
es: La API de AMRnet utiliza códigos de estado estándar HTTP y proporciona mensajes de error detallados para ayudar a diagnosticar problemas:
fr: L'API AMRnet utilise des codes d'état HTTP standard et fournit des messages d'erreur détaillés pour aider à diagnostiquer les problèmes :
pt: A API AMRnet usa códigos de status HTTP padrão e fornece mensagens de erro detalhadas para ajudar a diagnosticar problemas:

source: HTTP Status Codes
es: Código de estado HTTP
fr: Codes d'état HTTP
pt: Códigos de Status HTTP

source: Status Codes
es: Códigos de estado
fr: Codes de statut
pt: Códigos de Status

source: Code
es: Código
pt: Código

source: Success - Request completed successfully
es: Éxito: Solicitud completada con éxito
fr: Succès - Demande terminée avec succès
pt: Solicitação concluída com sucesso

source: Bad Request - Invalid parameters or malformed request
es: Solicitud incorrecta - Parámetros no válidos o solicitud mal formada
fr: Requête incorrecte - Paramètres invalides ou requête mal formée
pt: Requisição inválida - parâmetros inválidos ou solicitação mal formada

source: Unauthorized - Invalid or missing API key
es: No autorizado - Clave API inválida o ausente
fr: Non autorisé - Clé API invalide ou manquante
pt: Não autorizado - Chave de API inválida ou ausente

source: Forbidden - Access denied or rate limit exceeded
es: Prohibida - Se ha superado el límite de acceso denegado o tasa
fr: Interdit - Accès refusé ou limite de taux dépassée
pt: Proibido - acesso negado ou limite de taxa excedido

source: Not Found - Endpoint or resource not found
es: No encontrado - Endpoint o recurso no encontrado
fr: Pas trouvé - Point d'extrémité ou ressource introuvable
pt: Não encontrado - Endpoint ou recurso não encontrado

source: Too Many Requests - Rate limit exceeded
es: Demasiadas solicitudes - Límite de tasa excedido
fr: Trop de requêtes - Limite de taux dépassée
pt: Muitas Solicitações - Limite de Taxa excedido

source: Internal Server Error - Server-side error
es: Error interno del servidor - error del lado del servidor
fr: Erreur interne du serveur - Erreur côté serveur
pt: Erro interno do servidor - erro do servidor

source: Error Response Format
es: Formato de respuesta de error
fr: Format de réponse d'erreur
pt: Formato de resposta de erro

source: Common Error Scenarios
es: Escenarios de errores comunes
fr: Scénarios d'erreurs communs
pt: Cenários de erro comuns

source: **Invalid Country Code:**
es: **Código de país no válido:**
fr: **Code de pays invalide:**
pt: **Código inválido:**

source: **Rate Limit Exceeded:**
es: **Límite de tasa excedido:**
fr: **Limite de taux dépassée :**
pt: **Limite de Taxa Excedido:**

source: **Large Data Request:**
es: **Solicitud de datos grande:**
fr: **Grande demande de données :**
pt: **Pedidos de dados grandes:**

source: Rate Limits and Best Practices
es: Límites de valoración y mejores prácticas
fr: Limites de taux et meilleures pratiques
pt: Taxa Limites e melhores práticas

source: Rate Limiting
es: Limitar tasa
fr: Limitation des taux
pt: Taxa Limitada

source: AMRnet implements rate limiting to ensure fair access and system stability:
es: AMRnet implementa una limitación de la tasa para garantizar un acceso justo y estabilidad del sistema:
fr: AMRnet implémente une limitation de débit pour assurer un accès équitable et la stabilité du système :
pt: O AMRnet implementa o limite da taxa para garantir acesso justo e estabilidade do sistema:

source: Rate Limits by Access Level
es: Valorar límites por nivel de acceso
fr: Limites de taux par niveau d'accès
pt: Limites de Taxa por Nível de Acesso

source: Access Level
es: Nivel de acceso
fr: Niveau d'accès
pt: Nível de Acesso

source: Requests/Hour
es: Solicitudes/Hora
fr: Demandes / Heure
pt: Pedidos/Hora

source: Records/Request
es: Registros/Solicitud
fr: Enregistrements/Requête
pt: Registros/Solicitar

source: Daily Export Limit
es: Límite de exportación diario
fr: Limite d'exportation quotidienne
pt: Limite Diário de Exportação

source: Public
es: Público
fr: Publique
pt: Público

source: API Key
es: Clave API
fr: Clé API
pt: Chave de API

source: Institutional
es: Institucional
fr: Institutionnel
pt: Instituição

source: Unlimited
es: Ilimitado
fr: Illimité
pt: Ilimitado

source: Best Practices
es: Mejores prácticas
fr: Meilleures pratiques
pt: Práticas recomendadas

source: **1. Use API Keys for Regular Access:**
es: **1. Usar claves API para acceso regular:**
fr: **1. Utilisez les clés API pour un accès régulier:**
pt: **1. Use chaves de API para acesso regular:**

source: **2. Implement Proper Error Handling:**
es: **2. Implementar el manejo adecuado de errores:**
fr: **2. Implémenter une gestion adéquate des erreurs :**
pt: **2. Implementação da Proporção de Erro de Manipulação:**

source: **3. Use Pagination for Large Datasets:**
es: **3. Usar paginación para conjuntos de datos grandes:**
fr: **3. Utiliser la pagination pour les grands jeux de données:**
pt: **3. Use a paginação para grandes datasets:**

source: **4. Cache Results Appropriately:**
es: **4. Resultados de la caché Apriadamente:**
fr: **4. Résultats de la cache correctement :**
pt: **4. Resultados do cache apropriados:**

source: FARM Stack API
es: API de pila FARM
fr: API de la pile FARM
pt: API FARM Stack

source: AMRnet is implementing a modern FARM (FastAPI + React + MongoDB) stack API to provide enhanced performance, real-time capabilities, and advanced analytics features.
es: AMRnet está implementando una moderna API de pila FARM (FastAPI + React + MongoDB) para proporcionar un rendimiento mejorado, capacidades en tiempo real y características avanzadas de análisis.
fr: AMRnet implémente une API de pile moderne FARM (FastAPI + React + MongoDB) pour fournir des performances améliorées, des capacités en temps réel et des fonctionnalités d'analyse avancées.
pt: O AMRnet está implementando uma API moderna FARM (FastAPI + React + MongoDB) para fornecer desempenho aprimorado, capacidades em tempo real e recursos avançados de análise.

source: FastAPI Backend Features
es: Características de backend FastAPI
fr: Fonctionnalités d'administration de FastAPI
pt: Funcionalidades do Backend FastAPI

source: **Real-time Data Streaming:**
es: **Transmisión de datos en tiempo real:**
fr: **Streaming de données en temps réel :**
pt: **Transmissão de dados em tempo real:**

source: **Advanced Analytics Endpoints:**
es: **Puntos de análisis avanzados:**
fr: **Points de terminaison Analytiques avancés:**
pt: **Pontos de Análise Avançados:**

source: **GraphQL Integration:**
es: **Integración GraphQL:**
fr: **Intégration GraphQL :**
pt: **Integração com GraphQL:**

source: React Frontend Components
es: Componentes React Frontend
fr: Composants React Frontend
pt: Componentes de Frontend React

source: **Interactive API Explorer:**
es: **Explorador Interactivo de API:**
fr: **Explorateur interactif de l'API :**
pt: **Explorador de API interativo:**

source: **Real-time Dashboard Widgets:**
es: **Widgets de panel de tiempo real:**
fr: **Widgets de tableau de bord en temps réel :**
pt: **Widgets do Painel em tempo real:**

source: MongoDB Advanced Queries
es: Consultas avanzadas de MongoDB
fr: Requêtes avancées MongoDB
pt: Consultas Avançadas do MongoDB

source: **Time-series Analytics:**
es: **Análisis de series temporales:**
fr: **Analyses de la série temporelle :**
pt: **Análises de Tempo:**

source: **Geospatial Analysis:**
es: **Análisis geoespacial:**
fr: **Analyse géospatiale :**
pt: **Análise geoespacial:**

source: Support and Resources
es: Soporte y Recursos
fr: Support et ressources
pt: Suporte e recursos

source: Get help and connect with the AMRnet developer community:
es: Obtén ayuda y conéctate con la comunidad de desarrolladores de AMRnet:
fr: Obtenir de l'aide et se connecter avec la communauté de développeurs AMRnet :
pt: Obtenha ajuda e conecte-se com a comunidade de desenvolvedor AMRnet:

source: Documentation Resources
es: Recursos de documentación
fr: Ressources de la documentation
pt: Recursos de Documentação

source: **📖 User Guide**: Comprehensive dashboard usage instructions
es: **📖 Guía de usuario**: Instrucciones de uso completas del panel de control
fr: **📖 Guide d'utilisation**: Instructions d'utilisation du tableau de bord complet
pt: **📖 Guia do usuário**: Instruções gerais de uso do painel

source: **🛠️ Developer Guide**: Contributing and adding new organisms
es: **🛠️ Guía de desarrollador**: Contribuyendo y añadiendo nuevos órganos.
fr: **🛠️ Developer Guide**: Contribuer et ajouter de nouveaux organismes
pt: **🛠️ Guia de Desenvolvedor**: Contribuindo e adicionando novos organismos
