Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/api.po
Languages: es, fr, pt

source: **📊 Data Dictionary**: Complete field definitions and schemas
es: **📊 Diccionario de Datos**: Completa definiciones de campos y esquemas
fr: **📊 Dictionnaire de données**: Définitions de champs et schémas complets
pt: **📊 Dicionário de Dados**: definições de campo completas e esquemas

source: **🎓 Tutorials**: Step-by-step integration examples
es: **🎓 Tutoriales**: Ejemplos de integración paso a paso
fr: **🎓 Tutoriels**: Exemples d'intégration étape par étape
pt: **🎓 Tutoriais**: Exemplos de integração passo a passo

source: Community Support
es: Soporte de la comunidad
fr: Support de la communauté
pt: Apoio da Comunidade

source: **💬 GitHub Discussions**: `github.com/amrnet/amrnet/discussions <https://github.com/amrnet/amrnet/discussions>`_
es: **:speech _balloon: Discusiones de GitHub**: `github.com/amrnet/amrnet/discussions <https://github.com/amrnet/amrnet/discussions>`_
fr: **💬 Discussions GitHub**: `github.com/amrnet/amrnet/discussions <https://github.com/amrnet/amrnet/discussions>`_

source: **📧 Email Support**: amrnetdashboard@gmail.com
es: **📧 Soporte por email**: amrnetdashboard@gmail.com
fr: **📧 Support par e-mail**: amrnetdashboard@gmail.com
pt: **📧 Suporte por e-mail**: amrnetdashboard@gmail.com

source: Professional Services
es: Servicios profesionales
fr: Services professionnels
pt: Serviços Profissionais

source: For organizations requiring custom integration support, training, or enterprise features:
es: Para organizaciones que requieren soporte de integración personalizada, capacitación o características de la empresa:
fr: Pour les organisations nécessitant un support d’intégration personnalisé, une formation ou des fonctionnalités d’entreprise :
pt: Para organizações que exigem suporte de integração personalizada, treinamento ou recursos empresariais:

source: **🏢 Enterprise API Access**: Higher rate limits and SLA guarantees
es: **🏢 Acceso a la API de la empresa**: Límites de tasa más altos y garantías de SLA
fr: **🏢 Enterprise API Access**: Des limites de taux plus élevées et des garanties de SLA
pt: **🏢 Acesso à API da Enterprise**: Limites de taxa mais altos e garantias de SLA

source: **🎓 Training Workshops**: API integration and AMR data analysis
es: **🎓 Talleres de formación**: integración de API y análisis de datos AMR
fr: **🎓 Ateliers de formation**: Intégration API et analyse des données AMR
pt: **🎓 Workshops de treinamento**: integração de API e análise de dados AMR

source: **🔧 Custom Development**: Tailored solutions and private deployments
es: **🔧 Desarrollo a medida**: Soluciones cubiertas e implementaciones privadas
fr: **🔧 Développement personnalisé**: Solutions sur mesure et déploiements privés
pt: **🔧 Desenvolvimento personalizado**: soluções personalizadas e implantações privadas

source: **📊 Consulting Services**: AMR surveillance strategy and implementation
es: **📊 Servicios de consulta**: estrategia e implementación de vigilancia de AMR
fr: **📊 Services de consultation**: Stratégie de surveillance AMR et implémentation
pt: **📊 Serviços de consulta**: estratégia de vigilância e implementação da RAM

source: Contact our enterprise team at ``amrnetdashboard@gmail.com`` for more information.
es: Póngase en contacto con nuestro equipo empresarial en ``amrnetdashboard@gmail.com`` para más información.
fr: Contactez notre équipe d'entreprise à ``amrnetdashboard@gmail.com`` pour plus d'informations.
pt: Entre em contato com a nossa equipe corporativa em ``amrnetdashboard@gmail.com`` para mais informações.

source: Changelog and Versioning
es: Cambios y versiones
fr: Changelog et Versioning
pt: Mudanças e Versionamento

source: The AMRnet API follows semantic versioning. Major version changes may include breaking changes, while minor versions add features with backward compatibility.
es: La API de AMRnet sigue la versión semántica. Los cambios en la versión mayor pueden incluir cambios de ruptura, mientras que las versiones menores añaden características con compatibilidad con versiones anteriores.
fr: L'API AMRnet suit les versions sémantiques. Les changements majeurs de version peuvent inclure des changements de rupture, tandis que les versions mineures ajoutent des fonctionnalités avec la compatibilité ascendante.
pt: A API AMRnet segue o versionamento semântico. Alterações na versão principais podem incluir alterações na falha, enquanto versões menores adicionam recursos com compatibilidade com versões anteriores.

source: Current Version: v2.1.0
es: Versión actual: v2.1.0
fr: Version actuelle : v2.1.0
pt: Versão atual: v2.1.0

source: **New Features:** - FARM stack implementation with FastAPI backend - Real-time WebSocket endpoints for live data streaming - GraphQL API support for flexible queries - Enhanced geospatial analysis capabilities - Machine learning prediction endpoints
es: **Nuevas características:** - Implementación de pila FARM con backend FastAPI - endpoints WebSocket en tiempo real para streaming de datos en vivo - Soporte API GraphQL para consultas flexibles - Capacidades de análisis geoespacial mejoradas - endpoints de predicción de aprendizaje automático
fr: **Nouvelles fonctionnalités :** - Implémentation de piles FARM avec le backend FastAPI - Points de terminaison WebSocket en temps réel pour le streaming de données en temps réel - Prise en charge de l'API GraphQL pour les requêtes flexibles - Fonctionnalités avancées d'analyse géospatiale - Terminaux d'apprentissage automatique de la prédiction
pt: **Novos Recursos:** - Implementação FARM stack com o backend FastAPI - endpoints de WebSocket em tempo real para streaming de dados ao vivo - API GraphQL para consultas flexíveis - Recursos de análise geoespacial melhorados - Pontos de previsão do aprendizado automático

source: **Improvements:** - 40% faster response times with async processing - Improved error messages with detailed diagnostics - Enhanced rate limiting with burst capacity - Better caching for frequently accessed data
es: **Mejoras:** - 40% más rápido de los tiempos de respuesta con procesamiento asíncrono - Mejores mensajes de error con diagnósticos detallados - Límite de velocidad mejorada con capacidad de ráfagas - Mejor caché para datos de acceso frecuente
fr: **Améliorations:** - 40% de temps de réponse plus rapides avec un traitement asynchrone - Messages d'erreur améliorés avec des diagnostics détaillés - Taux de limitation amélioré avec capacité d'éclatement - Meilleure mise en cache pour les données fréquemment consultées
pt: **Melhorias:** - 40% mais rápido de resposta com processamento assíncrono - Mensagens de erro melhoradas com diagnósticos detalhados - Limite de velocidade aumentada com capacidade de estouramento - Melhor cache para dados acessados com frequência

source: **Bug Fixes:** - Fixed pagination issues with large datasets - Resolved timezone handling in date filters - Corrected resistance rate calculations for specific genotypes
es: **Correcciones de errores:** - Solucionado problemas de paginación con grandes conjuntos de datos - Resuelto manejo de zonas de tiempo en filtros de fecha - Corregidos cálculos de tasa de resistencia para genotipos específicos
fr: **Corrections de bugs :** - Problèmes de pagination résolus avec de grands jeux de données - Gestion résolue des fuseaux horaires dans les filtres de dates - Calcul de la résistance pour les génotypes spécifiques
pt: **Correções de bugs:** - Problemas de paginação corrigidos com grandes conjuntos de dados - Manutenção de fuso horário resolvido nos filtros de data - Cálculos de taxa de resistência fixa para genótipos específicos

source: Version History
es: Historial de versiones
fr: Historique des versions
pt: Histórico de Versão

source: **v2.1.0** (2024-12-30): FARM stack implementation, real-time features
es: **v2.1.0** (2024-12-30): implementación de pila FARM, características en tiempo real
fr: **v2.1.0** (2024-12-30): implémentation de piles FARM, fonctionnalités en temps réel
pt: **v2.1.0** (2024-12-30): Implementação da pilha FARM, recursos em tempo real

source: **v2.0.0** (2024-06-15): Major API redesign with consistent endpoints
es: **v2.0.0** (2024-06-15): Rediseño de la API principal con puntos finales consistentes
fr: **v2.0.0** (2024-06-15): Reconception majeure de l'API avec des points de terminaison cohérents
pt: **v2.0.0** (2024-06-15): Redesign de API principal com endpoints consistentes

source: **v1.5.2** (2024-03-10): Enhanced filtering and export capabilities
es: **v1.5.2** (2024-03-10): Capacidades de filtrado y exportación mejoradas
fr: **v1.5.2** (2024-03-10): Amélioration des capacités de filtrage et d'exportation
pt: **v1.5.2** (2024-03-10): Filtragem e recursos de exportação aprimorados

source: **v1.5.0** (2024-01-20): Added summary statistics endpoints
es: **v1.5.0** (2024-01-20): Se añadieron puntos finales de estadísticas de resumen
fr: **v1.5.0** (2024-01-20): Fin des statistiques ajoutées
pt: **v1.5.0** (2024-01-20): Adicionado resumos de estatísticas

source: **v1.4.1** (2023-11-05): Performance improvements and bug fixes
es: **v1.4.1** (2023-11-05): Mejoras de rendimiento y correcciones de errores
fr: **v1.4.1** (2023-11-05) : Améliorations des performances et corrections de bugs
pt: **v1.4.1** (2023-11-05): Melhorias de desempenho e correções de bugs

source: **v1.4.0** (2023-09-15): OAuth2 authentication support
es: **v1.4.0** (2023-09-15): soporte de autenticación OAuth2
fr: **v1.4.0** (2023-09-15): Support de l'authentification OAuth2
pt: **v1.4.0** (2023-09-15): suporte a autenticação OAuth2

source: **v1.3.0** (2023-07-01): API key authentication system
es: **v1.3.0** (2023-07-01): Sistema de autenticación de claves API
fr: **v1.3.0** (2023-07-01) : Système d'authentification des clés API
pt: **v1.3.0** (2023-07-01): sistema de autenticação de chave de API

source: **v1.2.0** (2023-04-10): CSV export functionality
es: **v1.2.0** (2023-04-10): funcionalidad de exportación CSV
fr: **v1.2.0** (2023-04-10): Fonction d'exportation CSV
pt: **v1.2.0** (2023-04-10): funcionalidade de exportação CSV

source: **v1.1.0** (2023-02-01): Pagination and advanced filtering
es: **v1.1.0** (2023-02-01): Paginación y filtrado avanzado
fr: **v1.1.0** (2023-02-01) : Pagination et filtrage avancé
pt: **v1.1.0** (2023-02-01): Paginação e filtragem avançada

source: **v1.0.0** (2023-01-01): Initial public API release
es: **v1.0.0** (2023-01-01): Versión pública inicial de la API
fr: **v1.0.0** (2023-01-01) : Version initiale de l'API publique
pt: **v1.0.0** (2023-01-01): Versão inicial da API pública

source: Migration Guides
es: Guía de Migración
fr: Tutoriels de migration
pt: Guias de migração

source: **Migrating from v1.x to v2.x:**
es: **Migración de v1.x a v2.x:**
fr: **Migration de v1.x vers v2.x:**
pt: **Migrando da v1.x para v2.x:**

source: **Breaking Changes in v2.0:** - Endpoint structure simplified (``/data/{organism}`` → ``/{organism}``) - Response format standardized across all endpoints - Date filtering uses ``year_start``/``year_end`` instead of ``date_from``/``date_to`` - Resistance values standardized (R/I/S instead of numeric codes)
es: **Cambios de ruptura en v2. :** - Estructura de punto final simplificada (``/data/{organism}`` → ``/{organism}``) - Formato de respuesta estandarizado en todos los extremos - El filtro de fechas utiliza ``year_start``/``year_end`` en lugar de ``date_from``/``date_to`` - Valores de resistencia estandarizados (R/I/S en lugar de códigos numéricos)
fr: **Casser les changements dans v2. :** - Structure d'extrémité simplifiée (``/data/{organism}`` → ``/{organism}``) - Format de réponse standardisé sur tous les terminaux - Le filtrage de date utilise ``year_start``/``year_end`` au lieu de ``date_from``/``date_to`` - Valeurs de résistance normalisées (R/I/S au lieu de codes numériques)
pt: **Quebrando mudanças na v2. :** Estrutura de Endpoint simplificada (``/data/{organism}`` → ``/{organism}``) - Formato de resposta padronizado em todos os endpoints - filtragem de datas usa ``year_start``/``year_end`` em vez de ``date_from``/``date_to`` - Valores de resistência padronizados (R/I/S em vez de códigos numéricos)

source: Deprecation Notice
es: Aviso de Deprecación
fr: Avis de dépréciation
pt: Aviso de desaprovação

source: **v1.x API endpoints will be deprecated on June 30, 2025.** Please migrate to v2.x endpoints before this date. Legacy endpoints will continue to work until December 31, 2025, after which they will be permanently removed.
es: **los endpoints de la API v1.x serán obsoletos el 30 de junio de 2025.** Por favor migra a los endpoints v2.x antes de esta fecha. Los puntos finales antiguos seguirán funcionando hasta el 31 de diciembre de 2025, después de lo cual serán eliminados permanentemente.
fr: **Les points de terminaison de l'API v1.x seront obsolètes le 30 juin 2025.** Veuillez migrer vers les points de terminaison v2.x avant cette date. Les anciens terminaux continueront de fonctionner jusqu'au 31 décembre 2025, après quoi ils seront supprimés définitivement.
pt: **v1.x endpoints de API serão descontinuados em 30 de junho de 2025.** Por favor, migre para a v2.x pontos de extremidade antes desta data. Os endpoints legados continuarão a funcionar até 31 de Dezembro de 2025, após o que serão permanentemente removidos.

source: *E. coli*
pt: *E. colibo*

source: *Salmonella* enterica
fr: *Salmonella* entérique
pt: Consulta de *Salmonela*

source: **🐛 Issue Tracker**: `github.com/amrnet/amrnet/issues <https://github.com/amrnet/amrnet/issues>`_
fr: **🐛 Suivi de problèmes**: `github.com/amrnet/amrnet/issues <https://github.com/amrnet/amrnet/issues>`_
