Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/codeofconduct.po
Languages: es, fr, pt

source: Code of Conduct
es: Código de conducta
fr: Code de conduite
pt: Código de Conduta

source: Our Pledge
es: Nuestro compromiso
fr: Notre Engagement
pt: Nosso Compromisso

source: We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for everyone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity and expression, level of experience, education, socio-economic status, nationality, personal appearance, race, caste, color, religion, or sexual identity and orientation.
es: Nosotros, como miembros, colaboradores y líderes, nos comprometemos a hacer de la participación en nuestra comunidad una experiencia sin acoso para todos, sin importar la edad, tamaño del cuerpo, discapacidad visible o invisible, etnicidad, rasgos sexuales, identidad y expresión de género, nivel de experiencia, educación, estatus socioeconómico, nacionalidad, apariencia personal, raza, casta, color, religión o identidad y orientación sexual.
fr: En tant que membres, contributeurs et dirigeants, nous nous engageons à faire de la participation à notre communauté une expérience sans harcèlement pour tout le monde, indépendamment de l'âge, de la taille du corps, de l'incapacité visible ou invisible, de l'origine ethnique, les caractéristiques sexuelles, l’identité et l’expression du sexe, le niveau d’expérience, l’éducation, le statut socio-économique, la nationalité, l’apparence personnelle, la race, la caste, la couleur, la religion ou l’identité et l’orientation sexuelles.
pt: Nós, como membros, contribuintes e líderes, comprometemo-nos a fazer da participação na nossa comunidade uma experiência sem assédio para todos. independentemente da idade, tamanho do corpo, deficiência visível ou invisível, etnia, características sexuais, identidade e expressão de género, nível de experiência, educação, estatuto socioeconómico, nacionalidade, aparência pessoal, raça, casta, cor, religião ou identidade e orientação sexual.

source: We pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community.
es: Nos comprometemos a actuar e interactuar de maneras que contribuyan a una comunidad abierta, acogedora, diversa, inclusiva y saludable.
fr: Nous nous engageons à agir et à interagir de manière à contribuer à une communauté ouverte, accueillante, diversifiée, inclusive et saine.
pt: Comprometemo-nos a agir e a interagir de formas que contribuam para uma comunidade aberta, bem-vinda, diversificada, inclusiva e saudável.

source: Our Standards
es: Nuestros Estándares
fr: Nos normes
pt: Nossos Padrões

source: Examples of behavior that contributes to a positive environment for our community include:
es: Los ejemplos de comportamiento que contribuyen a un ambiente positivo para nuestra comunidad incluyen:
fr: Des exemples de comportement qui contribuent à un environnement positif pour notre communauté incluent :
pt: Exemplos de comportamento que contribuem para um ambiente positivo para a nossa comunidade incluem:

source: Demonstrating empathy and kindness toward other people
es: Demostrar empatía y amabilidad hacia otras personas
fr: Faire preuve d'empathie et de gentillesse envers les autres
pt: Demonstração de empatia e bondade para com outras pessoas

source: Being respectful of differing opinions, viewpoints, and experiences
es: Ser respetuoso con las diferentes opiniones, puntos de vista y experiencias
fr: Être respectueux des opinions, des points de vue et des expériences divergentes
pt: Ser respeitoso com opiniões diferentes, pontos de vista e experiências

source: Giving and gracefully accepting constructive feedback
es: Dando y aceptando con gracia comentarios constructivos
fr: Donner et accepter gracieusement les commentaires constructifs
pt: Dando e aceitando graciosamente feedback construtivo

source: Accepting responsibility and apologizing to those affected by our mistakes, and learning from the experience
es: Aceptar la responsabilidad y disculpar a los afectados por nuestros errores y aprender de la experiencia
fr: Accepter la responsabilité et présenter des excuses à ceux qui sont touchés par nos erreurs, et tirer des enseignements de l'expérience
pt: Aceitar responsabilidade e pedir desculpas àqueles afetados por nossos erros e aprender com a experiência

source: Focusing on what is best not just for us as individuals, but for the overall community
es: Centrarse en lo que es mejor no sólo para nosotros como individuos, sino para la comunidad en general
fr: Se concentrer sur ce qui est le mieux non seulement pour nous en tant qu'individus, mais aussi pour la communauté dans son ensemble
pt: Concentre-se no que é melhor não apenas para nós como indivíduos, mas para toda a comunidade

source: Examples of unacceptable behavior include:
es: Ejemplos de comportamiento inaceptable incluyen:
fr: Parmi les exemples de comportement inacceptable, citons :
pt: Exemplos de comportamento inaceitável incluem:

source: The use of sexualized language or imagery, and sexual attention or advances of any kind
es: Uso de lenguaje o imágenes sexualizadas, atención sexual o avances de cualquier tipo
fr: L'utilisation d'un langage ou d'une image sexualisés, et l'attention sexuelle ou les avancées de toute sorte
pt: Utilização de linguagens ou imagens sexuais, e atenção sexual ou avanços de qualquer tipo

source: Trolling, insulting or derogatory comments, and personal or political attacks
es: Trolling, insultante o irregular comentarios, y ataques personales o políticos
fr: Trolling, insultants ou désobligeants, attaques personnelles ou politiques
pt: Trollar, insultar ou depreciar comentários e ataques políticos ou pessoais

source: Public or private harassment
es: Acoso público o privado
fr: Le harcèlement public ou privé
pt: Assédio público ou privado

source: Publishing others' private information, such as a physical or email address, without their explicit permission
es: Publicar la información privada de los demás, como una dirección física o de correo electrónico, sin su permiso explícito
fr: Publier des informations personnelles d'autres personnes, telles qu'une adresse physique ou électronique, sans leur permission explicite
pt: Publicar informações privadas de terceiros, como um endereço físico ou de e-mail, sem sua permissão explícita

source: Other conduct which could reasonably be considered inappropriate in a professional setting
es: Otras conductas que razonablemente podrían considerarse inapropiadas en un entorno profesional
fr: Autres comportements qui pourraient raisonnablement être considérés comme inappropriés dans un environnement professionnel
pt: Outra conduta que poderia razoavelmente ser considerada inadequada em uma configuração profissional

source: Enforcement Responsibilities
es: Responsibilidades
fr: Responsabilités de l'application
pt: Responsabilidades da Aplicação

source: Community leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take appropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive, or harmful.
es: Los líderes comunitarios son responsables de aclarar y hacer cumplir nuestros estándares de comportamiento aceptable y tomarán medidas correctivas adecuadas y justas en respuesta a cualquier comportamiento que consideren inapropiado, amenazante, ofensivo o perjudicial.
fr: Les dirigeants de la communauté sont responsables de la clarification et de l'application de nos normes de comportement acceptables et prendront les mesures correctives appropriées et équitables en réponse à tout comportement qu'ils jugent inapproprié, menaçant, offensant ou nocif.
pt: Os líderes comunitários são responsáveis pela clarificação e aplicação dos nossos padrões de comportamento aceitável e tomarão medidas correctivas adequadas e justas em resposta a qualquer comportamento que considerem inadequado. ameaçando, ofensivo ou prejudicial.

source: Community leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for moderation decisions when appropriate.
es: Los líderes de la comunidad tienen el derecho y la responsabilidad de eliminar, editar o rechazar comentarios, commits, código, ediciones de wiki, problemas, y otras contribuciones que no estén alineadas a este Código de Conducta, y comunicarán razones para tomar decisiones de moderación cuando proceda.
fr: Les dirigeants de la communauté ont le droit et la responsabilité de supprimer, modifier ou rejeter les commentaires, les commits, le code, les modifications du wiki, les problèmes et les autres contributions qui ne sont pas conformes au présent Code de conduite et qui communiqueront les motifs des décisions de modération le cas échéant.
pt: Os líderes da Comunidade têm o direito e a responsabilidade de remover, editar ou rejeitar comentários, commits, código, edição da wiki, questões e outras contribuições que não estão alinhadas com este Código de Conduta e comunicarão razões para decisões de moderação quando apropriado.

source: Scope
es: Alcance
fr: Périmètre d'application
pt: Escopo

source: This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing the community in public spaces. Examples of representing our community include using an official e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event.
es: Este Código de Conducta se aplica en todos los espacios comunitarios, y también se aplica cuando un individuo representa oficialmente a la comunidad en espacios públicos. Ejemplos de representar a nuestra comunidad incluyen el uso de una dirección de correo electrónico oficial, publicar a través de una cuenta oficial de redes sociales, o actuar como representante designado en un evento en línea o fuera de línea.
fr: Ce Code de conduite s'applique dans tous les espaces communautaires, et s'applique également lorsqu'une personne représente officiellement la communauté dans les espaces publics. Les exemples de représentation de notre communauté incluent l'utilisation d'une adresse e-mail officielle, poster par l'intermédiaire d'un compte officiel de médias sociaux, ou agir en tant que représentant désigné lors d'un événement en ligne ou hors ligne.
pt: Este Código de Conduta aplica-se em todos os espaços comunitários, e também se aplica quando um indivíduo representa oficialmente a comunidade em espaços públicos. Exemplos de representar nossa comunidade incluem o uso de um endereço de e-mail oficial, postando através de uma conta de mídia social oficial, ou agindo como um representante nomeado em um evento on-line ou offline.

source: Enforcement
es: Aplaudido
fr: Application de la loi
pt: Execução

source: Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible for enforcement at amrnetdashboard@gmail.com. All complaints will be reviewed and investigated promptly and fairly.
es: Se pueden informar a los líderes de la comunidad responsables de hacer cumplir amrnetdashboard@gmail. Todas las quejas serán revisadas e investigadas de forma rápida y justa.
fr: Des cas de comportement abusif, de harcèlement ou tout autre comportement inacceptable peuvent être signalés aux dirigeants de la communauté responsables de l’application de la loi à amrnetdashboard@gmail. Toutes les plaintes seront examinées et examinées rapidement et équitablement.
pt: Instâncias de comportamento abusivo, assédio ou de outra forma inaceitável podem ser relatadas aos líderes da comunidade responsáveis pela aplicação em amrnetdashboard@gmail. Todas as queixas serão revistas e investigadas de forma rápida e justa.

source: All community leaders are obligated to respect the privacy and security of the reporter of any incident.
es: Todos los líderes de la comunidad están obligados a respetar la privacidad y seguridad del reportero de cualquier incidente.
fr: Tous les dirigeants de la communauté sont tenus de respecter la vie privée et la sécurité du journaliste de tout incident.
pt: Todos os líderes da comunidade são obrigados a respeitar a privacidade e a segurança do repórter de qualquer incidente.

source: Enforcement Guidelines
es: Emplear directrices
fr: Lignes directrices pour l'application de la loi
pt: Diretrizes de execução

source: Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem in violation of this Code of Conduct:
es: Los líderes comunitarios seguirán estas Directrices de Impacto Comunitario para determinar las consecuencias de cualquier acción que consideren en violación de este Código de Conducta:
fr: Les dirigeants de la communauté suivront ces lignes directrices d'impact communautaire pour déterminer les conséquences pour toute action qu'ils jugent en violation de ce code de conduite :
pt: Os líderes comunitários seguirão estas orientações de impacto na determinação das consequências de qualquer acção que considerem contrária a este Código de Conduta:

source: 1. Correction
es: 1. Corrección
pt: 1. Correção

source: **Community Impact**: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the community.
es: **Impacto de la comunidad**: Uso de un lenguaje inapropiado u otro comportamiento considerado no profesional o no bienvenido en la comunidad.
fr: **Impact de la communauté** : utilisation d'un langage inapproprié ou d'un autre comportement jugé non professionnel ou indésirable dans la communauté.
pt: **Impacto Comunitário**: uso de idioma inapropriado ou de outro comportamento considerado não profissional ou indesejado na comunidade.

source: **Consequence**: A private, written warning from community leaders, providing clarity around the nature of the violation and an explanation of why the behavior was inappropriate. A public apology may be requested.
es: **Encuentra**: Una advertencia privada y escrita de los líderes de la comunidad, proporcionando claridad acerca de la naturaleza de la violación y una explicación de por qué el comportamiento fue inapropiado. Se puede solicitar una disculpa pública.
fr: **Conséquence**: Un avertissement privé et écrit des dirigeants de la communauté, qui clarifie la nature de la violation et explique pourquoi le comportement était inapproprié. Des excuses publiques peuvent être demandées.
pt: **Consequência**: uma advertência escrita e privada dos líderes comunitários, proporcionando clareza em torno da natureza da violação e uma explicação de por que o comportamento era inadequado. Poderá solicitar-se um pedido de desculpas ao público.

source: 2. Warning
es: 2. Advertencia
fr: 2. Avertissement
pt: 2. Aviso

source: **Community Impact**: A violation through a single incident or series of actions.
es: **Impacto de la comunidad**: Una violación a través de un solo incidente o serie de acciones.
fr: **Impact de la communauté** : Une violation par un seul incident ou une seule série d'actions.
pt: **Impacto Comunitário**: uma violação através de um único incidente ou uma série de ações.

source: **Consequence**: A warning with consequences for continued behavior. No interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding interactions in community spaces as well as external channels like social media. Violating these terms may lead to a temporary or permanent ban.
es: **Comienza**: Una advertencia con consecuencias para el comportamiento continuo. Ninguna interacción con las personas involucradas, incluyendo la interacción no solicitada con las personas que aplican el Código de Conducta, durante un período de tiempo determinado. Esto incluye evitar interacciones tanto en espacios comunitarios como en canales externos como en medios sociales. La violación de estos términos puede llevar a una prohibición temporal o permanente.
fr: **Conséquence**: Un avertissement avec des conséquences pour un comportement continu. Aucune interaction avec les personnes concernées, y compris une interaction non sollicitée avec celles qui appliquent le Code de conduite, pendant une période déterminée. Cela comprend notamment éviter les interactions dans les espaces communautaires ainsi que les canaux externes comme les médias sociaux. La violation de ces conditions peut entraîner une interdiction temporaire ou permanente.
pt: **Consequência**: um aviso com consequências para o comportamento contínuo. Nenhuma interacção com as pessoas envolvidas, incluindo a interacção não solicitada com as pessoas que aplicam o Código de Conduta, durante um determinado período de tempo. Isso inclui evitar interações em espaços comunitários e canais externos, como mídia social. Violar estes termos pode levar a uma proibição temporária ou permanente.

source: 3. Temporary Ban
es: 3. Baneo temporal
fr: 3. Ban temporaire
pt: 3. Banimento temporário

source: **Community Impact**: A serious violation of community standards, including sustained inappropriate behavior.
es: **Impacto Comunitario**: Una grave violación de los estándares comunitarios, incluyendo un comportamiento inapropiado sostenido.
fr: **Impact de la communauté** : Une grave violation des normes communautaires, y compris un comportement inapproprié.
pt: **Impacto da Comunidade**: uma grave violação dos padrões da comunidade, incluindo comportamento inadequado.

source: **Consequence**: A temporary ban from any sort of interaction or public communication with the community for a specified period of time. No public or private interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban.
es: **Comienza**: Una prohibición temporal de cualquier tipo de interacción o comunicación pública con la comunidad durante un período de tiempo determinado. Durante este período no se permite ninguna interacción pública o privada con las personas implicadas, incluida la interacción no solicitada con quienes aplican el Código de Conducta. La violación de estos términos puede llevar a una prohibición permanente.
fr: **Conséquence**: Interdiction temporaire de toute forme d'interaction ou de communication publique avec la communauté pour une période déterminée. Aucune interaction publique ou privée avec les personnes concernées, y compris une interaction non sollicitée avec celles qui appliquent le Code de conduite, n’est autorisée durant cette période. La violation de ces conditions peut conduire à une interdiction permanente.
pt: **Consequência**: um banimento temporário de qualquer tipo de interação ou comunicação pública com a comunidade por um determinado período de tempo. Não é permitida durante este período qualquer interacção pública ou privada com as pessoas envolvidas, incluindo a interacção não solicitada com as que aplicam o Código de Conduta. Violar estes termos pode levar a uma proibição permanente.

source: 4. Permanent Ban
es: 4. Bloqueo permanente
fr: 4. Ban permanent
pt: 4. Banimento permanente

source: **Community Impact**: Demonstrating a pattern of violation of community standards, including sustained inappropriate behavior, harassment of an individual, or aggression toward or disparagement of classes of individuals.
es: **Impacto de la comunidad**: Demostrar un patrón de violación de los estándares comunitarios, incluyendo un comportamiento inapropiado sostenido, acoso a un individuo, o agresión hacia o disipación de clases de individuos.
fr: **Impact de la communauté** : Démontrer un modèle de violation des normes de la communauté, y compris un comportement inapproprié, le harcèlement d'une personne, ou l'agression ou le dénigrement de catégories de personnes.
pt: **Impacto Comunitário**: Demonstrando um padrão de violação dos padrões da comunidade, incluindo comportamento inapropriado assédio de um indivíduo, ou agressão contra ou depreciação das classes de indivíduos.

source: **Consequence**: A permanent ban from any sort of public interaction within the community.
es: **Encuentra**: Una prohibición permanente de cualquier tipo de interacción pública dentro de la comunidad.
fr: **Conséquence**: Interdiction permanente de toute interaction publique au sein de la communauté.
pt: **Consequência**: um banimento permanente de qualquer tipo de interação pública dentro da comunidade.

source: Attribution
es: Atribución
pt: Atribuição

source: This Code of Conduct is adapted from the `Contributor Covenant <https://www.contributor-covenant.org>`__, version 2.1, available at https://www.contributor-covenant.org/version/2/1/code_of_conduct.html.
es: Este Código de Conducta se adapta del `Pacto de Colaboradores <https://www.contributor-covenant.org>`__, versión 2.1, disponible en https://www.contributor-covenant.org/version/2/1/code_of_conduct.html.
fr: Ce Code de Conduite est adapté à partir du `Contributor Covenant <https://www.contributor-covenant.org>`__, version 2.1, disponible sur https://www.contributor-covenant.org/version/2/1/code_of_conduct.html.
pt: Este Código de Conduta foi adaptado do `Pacto do Contribuidor <https://www.contributor-covenant.org>`__, versão 2.1, disponível em https://www.contributor-covenant.org/version/2/1/code_of_conduct.html.

source: Community Impact Guidelines were inspired by `Mozilla's code of conduct enforcement ladder <https://github.com/mozilla/diversity>`__.
es: Las Directrices de Impacto Comunitario se inspiraron en `El código de conducta de Mozilla para hacer cumplir la ley <https://github.com/mozilla/diversity>`__.
fr: Les directives d'impact de la communauté ont été inspirées par le `code de conduite de Mozilla échelle de mise en application de la loi <https://github.com/mozilla/diversity>`__.
pt: As diretrizes de impacto da Comunidade foram inspiradas pelo código de conduta da Mozilla <https://github.com/mozilla/diversity>`__.

source: For answers to common questions about this code of conduct, see the FAQ at https://www.contributor-covenant.org/faq. Translations are available at https://www.contributor-covenant.org/translations.
es: Para respuestas a preguntas comunes sobre este código de conducta, consulta la sección de preguntas frecuentes en https://www.contributor-covenant.org/faq. Las traducciones están disponibles en https://www.contributor-covenant.org/translations.
fr: Pour obtenir des réponses aux questions les plus fréquemment posées sur ce code de conduite, consultez la FAQ https://www.contributor-covenant.org/faq. Les traductions sont disponibles sur https://www.contributor-covenant.org/translations.
pt: Para respostas a perguntas comuns sobre este código de conduta, veja o FAQ em https://www.contributor-covenant.org/faq. As traduções estão disponíveis em https://www.contributor-covenant.org/translations.
