Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: es, fr, pt

source: Contributor Guide: Issues & PRs
es: Guía del colaborador: Problemas y PRs
fr: Guide du contributeur : Problèmes & PRs
pt: Guia de contribuidores: problemas e PRs

source: Thank you for your interest in improving this project. This project is open-source under the `GPL-3.0 license <https://opensource.org/licenses/GPL-3.0>`__. and welcomes contributions in the form of bug reports, feature requests, and pull requests.
es: Gracias por su interés en mejorar este proyecto. Este proyecto es de código abierto bajo el `GPL-3. licencia <https://opensource.org/licenses/GPL-3.0>`__. y acoge con satisfacción las contribuciones en forma de informes de fallos, solicitudes de características y solicitudes de extracción.
fr: Merci de votre intérêt pour l'amélioration de ce projet. Ce projet est open-source sous la GPL-3. sous licence <https://opensource.org/licenses/GPL-3.0>`__. et bienvenue aux contributions sous forme de rapports de bogues, de demandes de fonctionnalités et de demandes de pulling.
pt: Obrigado por seu interesse em melhorar este projeto. Este projeto é de código aberto sob a `GPL-3. licença <https://opensource.org/licenses/GPL-3.0>`__. e saúda contribuições na forma de relatórios de bugs, solicitações de funcionalidades e pull requests.

source: Here is a list of important resources for contributors:
es: Aquí hay una lista de recursos importantes para los colaboradores:
fr: Voici une liste des ressources importantes pour les contributeurs :
pt: Aqui está uma lista de recursos importantes para os contribuidores:

source: `Source Code <https://github.com/amrnet>`__
es: `Código fuente <https://github.com/amrnet>`__
fr: `Code Source <https://github.com/amrnet>`__
pt: `Código fonte <https://github.com/amrnet>`__

source: `Documentation <https://amrnet.readthedocs.io/>`__
es: `Documentación <https://amrnet.readthedocs.io/>`__
pt: `Documentação <https://amrnet.readthedocs.io/>`__

source: `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__
es: `Rastreador de problemas <https://github.com/amrnet/amrnet/issues>`__
fr: `Suivi des tickets <https://github.com/amrnet/amrnet/issues>`__
pt: `Rastreador de Issues <https://github.com/amrnet/amrnet/issues>`__

source: :doc:`Code of Conduct <codeofconduct>`
es: :doc:`Código de Conducta <codeofconduct>`
fr: :doc:`Code de Conduite <codeofconduct>`
pt: :doc:`Código de Conduta <codeofconduct>`

source: How to report a bug
es: Cómo reportar un error
fr: Comment signaler un bug
pt: Como relatar um bug

source: Report bugs on the `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__.
es: Reporta errores en el `Registrador de problemas <https://github.com/amrnet/amrnet/issues>`__.
fr: Signaler les bugs sur le `Ticket Tracker <https://github.com/amrnet/amrnet/issues>`__.
pt: Relate erros no `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__.

source: When filing an issue, make sure to answer these questions:
es: Cuando se presenta un problema, asegúrese de responder a estas preguntas:
fr: Lors du dépôt d'un problème, assurez-vous de répondre à ces questions :
pt: Ao arquivar um problema, certifique-se de responder estas questões:

source: Which operating system and Python version are you using?
es: ¿Qué sistema operativo y versión de Python estás usando?
fr: Quel système d'exploitation et quelle version de Python utilisez-vous ?
pt: Qual sistema operacional e versão do Python você está usando?

source: Which version of this project are you using?
es: ¿Qué versión de este proyecto estás usando?
fr: Quelle version de ce projet utilisez-vous ?
pt: Qual versão deste projeto você está usando?

source: What did you do?
es: ¿Qué has hecho?
fr: Qu'avez-vous fait ?
pt: O que você fez?

source: What did you expect to see?
es: ¿Qué esperabas ver?
fr: Qu'est-ce que vous attendiez à voir?
pt: O que você esperava ver?

source: What did you see instead?
es: ¿Qué ves en su lugar?
fr: Qu'est-ce que vous avez vu à la place?
pt: O que você viu em vez disso?

source: The best way to get your bug fixed is to provide a test case, and/or steps to reproduce the issue.
es: La mejor manera de arreglar el fallo es proporcionar un caso de prueba, y/o pasos para reproducir el problema.
fr: La meilleure façon de corriger votre bogue est de fournir un cas de test, et/ou des étapes pour reproduire le problème.
pt: A melhor maneira de corrigir seu bug é fornecer um caso de teste, e/ou etapas para reproduzir o problema.

source: How to request a feature
es: Cómo solicitar una característica
fr: Comment demander une fonctionnalité
pt: Como solicitar um recurso

source: Features that improve ``AMRnet`` can be suggested on the `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__. It's a good idea to first submit the proposal as a feature request prior to submitting a pull request as this allows for the best coordination of efforts by preventing the duplication of work, and allows for feedback on your ideas.
es: Las características que mejoran ``AMRnet`` pueden sugerirse en `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__. Es una buena idea enviar primero la propuesta como una solicitud de característica antes de enviar una solicitud de extracción ya que esto permite la mejor coordinación de esfuerzos al prevenir la duplicación del trabajo, y le permite hacer comentarios sobre sus ideas.
fr: Les fonctionnalités qui améliorent ``AMRnet`` peuvent être suggérées sur le `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__. C'est une bonne idée de soumettre d'abord la proposition en tant que demande de fonctionnalité avant de soumettre une pull request car cela permet la meilleure coordination des efforts en évitant la duplication du travail, et vous permet de faire des commentaires sur vos idées.
pt: Recursos que melhoram o ``AMRnet`` podem ser sugeridos no `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__. É uma boa ideia primeiro enviar a proposta como um pedido de recurso antes de enviar um pull request, pois isso permite a melhor coordenação de esforços, evitando a duplicação de trabalho. e permite comentários sobre suas ideias.

source: Contributor Guide: Research & Development
es: Guía del colaborador: Investigación y Desarrollo
fr: Guide du contributeur : Recherche & Développement
pt: Guia de Contribuição: Pesquisa e Desenvolvimento

source: Thank you for your interest in contributing to AMRnet! 🎉 We welcome contributions from researchers, developers, and public health professionals worldwide. This project is open-source under the `GPL-3.0 license <https://opensource.org/licenses/GPL-3.0>`__ and welcomes contributions in the form of bug reports, feature requests, and pull requests.
es: Gracias por su interés en contribuir a AMRnet! 🎉 Acogemos con satisfacción las contribuciones de investigadores, desarrolladores y profesionales de la salud pública en todo el mundo. Este proyecto es de código abierto bajo la licencia `GPL-3.0 <https://opensource.org/licenses/GPL-3.0>`__ y acoge con satisfacción las contribuciones en forma de informes de fallos, solicitudes de características y solicitudes de extracción.
fr: Nous vous remercions de votre intérêt à contribuer à AMRnet! 🎉 Nous saluons les contributions des chercheurs, des développeurs et des professionnels de la santé publique du monde entier. Ce projet est open-source sous la licence `GPL-3.0 <https://opensource.org/licenses/GPL-3.0>`__ et accueille favorablement les contributions sous la forme de rapports de bogue, de demandes de fonctionnalités et de pull requests.
pt: Obrigado pelo seu interesse em contribuir para AMRnet! 🎉 Saudamos as contribuições de pesquisadores, desenvolvedores e profissionais de saúde pública em todo o mundo. Este projeto tem código aberto sob a licença `GPL-3.0 <https://opensource.org/licenses/GPL-3.0>`__ e saúda as contribuições na forma de relatórios de bugs, solicitações de recursos e pull requests.

source: `Source Code <https://github.com/amrnet/amrnet>`__
es: `Código fuente <https://github.com/amrnet/amrnet>`__
fr: `Code Source <https://github.com/amrnet/amrnet>`__
pt: `Código fonte <https://github.com/amrnet/amrnet>`__

source: `Discussions <https://github.com/amrnet/amrnet/discussions>`__
es: `Discusiones <https://github.com/amrnet/amrnet/discussions>`__
pt: `Discussões <https://github.com/amrnet/amrnet/discussions>`__

source: Quick Start
es: Inicio rápido
fr: Démarrage rapide
pt: Início rápido

source: Ready to contribute? Here's how to set up AMRnet for local development:
es: ¿Listo para contribuir? Aquí está cómo configurar AMRnet para el desarrollo local:
fr: Prêt à contribuer ? Voici comment configurer AMRnet pour le développement local :
pt: Pronto para contribuir? Veja como configurar AMRnet para o desenvolvimento local:

source: **Fork** the repository on GitHub
es: **Bifurca** el repositorio en GitHub
fr: **Forcer** le dépôt sur GitHub
pt: **Bifurque** o repositório no GitHub

source: **Clone** your fork locally
es: **Clona** tu bifurcación local
fr: **Cloner** votre fork localement
pt: **Clonar** o seu fork localmente

source: **Create** a feature branch for your changes
es: **Crea** una rama de características para tus cambios
fr: **Créer** une branche pour vos modifications
pt: **Crie** uma branch de função para suas alterações

source: **Make** your changes and test them
es: **Más** tus cambios y pruébalos
fr: **Faitez** vos modifications et testez-les
pt: **Faça** suas alterações e teste-as

source: **Submit** a pull request
es: **Enviar** un pull request
fr: **Soumettre** une pull request
pt: **Enviar** um pull request

source: Types of Contributions
es: Tipos de contribuciones
fr: Types de contributions
pt: Tipos de contribuições

source: Bug Reports
es: Reportes de errores
fr: Rapports de bugs
pt: Relatórios de erros

source: Help us improve by reporting bugs using our `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__.
es: Ayúdanos a mejorar reportando errores usando nuestro `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__.
fr: Aidez-nous à améliorer en signalant les bugs en utilisant notre `Ticket Tracker <https://github.com/amrnet/amrnet/issues>`__.
pt: Ajude-nos a melhorar relatando erros usando nosso `Issue Tracker <https://github.com/amrnet/amrnet/issues>`__.

source: **Before reporting a bug:** - Search existing issues to avoid duplicates - Test with the latest version - Check if the issue occurs in different browsers
es: **Antes de reportar un error:** - Busca problemas existentes para evitar duplicados - Prueba con la última versión - Comprueba si el problema ocurre en diferentes navegadores
fr: **Avant de signaler un bogue:** - Rechercher des problèmes existants pour éviter les doublons - Tester avec la dernière version - Vérifier si le problème se produit dans différents navigateurs
pt: **Antes de relatar um bug:** - Procure issues existentes para evitar duplicados - Teste com a versão mais recente - Verifique se o problema ocorre em navegadores diferentes

source: **When filing a bug report, please include:** - Which operating system and browser you're using - Which version of AMRnet you're using - Steps to reproduce the issue - What you expected to happen - What actually happened - Screenshots if applicable
es: **Al enviar un informe de error, por favor incluye:** - Qué sistema operativo y navegador estás usando - Qué versión de AMRnet estás usando - Pasos para reproducir el problema - Lo que esperabas que suceda - Qué sucedió realmente - Capturas de pantalla si es aplicable
fr: **Lorsque vous remplissez un rapport de bogue, veuillez inclure:** - Quel système d'exploitation et quel navigateur vous utilisez - Quelle version d'AMRnet vous utilisez - Étapes pour reproduire le problème - Ce que vous attendez de voir se passer - Que s'est-il passé - Captures d'écran le cas échéant
pt: **Ao exibir um relatório de bug, por favor, inclua:** - Qual sistema operacional e navegador você está utilizando - Qual versão da AMRnet você está utilizando - Passos para reproduzir o problema - o que você esperava que acontecesse - O que realmente aconteceu - Screenshots se aplicável

source: Feature Requests
es: Solicitudes de características
fr: Demandes de fonctionnalités
pt: Solicitações de recursos

source: We welcome feature suggestions that improve AMRnet's functionality for AMR surveillance.
es: Acogemos con satisfacción las sugerencias de características que mejoran la funcionalidad de AMRnet para el AMR.
fr: Nous accueillons avec plaisir les suggestions de fonctionnalités qui améliorent la fonctionnalité d'AMRnet pour la surveillance AMR.
pt: Congratulamo-nos com sugestões de recursos que melhoram a funcionalidade do AMRnet na supervisão AMR.

source: **Good feature requests include:** - Clear description of the problem being solved - Specific use cases from public health or research perspectives - Consideration of different user types (researchers, policymakers, etc.)
es: **Las solicitudes de buenas características incluyen:** - Descripción clara del problema que se está resolviendo - Casos de uso específicos desde la perspectiva de la salud pública o de la investigación - Consideración de diferentes tipos de usuario (investigadores, diseñadores de políticas, etc.)
fr: **Les bonnes demandes de fonctionnalités comprennent :** - Une description claire du problème à résoudre - Des cas d'utilisation spécifiques provenant de la santé publique ou du point de vue de la recherche - La prise en compte des différents types d'utilisateurs (chercheurs, décideurs, etc.)
pt: **Os bons pedidos de funcionalidades incluem:** - Descrição clara do problema que está sendo resolvido - casos específicos de uso da saúde pública ou perspectivas de pesquisa - consideração de diferentes tipos de usuário (pesquisadores, decisores políticos, etc.)

source: Documentation Improvements
es: Mejoras de documentación
fr: Améliorations de la documentation
pt: Melhorias de Documentação

source: Documentation improvements are always welcome, including: - Fixing typos or clarifying instructions - Adding examples or use cases - Translating content to other languages - Creating tutorials or guides
es: Las mejoras de documentación siempre son bienvenidas, incluyendo: - Corregir errores tipográficos o instrucciones de aclaración - Añadir ejemplos o casos de uso - Traducir contenido a otros idiomas - Crear tutoriales o guías
fr: Les améliorations de la documentation sont toujours les bienvenues, incluant: - Corriger les fautes de frappe ou clarifier les instructions - Ajouter des exemples ou utiliser des cas - Traduire du contenu dans d'autres langues - Créer des tutoriels ou des guides
pt: As melhorias de documentação são sempre bem-vindas, incluindo: - Corrigir erros de digitação ou esclarecer instruções - adicionar exemplos ou usar casos - Traduzindo conteúdo para outras línguas - Criando tutoriais ou guias

source: How to set up your development environment
es: Cómo configurar tu entorno de desarrollo
fr: Comment configurer votre environnement de développement
pt: Como configurar seu ambiente de desenvolvimento

source: Prerequisites
es: Prerrequisitos
fr: Pré-requis
pt: Pré-requisitos

source: Before you begin, ensure you have:
es: Antes de comenzar, asegúrese de tener:
fr: Avant de commencer, assurez-vous que vous avez:
pt: Antes de começar, certifique-se de que:

source: **Node.js** 18+ with npm
es: **Node.js** 18+ con npm
fr: **Node.js** 18+ avec npm
pt: **Node.js** mais de 18 com npm

source: **Python** 3.8+ (for data processing)
es: **Python** 3.8+ (para procesamiento de datos)
fr: **Python** 3.8+ (pour le traitement des données)
pt: **Python** 3.8+ (para processamento de dados)

source: **MongoDB** 6.0+ (local or Atlas)
es: **MongoDB** 6.0+ (local o Atlas)
fr: **MongoDB** 6.0+ (local ou Atlas)
pt: **MongoDB** 6.0+ (local ou Atlas)

source: **Git** for version control
es: **Git** para el control de versiones
fr: **Git** pour le contrôle de version
pt: **Git** para controle de versão

source: Initial Setup
es: Configuración inicial
fr: Configuration initiale
pt: Configuração inicial

source: The application will be available at ``http://localhost:3000`` with the API at ``http://localhost:8080``.
es: La aplicación estará disponible en ``http://localhost:3000`` con la API en ``http://localhost:8080``.
fr: L'application sera disponible sur ``http://localhost:3000`` avec l'API à ``http://localhost:8080``.
pt: O aplicativo estará disponível em ``http://localhost:3000`` com a API em ``http://localhost:8080``.

source: Code Quality Standards
es: Normas de Calidad del Código
fr: Normes de qualité du code
pt: Padrões de qualidade código

source: Linting and Formatting
es: Lintado y formato
fr: Liniation et mise en forme
pt: Vinculando e formatando

source: AMRnet uses ESLint and Prettier to maintain code quality:
es: AMRnet utiliza ESLint y Prettier para mantener la calidad del código:
fr: AMRnet utilise ESLint et Prettier pour maintenir la qualité du code :
pt: AMRnet usa ESLint e Prettier para manter a qualidade do código:

source: Testing
es: Pruebas
fr: Tests en cours
pt: Testando

source: Always include tests with your contributions:
es: Siempre incluye pruebas con tus contribuciones:
fr: Toujours inclure des tests avec vos contributions:
pt: Sempre inclua testes com suas contribuições:

source: Pre-commit hooks automatically run linting and formatting: - Configured via ``.editorconfig`` and ``.prettierrc.json`` - Ensures consistent code style across all contributions
es: Los ganchos de pre-commit ejecutan automáticamente linting y formato: - Configurados a través de ``.editorconfig`` y ``.://ka-perseus-graphie.s3.amazonaws.com/c.json`` - Asegura el estilo de código consistente a través de todas las contribuciones
fr: Les hooks de pré-commit exécutent automatiquement linting et formatting: - Configuré via ``.editorconfig`` et ``.prettierrc.json`` - garantit un style de code cohérent pour toutes les contributions
pt: Os hooks de pré-commit executam automaticamente a linha e formatação: - Configurado via ``.editorconfig`` e ``.prettierrc.json`` - Garante um estilo consistente de código entre todas as contribuições

source: Development Workflow
es: Flujo de trabajo de desarrollo
fr: Flux de travail de développement
pt: Workflow de desenvolvimento

source: Branch Naming
es: Nombre de la rama
fr: Nom de la branche
pt: Nomeação da filial

source: Use descriptive branch names: - ``feature/add-organism-filtering`` - ``bugfix/map-rendering-issue`` - ``docs/update-installation-guide``
es: Usar nombres descriptivos: - ``feature/add-organism-filtering`` - ``bugfix/map-rendering-issue`` - ``docs/update-installation-guide``
fr: Utilisez des noms de branches descriptifs : - ``feature/add-organism-filtering`` - ``bugfix/map-rendering-issue`` - ``docs/update-installation-guide``
pt: Use nomes de ramificações descritivas: - ``feature/add-organism-filtering`` - ``bugfix/map-rendering-issue`` - ``docs/update-installation-guide``

source: Commit Messages
es: Mensajes de commit
fr: Messages de validation
pt: Submeter Mensagens

source: Follow conventional commit format: - ``feat: add new organism filtering capability`` - ``fix: resolve map rendering issue on mobile`` - ``docs: update installation instructions``
es: Seguir formato de commit convencional: - ``feat: añadir nueva capacidad de filtrado de organismo`` - ``fix: resolver problema de renderizado de mapa en móvil`` - ``docs: actualizar instrucciones de instalación``
fr: Suivez le format de commit conventionnel : - ``feat: add new Organm filtering capability`` - ``fix : resolve map rendering issue on mobile`` - ``docs : update installation instructions``
pt: Seguir o formato convencional do commit : - ``feat: adicionar novo recurso de filtragem do organismo - ``fix: resolver problema na renderização do mapa no celular`` - ``docs: atualizar instruções de instalação``

source: Code Review Process
es: Proceso de revisión de código
fr: Processus de revue de code
pt: Processo de Revisão do Código

source: All contributions go through code review: 1. Create a pull request with clear description 2. Automated tests must pass 3. Code review by maintainers 4. Address feedback and update as needed 5. Merge once approved
es: Todas las contribuciones pasan por revisión de código: 1. Crear un pull request con descripción clara 2. Las pruebas automatizadas deben pasar 3. Revisión de código por los mantenedores 4. Calificación de dirección y actualización según sea necesario 5. Combinar una vez aprobado
fr: Toutes les contributions passent par l'examen de code : 1. Créer une pull request avec une description claire 2. Les tests automatisés doivent passer 3. Revue de code par les responsables 4. Adressez les commentaires et mettez à jour au besoin 5. Fusionner une fois approuvée
pt: Todas as contribuições passam pela revisão de código: 1. Crie um pull request com uma descrição clara 2. Testes automatizados devem passar 3. Revisão do código pelos mantenedores 4. Feedback do endereço e atualização conforme necessário 5. Mesclar depois de aprovado

source: Specific Contribution Areas
es: Áreas de Contribución Específicas
fr: Zones de contribution spécifiques
pt: Áreas de Contribuição Específicas

source: Frontend Development
es: Desarrollo del Frontend
fr: Développement du frontend
pt: Desenvolvimento de Frontend

source: **Technologies:** React 18, Material-UI, Redux, Recharts
es: **Tecnologías:** React 18, Material-UI, Redux, Recharts
pt: **Tecnologias:** React 18, Material-UI, Redux, Recharts

source: **Key areas for contribution:** - New visualization components - Mobile responsiveness improvements - Accessibility enhancements - Performance optimizations
es: **Áreas clave de contribución:** - Nuevos componentes de visualización - Mejoras de respuesta móvil - Mejoras de accesibilidad - Optimizaciones de rendimiento
fr: **Domaines clés de contribution :** - Nouveaux composants de visualisation - Améliorations de la réactivité mobile - Améliorations de l'accessibilité - Optimisations des performances
pt: **Áreas-chave para contribuição:** - Novos componentes de visualização - Melhorias de resposta móvel - Melhorias de acessibilidade - Otimizações de desempenho

source: Backend Development
es: Desarrollo de backend
fr: Développement du backend
pt: Desenvolvimento de backend

source: **Key areas for contribution:** - API endpoint optimization - Database query improvements - Data validation and processing - Security enhancements
es: **Áreas clave para la contribución:** - Optimización de endpoints de la API - Mejoras en la consulta de la base de datos - Validación y procesamiento de datos - Mejoras de seguridad
fr: **Domaines clés de contribution :** - Optimisation des terminaux API - Améliorations des requêtes de la base de données - Validation et traitement des données - Améliorations de la sécurité
pt: **Áreas chave para contribuição:** - Otimização de ponto de extremidade de API - Melhorias de consulta de dados - Validação e processamento - Melhorias de segurança

source: Data Processing
es: Procesamiento de datos
fr: Traitement des données
pt: Processamento de dados

source: **Key areas for contribution:** - New organism data parsers - Data quality validation - Statistical analysis functions - Export format support
es: **Áreas clave para la contribución:** - Nuevo analizador de datos del organismo - Validación de calidad de datos - Funciones de análisis estático - Soporte en formato de exportación
fr: **Domaines clés de contribution :** - Nouveaux analyseurs de données pour l'organisme - Validation de la qualité des données - Fonctions d'analyse statistique - Support du format d'exportation
pt: **Áreas-chave para contribuição:** - Novos analisadores de dados de organismo - Validação da qualidade dos dados - Funções de análise estatística - Suporte ao formato de exportação

source: Documentation
es: Documentación
pt: Documentação
