Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/contributing.po
Languages: es, fr, pt

source: **Areas needing help:** - User guides and tutorials - API documentation - Developer onboarding - Multi-language translations
es: **Áreas que necesitan ayuda:** - Guías de usuario y tutoriales - Documentación API - Embarque del desarrollador - Traducciones múltiples
fr: **Zones nécessitant de l'aide:** - Guides d'utilisation et tutoriels - Documentation API - Intégration des développeurs - Traductions multilingues
pt: **Áreas precisam de ajuda:** - Guias do usuário e tutoriais - Documentação da API - Integração de desenvolvedores - Traduções de várias línguas

source: How to submit changes
es: Cómo enviar cambios
fr: Comment soumettre les modifications
pt: Como enviar as alterações

source: Open a `pull request <https://github.com/amrnet/amrnet/pulls>`__ to submit changes to this project.
es: Abre un `pull request <https://github.com/amrnet/amrnet/pulls>`__ para enviar cambios a este proyecto.
fr: Ouvrez une `pull request <https://github.com/amrnet/amrnet/pulls>`__ pour soumettre des modifications à ce projet.
pt: Abra o `pull request <https://github.com/amrnet/amrnet/pulls>`__ para enviar alterações a este projeto.

source: **Your pull request should:** - Include a clear description of changes - Pass all automated tests - Include relevant tests for new functionality - Update documentation if needed - Follow the project's coding standards
es: **Tu pull request debería:** - Incluye una descripción clara de los cambios - Pasar todas las pruebas automatizadas - Incluye pruebas relevantes para una nueva funcionalidad - Actualizar documentación si es necesario - Sigue los estándares de codificación del proyecto
fr: **Votre pull request devrait :** - Inclure une description claire des changements - Passer tous les tests automatisés - Inclure les tests pertinents pour les nouvelles fonctionnalités - Mettre à jour la documentation si nécessaire - Suivre les normes de codage du projet
pt: **Seu pull request deve: ** - Inclua uma descrição clara das alterações - Passe todos os testes automatizados - Inclua testes relevantes para a nova funcionalidade - Atualize a documentação, se necessário - Siga os padrões de codificação do projeto

source: **Pull request template includes:** - Description of changes - Type of change (bugfix, feature, docs, etc.) - Testing checklist - Screenshots for UI changes
es: **La plantilla de Pull request incluye:** - Descripción de los cambios - Tipo de cambio (corrección de errores, características, documentos, etc.) - Lista de verificación de pruebas - Capturas de pantalla para cambios en la interfaz
fr: **Le modèle de demande d'ajout comprend :** - Description des changements - Type de changement (correction de bugs, fonctionnalité, docs, etc.) - Liste de contrôle de test - Captures d'écran pour les modifications de l'interface utilisateur
pt: **Modelo de pull request inclui:** - Descrição das alterações - tipo de mudança (bugfix, feature, docs, etc.) - Testing checklist - Screenshots para alterações da UI

source: Community Guidelines
es: Directrices de la comunidad
fr: Directives de la communauté
pt: Diretrizes da Comunidade

source: Be respectful and inclusive
es: Ser respetuoso e inclusivo
fr: Soyez respectueux et inclusif
pt: Seja respeitoso e inclusivo

source: Provide constructive feedback
es: Proporcionar comentarios constructivos
fr: Fournir un feedback constructif
pt: Fornecer feedback construtivo

source: Focus on the scientific and public health mission
es: Concéntrese en la misión de salud pública y científica
fr: Concentrez-vous sur la mission de santé publique et scientifique
pt: Foco na missão de saúde científica e pública

source: Help newcomers get started
es: Ayuda a los recién llegados a empezar
fr: Aidez les nouveaux arrivants à commencer
pt: Ajude os novatos a começarem

source: Follow our :doc:`Code of Conduct <codeofconduct>`
es: Sigue nuestro :doc:`Código de Conducta <codeofconduct>`
pt: Siga nosso :doc:`Código de Conduta <codeofconduct>`

source: Getting Help
es: Obteniendo ayuda
fr: Obtenir de l'aide
pt: Obtendo ajuda

source: **Need assistance?** - Check existing `Issues <https://github.com/amrnet/amrnet/issues>`__ - Join our `Discussions <https://github.com/amrnet/amrnet/discussions>`__ - Review the :doc:`Installation Guide <installation>` - Read the `Developer Guide <../tutorial/developer_guide.md>`__
es: **¿Necesitas ayuda? * - Comprueba `Issues <https://github.com/amrnet/amrnet/issues>`__ - Únete a nuestros `Discusiones <https://github.com/amrnet/amrnet/discussions>`__ - Revisa la :doc:`Installation Guide <installation>` - Lee la `Developer Guide <. /tutorial/developer_guide.md>`__
fr: **Besoin d'aide ? * - Vérifiez les `Issues <https://github.com/amrnet/amrnet/issues>`__ existants - Rejoignez nos `Discussions <https://github.com/amrnet/amrnet/discussions>`__ - Consultez le `Guide d'installation :doc: <installation>` - Lisez le `Guide du Développeur <. /tutorial/developer_guide.md>`__
pt: **Precisa de ajuda? * - Verifique os `Issues <https://github.com/amrnet/amrnet/issues>`__ - Junte-se a nosso `Discussions <https://github.com/amrnet/amrnet/discussions>`__ - Revise o `Installation Guide <installation>da :doc:` - Leia o `Developer Guide <. /tutorial/developer_guide.md>`__

source: **For urgent issues:** - Security vulnerabilities: See our Security Policy - Critical bugs: Use the Issue Tracker with "urgent" label
es: **Para problemas urgentes:** - vulnerabilidades de seguridad: vea nuestra Política de Seguridad - Fallos críticos: Use el rastreador de incidencias con etiqueta "urgente"
fr: **Pour des problèmes urgents :** - vulnérabilités de sécurité : Voir notre politique de sécurité - bogues critiques : utilisez le système de suivi de problèmes avec l'étiquette « urgente »
pt: **Para problemas urgentes:** - vulnerabilidades de segurança: Veja nossa Política de Segurança - bugs críticos: use o Rastreador de Problemas com o rótulo "urgente"
