Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/data.po
Languages: es, fr

source: Data access
es: Acceso a datos
fr: Accès aux données

source: The full sample-level data for each organism can be downloaded from the AMRnet dashboard itself, using the ‘Download database (CSV) format’ button at the bottom of the page. In addition, you can access AMRnet data via the API described below.
es: Los datos completos a nivel de muestra de cada organismo se pueden descargar desde el propio panel de control de AMRnet usando el botón "Descargar formato de base de datos" en la parte inferior de la página. Además, puede acceder a los datos de AMRnet a través de la API descrita a continuación.
fr: Les données de niveau d'échantillonnage complet pour chaque organisme peuvent être téléchargées depuis le tableau de bord AMRnet lui-même, en utilisant le bouton « Télécharger la base de données (CSV) en bas de la page. De plus, vous pouvez accéder aux données AMRnet via l'API décrite ci-dessous.

source: **Architectures**: The API architectures have 2 options developed for the project which include:
es: **Archivos**: Las arquitecturas API tienen 2 opciones desarrolladas para el proyecto que incluyen:
fr: **Architectures** : Les architectures de l'API ont 2 options développées pour le projet qui incluent :

source: 1. Download data via bucket
es: 1. Descargar datos a través del cubo
fr: 1. Télécharger les données via un seau

source: **Organism name for downloading files from AWS:** Escherichia coli (diarrheagenic) as ``amrnetdb-Escherichia_coli_ diarrheagenic``; Escherichia coli as ``amrnetdb-Escherichia_coli``; Klebsiella pneumoniae as ``amrnetdb-Klebsiella_pneumoniae``; Neisseria gonorrhoeae as ``amrnetdb-Neisseria_gonorrhoeae``; Salmonella (invasive non-typhoidal) as ``amrnetdb-Salmonella_enterica_invasive_nontyphoidal``; Salmonella (non-typhoidal) as ``amrnetdb-Salmonella_enterica_nontyphoidal``; Shigella as ``amrnetdb-Shigella_EIEC``; Salmonella Typhi as ``amrnetdb-Salmonella_Typhi``
es: **Nombre del organismo para descargar archivos de AWS:** Escherichia coli (diarrheagenic) como ``amrnetdb-Escherichia_coli_ diarrheagenic``; Escherichia coli como ``amrnetdb-Escherichia_coli``; Klebsiella pneumoniae como ``amrnetdb-Klebsiella_pneumoniae``; Neisseria gonorrhoeae como ``amrnetdb-Neisseria_gonorrhoeae``; Salmonella (invasiva non-typhoidal) como ``amrnetdb-Salmonella_enterica_invasive_nontyphoidal``; Salmonella (non-typhoidal) como ``amrnetdb-Salmonella_enterica_nontyphoidal``; Shigella como ``amrnetdb-Shigella_EIEC``; Salmonella Typhi como ``amrnetdb-Salmonella_Typhi``
fr: **Nom de l'organisme pour télécharger des fichiers depuis AWS :** Escherichia coli (diarrheagenic) en tant que ``amrnetdb-Escherichia_coli_ diarrheagenic``; Escherichia coli en tant que ``amrnetdb-Escherichia_coli``; Klebsiella pneumoniae en tant que ``amrnetdb-Klebsiella_pneumoniae``; Neisseria gonorrhoeae en tant que ``amrnetdb-Neisseria_gonorrhoeae``; Salmonella (invasive non-typhoidal) en tant que ``amrnetdb-Salmonella_enterica_invasive_nontyphoidal``; Salmonella (non-typhoidal) en tant que ``amrnetdb-Salmonella_enterica_nontyphoidal``; Shigella en tant que ``amrnetdb-Shigella_EIEC``; Salmonella Typhi en ``amrnetdb-Salmonella_Typhi``

source: a. Data accessing using Browser
es: a. Datos de acceso usando el navegador
fr: a. Données accédant à l'aide du navigateur

source: i. Viewing Available Files
es: i. Ver archivos disponibles
fr: i. Visualisation des fichiers disponibles

source: Step 1: Open a web browser (Chrome, Firefox, Safari, etc.).
es: Paso 1: Abra un navegador web (Chrome, Firefox, Safari, etc.).
fr: Étape 1 : Ouvrez un navigateur web (Chrome, Firefox, Safari, etc.).

source: Step 2: Navigate to the root bucket URL by clicking `https://amrnet.s3.amazonaws.com/ <https://amrnet.s3.amazonaws.com/>`_.
es: Paso 2: Navegue a la URL raíz del cubo haciendo clic en `https://amrnet.► s.com/ <https://amrnet.s3.amazonaws.com/>`_.
fr: Étape 2: Naviguez vers l'URL du bucket racine en cliquant sur `https://amrnet.<unk> <unk> s.com/ <https://amrnet.s3.amazonaws.com/>`_.

source: Step 3: This URL leads to an XML text representation listing all the files available in the Amazon S3 bucket. The XML format will display information about each file, such as its key (name), last modified date, size, etc.
es: Paso 3: Esta URL lleva a una representación de texto XML que muestra todos los archivos disponibles en el cubo Amazon S3. El formato XML mostrará información sobre cada archivo, como su clave (nombre), fecha de última modificación, tamaño, etc.
fr: Étape 3: Cette URL mène à une représentation de texte XML listant tous les fichiers disponibles dans le compartiment Amazon S3. Le format XML affichera des informations sur chaque fichier, comme sa clé (nom), sa date de dernière modification, sa taille, etc.

source: ii. Searching for a Specific Organism
es: ii. Buscando un organismo específico
fr: ii. Recherche d'un organisme spécifique

source: Step 1: Use the search functionality of your browser (Ctrl-F on Windows/Linux or Cmd-F on Mac).
es: Paso 1: Utilice la funcionalidad de búsqueda de su navegador (Ctrl-F en Windows/Linux o Cmd-F en Mac).
fr: Étape 1 : Utilisez la fonction de recherche de votre navigateur (Ctrl-F sous Windows/Linux ou Cmd-F sur Mac).

source: Step 2: Type the name of file based on the organism you are looking for in the search box. This will highlight all occurrences of the organism's name in the XML text, making it easier to locate the specific file associated with that organism.
es: Paso 2: Escriba el nombre del archivo basado en el organismo que está buscando en el cuadro de búsqueda. Esto resaltará todas las ocurrencias del nombre del organismo en el texto XML, haciendo más fácil localizar el archivo específico asociado con ese organismo.
fr: Étape 2 : Tapez le nom du fichier en fonction de l'organisme que vous recherchez dans la zone de recherche. Ceci mettra en évidence toutes les occurrences du nom de l'organisme dans le texte XML, ce qui facilitera la localisation du fichier spécifique associé à cet organisme.

source: iii. Downloading a File
es: iii. Descargando un archivo
fr: iii. Téléchargement d'un fichier

source: Step 1: Once you find the ``<Key>`` field that contains the file name you are interested in, note down the file name.
es: Paso 1: Una vez que encuentre el campo ``<Key>`` que contiene el nombre del archivo en el que está interesado, tenga en cuenta el nombre del archivo.
fr: Étape 1 : Une fois que vous avez trouvé le champ ``<Key>`` qui contient le nom du fichier qui vous intéresse, notez le nom du fichier.

source: Step 2: Open a new tab in your browser.
es: Paso 2: Abra una nueva pestaña en su navegador.
fr: Étape 2 : Ouvrez un nouvel onglet dans votre navigateur.

source: Step 3: Copy the root bucket URL ``https://amrnet.s3.amazonaws.com`` into the new tab's address bar.
es: Paso 3: Copie la URL raíz del bucket ``https://amrnet..Us.com`` en la nueva barra de direcciones de la pestaña.
fr: Étape 3: Copiez l'URL du bucket racine ``https://amrnet.<unk> <unk> s.com`` dans la barre d'adresse du nouvel onglet.

source: Step 4: Append a slash ``/`` to the end of the URL, followed by the contents of the ``<Key>`` field (file name).
es: Paso 4: Agregar una barra ``/`` al final de la URL, seguido por el contenido del campo ``<Key>`` (nombre de archivo).
fr: Étape 4 : Ajoute un slash ``/`` à la fin de l'URL, suivi du contenu du champ ``<Key>`` (nom du fichier).

source: Step 5: Press Enter, and your browser should automatically start downloading the file. This method has been tested to work in Chrome, Firefox, and Safari.
es: Paso 5: Presione Intro, y su navegador debería iniciar automáticamente la descarga del archivo. Este método ha sido probado para funcionar en Chrome, Firefox y Safari.
fr: Étape 5 : Appuyez sur Entrée et votre navigateur devrait démarrer automatiquement le téléchargement du fichier. Cette méthode a été testée pour fonctionner dans Chrome, Firefox et Safari.

source: **OR**
es: **O**
fr: **OU**

source: Copy the URL below and modify the organism name added at the end **amrnet-** ``amrnetdb-Escherichia_coli_ diarrheagenic`` **.csv.gz** based on organism list given above.
es: Copia la siguiente URL y modifica el nombre del organismo agregado al final **amrnet-** ``amrnetdb-Escherichia_coli_ diarrheagenic`` **.csv.gz** basado en la lista de organismos dada arriba.
fr: Copiez l'URL ci-dessous et modifiez le nom de l'organisme ajouté à la fin **amrnet-** ``amrnetdb-Escherichia_coli_ diarrheagenic`` **.csv.gz** basé sur la liste d'organismes donnée ci-dessus.

source: Example:
es: Ejemplo:
fr: Exemple:

source: b. Data accessing using Command line
es: b. Acceso a datos usando línea de comandos
fr: b. Données accédant à l'aide de la ligne de commande

source: Step 1: Open your terminal.
es: Paso 1: Abra su terminal.
fr: Étape 1 : Ouvrez votre terminal.

source: Step 2: Use the following command to download data from the provided URL:
es: Paso 2: Utilice el siguiente comando para descargar datos de la URL proporcionada:
fr: Étape 2 : Utilisez la commande suivante pour télécharger les données à partir de l'URL fournie :

source: Similarly, if you need to download a specific file from the URL, you would specify the file name in the URL. For example:
es: Del mismo modo, si necesita descargar un archivo específico desde la URL, especificaría el nombre del archivo en la URL. Por ejemplo:
fr: De même, si vous devez télécharger un fichier spécifique à partir de l'URL, vous devez spécifier le nom du fichier dans l'URL. Par exemple :

source: c. Data accessing using Using S3cmd tool
es: c. Acceso de datos usando la herramienta S3cmd
fr: c. Accès aux données à l'aide de l'outil S3cmd

source: The `s3cmd <https://s3tools.org/s3cmd>`_ tool is a versatile and powerful command-line utility designed to interact with Amazon S3 (Simple Storage Service). It simplifies tasks such as browsing, downloading, and syncing files from S3 buckets. This tool is particularly useful for managing large datasets and automating workflows involving S3 storage.
es: La herramienta `s3cmd <https://s3tools.org/s3cmd>`_ es una potente y versátil utilidad de línea de comandos diseñada para interactuar con Amazon S3 (Simple Storage Service). Simplifica tareas tales como navegación, descarga y sincronización de archivos de cubos S3. Esta herramienta es especialmente útil para gestionar grandes conjuntos de datos y automatizar flujos de trabajo que implican el almacenamiento S3.
fr: L'outil `s3cmd <https://s3tools.org/s3cmd>`_ est un utilitaire en ligne de commande polyvalent et puissant conçu pour interagir avec Amazon S3 (Simple Storage Service). Il simplifie les tâches telles que la navigation, le téléchargement et la synchronisation des fichiers à partir des compartiments S3. Cet outil est particulièrement utile pour gérer les grands ensembles de données et automatiser les flux de travail impliquant le stockage S3.

source: 2. Download data via API
es: 2. Descargar datos a través de API
fr: 2. Télécharger les données via l'API

source: Send an email to amrnetdashboard@gmail.com requesting an API token.
es: Enviar un correo electrónico a amrnetdashboard@gmail.com solicitando un token de API.
fr: Envoyez un email à amrnetdashboard@gmail.com pour demander un jeton d'API.

source: You will receive email from us with all the necessary details. like: **API_TOKEN_KEY, collection, database, dataSource**.
es: Recibirá un correo electrónico con todos los detalles necesarios, como: **API_TOKEN_KEY, colección, base de datos, fuente de datos**.
fr: Vous recevrez un e-mail de notre part avec tous les détails nécessaires. Comme : **API_TOKEN_KEY, collection, base de données, dataSource**.

source: Once you receive these details use the method below to download required data.
es: Una vez que reciba estos detalles utilice el método de abajo para descargar los datos requeridos.
fr: Une fois que vous recevez ces détails, utilisez la méthode ci-dessous pour télécharger les données requises.

source: To download data with specific Country and Date add a **filter**.
es: Para descargar datos con fecha y país específicos, añada un **filtro**.
fr: Pour télécharger des données avec un pays et une date spécifiques, ajoutez un **filtre**.

source: Example code to download all the data for an organism:
es: Código de ejemplo para descargar todos los datos de un organismo:
fr: Exemple de code pour télécharger toutes les données pour un organisme:

source: Example code to download the data with filters **Date** and **Country** for an organism:
es: Código de ejemplo para descargar los datos con filtros **Fecha** y **País** para un organismo:
fr: Exemple de code pour télécharger les données avec les filtres **Date** et **Pays** pour un organisme :

source: Example code to download the data with only one filter e.g. **Date** for an organism:
es: Código de ejemplo para descargar los datos con un solo filtro. ej. **Fecha** para un organismo:
fr: Exemple de code pour télécharger les données avec un seul filtre, par exemple **Date** pour un organisme:

source: Example code to download the data and save in JSON:
es: Código de ejemplo para descargar los datos y guardar en JSON:
fr: Exemple de code pour télécharger les données et les enregistrer en JSON :

source: To test your cURL requests, you can use the online tool `Run Curl Commands Online <https://reqbin.com/curl>`_. This tool provides a convenient way to execute and test your cURL commands directly in your web browser without needing to install any additional software.
es: Para probar sus solicitudes cURL, puede utilizar la herramienta online `Ejecutar comandos en línea <https://reqbin.com/curl>`_. Esta herramienta proporciona una manera conveniente de ejecutar y probar los comandos cURL directamente en su navegador web sin necesidad de instalar ningún software adicional.
fr: Pour tester vos requêtes cURL, vous pouvez utiliser l'outil en ligne `Run Curl Commands Online <https://reqbin.com/curl>`_. Cet outil fournit un moyen pratique d'exécuter et de tester vos commandes cURL directement dans votre navigateur Web sans avoir à installer de logiciel supplémentaire.

source: a. Command line
es: a. Línea de comandos
fr: a. Ligne de commande

source: To download data using our API, please follow the given steps:
es: Para descargar datos usando nuestra API, por favor siga los siguientes pasos:
fr: Pour télécharger des données en utilisant notre API, veuillez suivre les étapes suivantes :

source: Once you have API token, Replace ``<API_TOKEN_KEY>`` in the following command with the actual API token you received.
es: Una vez que tengas el token API, Reemplaza ``<API_TOKEN_KEY>`` en el siguiente comando con el token de API real que recibiste.
fr: Une fois que vous avez un jeton d'API, remplacez ``<API_TOKEN_KEY>`` dans la commande suivante par le jeton d'API que vous avez reçu.

source: Determine the specific database and collection you need data from.
es: Determine la base de datos específica de la que necesita datos.
fr: Déterminez la base de données spécifique et la collection dont vous avez besoin de données.

source: Open your command line interface (CLI) or terminal and execute the following **curl** command to download data.
es: Abre tu interfaz de línea de comandos (CLI) o terminal y ejecuta el siguiente comando **curl** para descargar datos.
fr: Ouvrez votre interface en ligne de commande (CLI) ou votre terminal et exécutez la commande **curl** suivante pour télécharger des données.

source: If you want to save the response data to a file, you can use the -o option with curl. This command will save the response data to a file named data.json in the current directory.
es: Si desea guardar los datos de respuesta en un archivo, puede utilizar la opción -o con curl. Este comando guardará los datos de respuesta en un archivo llamado data.json en el directorio actual.
fr: Si vous voulez enregistrer les données de réponse dans un fichier, vous pouvez utiliser l'option -o avec curl. Cette commande va enregistrer les données de réponse dans un fichier nommé data.json dans le répertoire courant.

source: b. Platform
es: b. Plataforma
fr: b. Plateforme

source: Users have the flexibility to access the API through their preferred platform. As an illustration, we provide guidance on utilizing the Postman tool to access data via the API.
es: Los usuarios tienen la flexibilidad de acceder a la API a través de su plataforma preferida. Como ilustración, proporcionamos orientación sobre el uso de la herramienta Postman para acceder a los datos a través de la API.
fr: Les utilisateurs ont la flexibilité d'accéder à l'API par le biais de leur plate-forme préférée. À titre d'illustration, nous fournissons des conseils sur l'utilisation de l'outil Postman pour accéder aux données via l'API.

source: Steps to Import the Example ``cURL`` Command using Postman
es: Pasos para importar el comando de ejemplo ``cURL`` usando Postman
fr: Étapes pour importer l’exemple de commande ``cURL`` en utilisant Postman

source: Open `Postman <https://www.postman.com/>`_.
es: Abre `Postman <https://www.postman.com/>`_.
fr: Ouvrez `Postman <https://www.postman.com/>`_.

source: Sign In with your credentials and "discover what a postman can do"
es: Inicia sesión con tus credenciales y "descubre lo que un cartero puede hacer"
fr: Connectez-vous avec vos identifiants et "découvrez ce qu'un postman peut faire"

source: Login
es: Ingresar
fr: Se connecter

source: **Click the "Import" button.**
es: **Haz clic en el botón "Importar".**
fr: **Cliquez sur le bouton "Importer".**

source: Import
es: Importar
fr: Importation

source: **Paste the cURL command in Import:**
es: **Pega el comando cURL en la importación:**
fr: **Coller la commande cURL dans Importation :**

source: Review the imported request details and add ``<API_TOKEN_KEY>`` in ``Headers`` in Postman.
es: Revisa los detalles de la solicitud importada y añade ``<API_TOKEN_KEY>`` en ``Headers`` en Postman.
fr: Revoyez les détails de la requête importée et ajoutez ``<API_TOKEN_KEY>`` dans ``Headers`` dans Postman.

source: token
fr: jeton

source: Replace database name and collection name based on data to download
es: Reemplazar el nombre de la base de datos y el nombre de la colección basado en datos a descargar
fr: Remplacer le nom de la base de données et le nom de la collection en fonction des données à télécharger

source: Add filters to get specific data in ``filter``
es: Añade filtros para obtener datos específicos en ``filter``
fr: Ajouter des filtres pour obtenir des données spécifiques dans ``filter``

source: filter
es: filtro
fr: Filtre

source: **Click "Send" to execute the request and view the response.**
es: **Haz clic en "Enviar" para ejecutar la solicitud y ver la respuesta.**
fr: **Cliquez sur "Envoyer" pour exécuter la requête et afficher la réponse.**

source: send
es: enviar
fr: envoyer

source: **Save the response in file**
es: **Guardar la respuesta en el archivo**
fr: **Enregistrer la réponse dans le fichier**

source: save
es: ahorra
fr: économiser
