Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/decoli.po
Languages: es, fr, pt

source: *Escherichia coli* diarrheagenic
es: Diarreagénico *Escherichia coli*
fr: *Escherichia coli* diarrhéagène
pt: Diarreia de *équica* diarreia

source: Enterobase classifies *E. coli* genomes to pathotypes using `this logic <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`__. Pathotypes included in the *E. coli* (diarrheagenic) dashboard are:
es: Enterobase clasifica los genomas *E. coli* a los patotipos usando `este lógico <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`__. Los patotipos incluidos en el panel *E. coli* (diarrheagenic) son:
fr: L'entérose classe les génomes *E. coli* pour les pathotypes en utilisant `cette logique <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`__. Les pathotypes inclus dans le tableau de bord *E. coli* (diarrheagenic) sont:
pt: Enterobase classifica os gêneros *E. coli* aos pathotypes usando `esta lógica <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`__. Pathotypes incluídos no painel *E. coli* (diarreia) são:

source: Shiga toxin-producing *E. coli* (STEC)
es: Producción de toxinas de Shiga *E. coli* (STEC)
fr: Production de toxines de Shiga *E. coli* (STEC)
pt: *E. coli* (STEC) da toxina Shiga

source: Enterohemorrhagic *E. coli* (EHEC)
es: Enterohemorrágico *E. coli* (EHEC)
fr: Entréohémorragie *E. coli* (EHEC)
pt: Enterohemorrágico *E. coli* (EHEC)

source: Enterotoxigenic *E. coli* (ETEC)
es: Enterotoxigénico *E. coli* (ETEC)
fr: Entréotoxigène *E. coli* (ETEC)
pt: Enterotoxínica *E. coli* (ETEC)

source: Enteropathogenic *E. coli* (EPEC)
es: Enteropathogénica *E. coli* (EPEC)
fr: *E. coli* (EPEC) entérogène

source: Enteroinvasive *E. coli* (EIEC)
es: Enteroinvasivo *E. coli* (EIEC)
fr: Entréoinvasive *E. coli* (EIEC)

source: Last update: 5 August 2025.
es: Última actualización: 5 de agosto de 2025.
fr: Dernière mise à jour : 5 août 2025.
pt: Última atualização: 5 de Agosto de 2025.

source: The *E. coli* data used in AMRnet are not yet curated for purpose-of-sampling, and therefore reflect the biases of global sequencing efforts which may be skewed towards sequencing AMR strains and/or outbreaks. Data curation efforts are ongoing however until then, please be careful when interpreting the data in the dashboard.
es: La *E. los datos coli* utilizados en AMRnet no están aún curados para el propósito de muestreo, y por lo tanto reflejan los sesgos de los esfuerzos de secuenciación global que pueden ser sesgados hacia la secuenciación de cepas de AMR y/o brotes. Los esfuerzos de curación de datos están en curso sin embargo hasta entonces, por favor tenga cuidado al interpretar los datos en el panel.
fr: Le *E. les données coli* utilisées dans AMRnet ne sont pas encore conservées à des fins d'échantillonnage, et donc reflètent les préjugés des efforts de séquençage global qui peuvent être orientés vers le séquençage des souches et/ou des épidémies. Les efforts de conservation des données sont cependant en cours jusqu'à ce moment-là, soyez prudent lorsque vous interprétez les données dans le tableau de bord.
pt: O *E. coli* dados usados na AMRnet ainda não são curados para efeitos de amostragem, e, portanto, refletem as preconceitos dos esforços globais de sequenciamento que podem ser orientados para a sequenciação de tensões e/ou surtos de RAM. No entanto, os esforços de curadoria de dados estão em curso até lá, por favor, tenha cuidado ao interpretar os dados no painel.

source: Variable definitions
es: Definiciones variables
fr: Définitions de variables
pt: Definições de variáveis

source: **Lineages**: Lineages are labeled by the pathovar followed by the (7-locus) ST.
es: **Lineamientos**: Los linajes son etiquetados por el pathovar seguido por el (7-locus) ST.
fr: **Lineages** : Les lignes sont étiquetées par l'agent pathovar suivi de la ST. (7-locus).
pt: **Linhas**: as Linhas são rotuladas pelo pathovar seguido pelo ST(7-locus).

source: **AMR determinants**: `Enterobase <https://enterobase.warwick.ac.uk/>`_ identifies AMR determinants using NCBI’s `AMRFinderPlus <https://www.ncbi.nlm.nih.gov/pathogens/antimicrobial-resistance/AMRFinder/>`_. AMRnet imports these AMR genotype calls, and assigns them to drugs/classes in the dashboard using the Subclass curated in `refgenes <https://doi.org/10.1099/mgen.0.000832>`_, see :ref:`the table <amr-definition-table>`.
es: **determinantes AMR**: `Enterobase <https://enterobase.warwick.ac.uk/>`_ identifica los determinantes de AMR usando `AMRFinderPlus <https://www.ncbi.nlm.nih.gov/pathogens/antimicrobial-resistance/AMRFinder/>`_. AMRnet importa estas llamadas genotípicas de AMR, y las asigna a drogas/clases en el panel de control usando la Subclase curada en `refgenes <https://doi.org/10.1099/mgen.0.000832>`_, see :ref:`la tabla <amr-definition-table>`.
fr: **déterminants AMR**: `Enterobase <https://enterobase.warwick.ac.uk/>`_ identifie les déterminants AMR en utilisant `AMRFinderPlus <https://www.ncbi.nlm.nih.gov/pathogens/antimicrobial-resistance/AMRFinder/>`_. AMRnet importe ces appels de génotype AMR, et les assigne à des drogues/classes dans le tableau de bord en utilisant la sous-classe organisée dans `refgenes <https://doi.org/10.1099/mgen.0.000832>`_, voir :ref:`la table <amr-definition-table>`.
pt: **AMR determinantes**: `Enterobase <https://enterobase.warwick.ac.uk/>`_ identifica determinantes da AMR usando o `AMRFinderPlus <https://www.ncbi.nlm.nih.gov/pathogens/antimicrobial-resistance/AMRFinder/>do NCBI do NCBI. A AMRnet importa estas chamadas genótipos AMR e as atribui a drogas / classes no painel usando a Subclasse curada em `refgenes <https://doi.org/10.1099/mgen.0.000832>`_, veja :ref:`a tabela <amr-definition-table>`.
