Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/deployment.po
Languages: es, fr, pt

source: Deployment Guide
es: Guía de despliegue
fr: Guide de déploiement
pt: Guia de implantação

source: This guide covers deployment strategies for AMRnet, including local development, staging environments, and production deployment on various platforms.
es: Esta guía cubre estrategias de despliegue para AMRnet, incluyendo desarrollo local, entornos de puesta en escena y despliegue de producción en varias plataformas.
fr: Ce guide couvre les stratégies de déploiement pour AMRnet, y compris le développement local, les environnements de mise en scène et le déploiement de production sur diverses plateformes.
pt: Este guia abrange estratégias de implantação para AMRnet, incluindo desenvolvimento local, ambientes de preparo e implantação de produção em várias plataformas.

source: Environment Setup
es: Configuración de entorno
fr: Configuration de l'environnement
pt: Configurações do Ambiente

source: AMRnet supports multiple deployment environments with different configurations:
es: AMRnet soporta múltiples entornos de despliegue con diferentes configuraciones:
fr: AMRnet prend en charge plusieurs environnements de déploiement avec différentes configurations :
pt: AMRnet suporta vários ambientes de implantação com configurações diferentes:

source: Development Environment
es: Entorno de Desarrollo
fr: Environnement de développement
pt: Ambiente de Desenvolvimento

source: For local development with hot reloading and debugging:
es: Para desarrollo local con recarga caliente y depuración:
fr: Pour le développement local avec rechargement chaud et débogage:
pt: Para desenvolvimento local com hot reloading e depuração:

source: **Environment Variables (.env):**
es: **Variables de entorno (.env):**
fr: **Variables d'environnement (.env):**
pt: **Variáveis de ambiente (.env):**

source: **Start Development Servers:**
es: **Iniciar Servidores de Desarrollo:**
fr: **Lancer les serveurs de développement :**
pt: **Iniciar Servidores de Desenvolvimento:**

source: Staging Environment
es: Entorno de Staging
fr: Environnement de pré-production
pt: Ambiente de Staging

source: For testing production builds locally:
es: Para pruebas de construcción de producción localmente:
fr: Pour tester les versions de production localement :
pt: Para testar as compilações de produção localmente:

source: Production Deployment
es: Despliegue de producción
fr: Déploiement de production
pt: Implantação de produção

source: Heroku Deployment
es: Despliegue de Heroku
fr: Déploiement de Heroku
pt: Implantação de Heroku

source: AMRnet is optimized for Heroku deployment with automatic build processes:
es: AMRnet está optimizado para la implementación de Heroku con procesos de construcción automáticos:
fr: AMRnet est optimisé pour le déploiement de Heroku avec des processus de compilation automatiques:
pt: AMRnet é otimizado para deploy de Heroku com processos de compilação automáticos:

source: **2. Environment Configuration:**
es: **2. Configuración del entorno:**
fr: **2. Configuration de l'environnement:**
pt: **2. Configuração de ambiente:**

source: **3. Deployment:**
es: **3. Desplegamiento:**
fr: **3. Déploiement :**
pt: **3. Implementação:**

source: **Heroku Configuration Files:**
es: **Archivos de configuración de Heroku:**
fr: **Fichiers de configuration Heroku :**
pt: **Arquivos de configuração do Heroku:**

source: **Procfile:**
es: **Perfil:**
fr: **Profil:**
pt: **Perfil:**

source: MongoDB Atlas Configuration
es: Configuración del Atlas de MongoDB
fr: Configuration de l'Atlas MongoDB
pt: Configuração do Atlas MongoDB

source: For production database deployment:
es: Para despliegue de base de datos de producción:
fr: Pour le déploiement de la base de données de production :
pt: Para a implantação do banco de dados:

source: Create MongoDB Atlas account
es: Crear cuenta de MongoDB Atlas
fr: Créer un compte MongoDB Atlas
pt: Criar conta no MongoDB Atlas

source: Create new cluster (M0 free tier for testing)
es: Crear un nuevo clúster (nivel gratuito M0 para la prueba)
fr: Créer une nouvelle grappe de serveurs (M0 niveau gratuit pour les tests)
pt: Criar novo cluster (M0 tier livre para teste)

source: Configure network access (whitelist your IPs)
es: Configurar acceso a la red (lista blanca de sus IPs)
fr: Configurer l'accès au réseau (liste blanche de vos IPs)
pt: Configurar acesso à rede (whitelist seus IPs)

source: Create database user with read/write permissions
es: Crear usuario de base de datos con permisos de lectura/escritura
fr: Créer un utilisateur de la base de données avec les permissions en lecture/écriture
pt: Criar usuário do banco de dados com permissões de leitura/escrita

source: **2. Connection Configuration:**
es: **2. Configuración de la conexión:**
fr: **2. Configuration de la connexion :**
pt: **2. Configuração de Conexão:**

source: **3. Production Optimizations:**
es: **3. Optimizaciones de producción:**
fr: **3. Optimisations de production :**
pt: **3. Otimização de produção:**

source: Docker Deployment
es: Despliegue de Docker
fr: Déploiement Docker
pt: Implantação do Docker

source: For containerized deployment:
es: Para el despliegue contenedor:
fr: Pour le déploiement conteneurisé :
pt: Para implantação containerizada:

source: **Dockerfile:**
es: **Archivo Docker:**
fr: **Fichier Docker:**

source: **Deployment Commands:**
es: **Comandos de despliegue:**
fr: **Commandes de déploiement :**
pt: **Comandos de implantação:**

source: AWS Deployment
es: Despliegue AWS
fr: Déploiement AWS
pt: Implantação AWS

source: For AWS deployment using Elastic Beanstalk:
es: Para el despliegue de AWS usando Elastic Beanstalk:
fr: Pour le déploiement AWS en utilisant Elastic Beanstalk :
pt: Para implantação AWS usando Elastic Beanstalk:

source: **1. EB CLI Setup:**
es: **1. Configuración de EB CLI:**
fr: **1. Configuration CLI EB :**
pt: **1. Configuração do CLI EB:**

source: **2. Configuration Files:**
es: **2. Archivos de configuración:**
fr: **2. Fichiers de configuration:**
pt: **2. Arquivos de configuração:**

source: **3. Deploy:**
es: **3. Desplegar:**
fr: **3. Déploiement :**
pt: **3. Implantar:**

source: Performance Optimization
es: Optimización de rendimiento
fr: Optimisation des performances
pt: Otimização de desempenho

source: Production deployment optimizations for better performance:
es: Optimizaciones de despliegue de producción para un mejor rendimiento:
fr: Optimisations de déploiement de production pour de meilleures performances:
pt: Otimizações de implantação de produção para melhor desempenho:

source: Build Optimizations
es: Crear Optimizaciones
fr: Construire des optimisations
pt: Otimizações de compilação

source: **Client Build Configuration:**
es: **Configuración de la compilación del cliente:**
fr: **Configuration de la compilation du client :**
pt: **Configuração de construção do cliente:**

source: Server Optimizations
es: Optimizaciones de servidor
fr: Optimisations du serveur
pt: Otimizações do Servidor

source: **Express.js Production Configuration:**
es: **Configuración de Producción de Express.js:**
fr: **Configuration de production Express.js :**
pt: **Configuração de Produção do Express.js:**

source: Database Optimizations
es: Optimizaciones de base de datos
fr: Optimisations de la base de données
pt: Otimizações do Banco de Dados

source: **MongoDB Production Indexes:**
es: **Índice de Producción de MongoDB:**
fr: **Index de production MongoDB :**
pt: **Índices de produção do MongoDB:**

source: Monitoring and Logging
es: Monitoreo y Registro
fr: Surveillance et journalisation
pt: Monitoramento e registro

source: Production monitoring setup for performance and error tracking:
es: Configuración de monitorización de producción para el rendimiento y seguimiento de errores:
fr: Configuration de la surveillance de production pour les performances et le suivi des erreurs :
pt: Configuração de monitoramento de produção para rastreamento de desempenho e erro de rastreamento:

source: Application Monitoring
es: Monitoreo de aplicaciones
fr: Surveillance de l'application
pt: Monitoramento de Aplicações

source: **Winston Logging Configuration:**
es: **Configuración de registro de Winston:**
pt: **Configuração do Winston Logging:**

source: **Performance Monitoring Middleware:**
es: **Middleware de Monitoreo de Rendimiento:**
fr: **Middleware de surveillance des performances :**

source: Error Tracking
es: Seguimiento de errores
fr: Suivi des erreurs
pt: Rastreamento de erros

source: **Sentry Integration:**
es: **Integración centinela **
fr: **Intégration du Guetteur :**
pt: **Integração de entrada:**

source: Health Checks
es: Comprobaciones de salud
fr: Tests de santé
pt: Exame de saúde

source: **Application Health Endpoint:**
es: **Terminal de Salud de la aplicación:**
fr: **Point de terminaison de la santé de l'application :**
pt: **Ponto de extremidade do aplicativo:**

source: Backup and Recovery
es: Copia de seguridad y recuperación
fr: Sauvegarde et restauration
pt: Backup e recuperação

source: Data backup strategies for production environments:
es: Estrategias de respaldo de datos para entornos de producción:
fr: Stratégies de sauvegarde des données pour les environnements de production :
pt: Estratégias de backup de dados para ambientes de produção:

source: Database Backups
es: Copias de seguridad de base de datos
fr: Sauvegardes de la base de données
pt: Backups de banco

source: **MongoDB Atlas Automated Backups:**
es: **Respaldas automatizadas de Atlas de MongoDB:**
fr: **Sauvegardes automatisées de l'Atlas MongoDB :**
pt: **Backups automatizados do MongoDB Atls:**

source: Atlas provides automated backups with point-in-time recovery
es: Atlas proporciona copias de seguridad automatizadas con recuperación punto-en-tiempo
fr: Atlas fournit des sauvegardes automatisées avec la restauration ponctuelle
pt: O Atlas fornece backups automatizados com recuperação ponto-tempo

source: Configure backup schedule and retention policies
es: Configurar la agenda de copias de seguridad y políticas de retención
fr: Configurer le calendrier de sauvegarde et les politiques de rétention
pt: Configurar horário de backup e políticas de retenção

source: Test backup restoration procedures regularly
es: Pruebe regularmente los procedimientos de restauración de copias de seguridad
fr: Tester régulièrement les procédures de restauration de sauvegarde
pt: Testar procedimentos de restauração de backup regularmente

source: **Manual Backup Scripts:**
es: **Copia de seguridad manual:**
fr: **Scripts de sauvegarde manuels :**
pt: **Scripts de backup manuais:**

source: Application Backups
es: Copias de seguridad de aplicaciones
fr: Sauvegardes de l'application
pt: Backups do aplicativo

source: **Code and Configuration Backup:**
es: **Copia de seguridad de código y configuración:**
fr: **Sauvegarde du code et de la configuration :**
pt: **Código e backup de configuração:**

source: Security Considerations
es: Consideraciones de seguridad
fr: Considérations de sécurité
pt: Considerações de segurança

source: Security best practices for production deployment:
es: Mejores prácticas de seguridad para el despliegue de la producción:
fr: Meilleures pratiques de sécurité pour le déploiement de production :
pt: Melhores práticas de segurança para a implantação na produção:

source: Environment Security
es: Seguridad del entorno
fr: Sécurité de l'environnement
pt: Segurança do Ambiente

source: **Secure Environment Variables:**
es: **Variables de entorno seguros:**
fr: **Variables d'environnement sécurisées :**
pt: **Variáveis de ambiente seguras:**

source: **Network Security:**
es: **Seguridad de red:**
fr: **Sécurité du réseau :**
pt: **Segurança de rede:**

source: Database Security
es: Seguridad de la base de datos
fr: Sécurité de la base de données
pt: Segurança da base

source: **MongoDB Security:**
es: **Seguridad MongoDB:**
fr: **Sécurité MongoDB :**
pt: **Segurança do MongoDB:**

source: Enable authentication and authorization
es: Habilitar autenticación y autorización
fr: Activer l'authentification et l'autorisation
pt: Habilitar autenticação e autorização

source: Use SSL/TLS for connections
es: Usar SSL/TLS para conexiones
fr: Utiliser SSL/TLS pour les connexions
pt: Usar SSL/TLS para conexões

source: Implement IP whitelisting
es: Implementar lista blanca de IP
fr: Implémenter la whitelisting IP
pt: Implementar lista branca IP

source: Regular security updates
es: Actualizaciones de seguridad regulares
fr: Mises à jour de sécurité régulières
pt: Atualizações de segurança regulares

source: Audit logging for database access
es: Registro de auditoría para acceso a base de datos
fr: Journalisation de l'audit pour l'accès à la base de données
pt: Registro de auditoria para acesso ao banco de dados

source: Troubleshooting
es: Solución de problemas
fr: Dépannage
pt: Solução de problemas

source: Common deployment issues and solutions:
es: Problemas y soluciones comunes de despliegue:
fr: Problèmes de déploiement et solutions courantes :
pt: Questões e soluções comuns de implantação:

source: **Build Failures:**
es: **Fallos de compilación:**
fr: **Échecs de construction :**
pt: **Falha na compilação:**

source: **Database Connection Issues:**
es: **Problemas de conexión de base de datos:**
fr: **Problèmes de connexion à la base de données :**
pt: **Problemas de Conexão:**

source: **Performance Issues:**
es: **Problemas de rendimiento:**
fr: **Problèmes de performance :**
pt: **Problemas de desempenho:**

source: **Memory Issues:**
es: **Problemas de memoria:**
fr: **Problèmes de mémoire :**
pt: **Problemas de memória:**

source: **package.json (heroku-postbuild script):**
pt: **package.json (script heroku-postbuild):**
