Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/feature.po
Languages: es, fr, pt

source: Features
es: Características
fr: Fonctionnalités
pt: Funcionalidades

source: AMRnet provides a comprehensive suite of features designed to make antimicrobial resistance (AMR) genomic surveillance data accessible and actionable for researchers, public health professionals, and policymakers worldwide.
es: AMRnet proporciona un conjunto completo de características diseñadas para hacer que los datos de vigilancia genómica de resistencia antimicrobiana (RM) sean accesibles y accesibles para los investigadores, profesionales de la salud pública y responsables de políticas en todo el mundo.
fr: AMRnet fournit une suite complète de fonctionnalités conçues pour rendre accessibles les données de surveillance génomique de résistance aux antimicrobiens (AMR) et utilisables pour les chercheurs, les professionnels de la santé publique et les décideurs du monde entier.
pt: AMRnet fornece um conjunto completo de recursos projetados para tornar dados de vigilância genómica antimicrobiana resistente (RMR) acessíveis e disponíveis para pesquisadores, profissionais de saúde pública e governantes em todo o mundo.

source: Interactive Visualizations
es: Visualizaciones interactivas
fr: Visualisations interactives
pt: Visualizações interativas

source: **🗺️ Interactive Global Maps**
es: **🗺️ Mapas globales interactivos**
fr: **🗺️ Cartes globales interactives**
pt: **🗺️ Mapas Globais Interativos**

source: Visualize resistance patterns across countries and regions
es: Visualizar patrones de resistencia a través de países y regiones
fr: Visualiser les modèles de résistance dans les pays et les régions
pt: Visualize padrões de resistência entre países e regiões

source: Color-coded prevalence data with geographic distribution
es: Datos de prevalencia codificados por colores con distribución geográfica
fr: Données de prévalence codées en couleur avec distribution géographique
pt: Dados de prevalência codificados por cores com distribuição geográfica

source: Clickable countries for detailed filtering
es: Países rastreables para filtrado detallado
fr: Pays cliquables pour un filtrage détaillé
pt: Países clicáveis para filtragem detalhada

source: Export capabilities for static maps (PNG format)
es: Capacidades de exportación para mapas estáticos (formato PNG)
fr: Capacités d'exportation pour les cartes statiques (format PNG)
pt: Exportar capacidades para mapas estáticos (formato PNG)

source: Responsive design that works on all devices
es: Diseño adaptable que funciona en todos los dispositivos
fr: Conception adaptative qui fonctionne sur tous les appareils
pt: Design responsivo que funciona em todos os dispositivos

source: **📊 Dynamic Trend Analysis**
es: **📊 Análisis Dinámico de Tendencia**
fr: **📊 Analyse dynamique des tendances**
pt: **📊 Análise de tendência dinâmica**

source: Track resistance changes over time with interactive graphs
es: Rastrear cambios de resistencia con el tiempo con gráficos interactivos
fr: Suivre les changements de résistance au fil du temps avec des graphiques interactifs
pt: Rastrear mudanças de resistência ao longo do tempo com gráficos interativos

source: Multiple chart types: line charts, bar charts, and scatter plots
es: Múltiples tipos de gráficos: gráficos de líneas, gráficos de barras y gráficos de dispersión
fr: Types de graphiques multiples: diagrammes à ligne, graphiques à barres et parachutes
pt: Vários tipos de gráfico: gráficos de linhas, gráficos de barras e gráficos de dispersão

source: Temporal filtering by year, month, or custom date ranges
es: Filtrado temporal por año, mes o intervalos de fechas personalizadas
fr: Filtrage temporel par année, mois ou dates personnalisées
pt: Filtragem temporal por ano, mês ou intervalos de datas personalizados

source: Real-time data updates as filters are applied
es: Actualizaciones de datos en tiempo real como filtros se aplican
fr: Mises à jour des données en temps réel lorsque les filtres sont appliqués
pt: Atualizações de dados em tempo real como filtros são aplicados

source: Downloadable chart data and static images
es: Datos de cartas descargables e imágenes estáticas
fr: Données téléchargeables du graphique et des images statiques
pt: Dados do gráfico e imagens estáticas para baixar

source: **🔍 Advanced Data Exploration**
es: **🔍 Exploración avanzada de datos**
pt: **🔍 Exploração Avançada**

source: Multi-dimensional filtering by organism, drug, genotype, and geography
es: Filtrado multidimensional por organismo, droga, genotipo y geografía
fr: Filtrage multidimensionnel par organisme, médicament, génotype et géographie
pt: Filtragem multidimensional por organismo, medicamento, genótipo e geografia

source: Dynamic legends with click-to-filter functionality
es: Leyendas dinámicas con funcionalidad click-to-filter
fr: Légendes dynamiques avec fonctionnalité de clic-pour-filtrer
pt: Legendas dinâmicas com funcionalidade de clique-para-filtro

source: Cross-chart filtering that updates all visualizations simultaneously
es: Filtrado multigráfico que actualiza todas las visualizaciones simultáneamente
fr: Filtrage inter-graphique qui met à jour toutes les visualisations simultanément
pt: Filtragem entre gráficos que atualiza todas as visualizações simultaneamente

source: Custom aggregation options (counts vs. percentages)
es: Opciones personalizadas de agregación (cuenta vs. porcentajes)
fr: Options d'agrégation personnalisées (compte vs. pourcentages)
pt: Opções de agregação personalizadas (conta vs. porcentagens)

source: Real-time data validation and error handling
es: Validación de datos en tiempo real y manejo de errores
fr: Validation des données en temps réel et gestion des erreurs
pt: Validação e tratamento de erros em tempo real

source: Supported Organisms
es: Organismos soportados
fr: Organismes pris en charge
pt: Organismos Suportados

source: **🦠 Comprehensive Pathogen Coverage**
es: **🦠 cobertura completa de patógeno**
fr: **🦠 couverture complète de pathogène**
pt: **🦠 Capa abrangente de agente patogênico**

source: AMRnet supports surveillance data for eight major pathogens:
es: AMRnet soporta datos de vigilancia de ocho patógenos principales:
fr: AMRnet prend en charge les données de surveillance de huit pathogènes majeurs :
pt: A AMRnet suporta dados de vigilância para oito principais patogénicas:

source: **Salmonella Typhi** (*S.* Typhi) - Typhoid fever surveillance with H58 lineage tracking
es: **Typhi de Salmonela** (*S.* Typhi) - Vigilancia de la fiebre tifoide con seguimiento del linaje H58
fr: **Salmonella Typhi** (*S.* Typhi) - Surveillance de la fièvre typhoïde avec suivi de la lignée H58
pt: **Salmonella Typhi** (*S.* Typhi) - Vigilância Typhoid com rastreamento de linhagem H58

source: **Klebsiella pneumoniae** (*K. pneumoniae*) - Healthcare-associated infections and carbapenemase monitoring
es: **Klebsiella pneumoniae** (*K. pneumoniae*) - Infecciones relacionadas con el cuidado sanitario y monitorización de carbapenemase
fr: **Klebsiella pneumoniae** (*K. pneumoniae*) - Infections associées aux soins de santé et surveillance des carbapenemases
pt: **Klebsiella pneumoniae** (*K. pneumoniae*) - Infecções associadas a saúde e monitoramento de carboidratos

source: **Neisseria gonorrhoeae** (*N. gonorrhoeae*) - Gonorrhea resistance monitoring with WHO surveillance data
es: **Neisseria gonorrhoeae** (*N. gonorrhoeae*) - Monitoreo de resistencia Gonorrhea con datos de vigilancia de la OMS
fr: **Neisseria gonorrhoeae** (*N. gonorrhoeae*) - Surveillance de la résistance à la gonorrhée avec les données de surveillance de l'OMS
pt: **Neisseria gonorrhoeae** (*N. gonorrhoeae*) - Resistência a Gonorrhea monitorando com dados de vigilância OMS

source: **Escherichia coli** (*E. coli*) - ESBL and carbapenemase tracking, STEC surveillance
es: **Escherichia coli** (*E. coli*) - Seguimiento ESBL y carbapenemasa, vigilancia STEC
fr: **Escherichia coli** (*E. coli*) - Suivi ESBL et Carbapenemase, surveillance STEC
pt: **Ischerichia coli** (*E. coli*) - ESBL e carbono inimigo, vigilância STEC

source: **Diarrheagenic E. coli** (*dEcoli*) - Specialized diarrheal disease surveillance
es: **Ecoli** diarreico (*dEcoli*) - Vigilancia de enfermedades diarreicas especializada
fr: **Diarrhéagène E. coli** (*dEcoli*) - Surveillance spécialisée des maladies diarrhéiques
pt: **Ecoli. diarreia** (*dEcoli*) - Inspecção especializada de doenças diarreicas

source: **Shigella** (*Shigella* spp.) - Dysentery and MDR monitoring with serotype tracking
es: **Shigella** (*Shigella* spp.) - Monitorización de disentería y MDR con seguimiento de serotipo
fr: **Shigella** (*Shigella* spp.) - Surveillance de la dysenterie et de la MDR avec suivi sérotype
pt: **Shigella** (*Shigella* spp.) - Monitoramento Dysentery e MDR com rastreamento de serótipo

source: **Salmonella enterica INTS** - Invasive non-typhoidal Salmonella tracking
es: **Salmonella enterica INTS** - Seguimiento de Salmonella no tifoidal invasiva
fr: **Salmonella enterica INTS** - Traçage invasif de salmonelles non typhoïdes
pt: **Salmonella enterica INTS** - Rastreamento salmonela não tirôide

source: Internationalization
es: Internacionalización
fr: Internationalisation
pt: Internacionalização

source: **🌍 Multi-Language Support**
es: **:globe_showing_Europe-Portugal: Soporte multilingüe**
fr: **🌍 Support multi-langues**
pt: **:globe_showing_Europe-África: Suporte a Múltiplos Idiomas**

source: **English** (Default) - Comprehensive interface language
es: **Inglés** (por defecto) - Idioma completo de la interfaz
fr: **Français** (Défaut) - Langue complète de l'interface
pt: **Inglês** (Padrão) - Idioma de interface abrangente

source: **French** - Professional French translations with proper terminology
es: **Fraude** - Traducciones profesionales al francés con una terminología adecuada
fr: **Français** - Traductions professionnelles en français avec une terminologie appropriée
pt: **Francês** - Traduções profissionais francesas com terminologia adequada

source: **Portuguese (Brazil)** - Brazilian Portuguese with local conventions
es: **Portugués (Brasil)** - Portugués brasileño con convenciones locales
fr: **Portugais (Brésil)** - Portugais brésilien avec des conventions locales
pt: **Português (Brasil)** - Português brasileiro com convenções locais

source: **Spanish** - International Spanish translations
es: **Español** - Traducciones internacionales al español
fr: **Espagnol** - Traductions espagnoles internationales
pt: **Espanhol** - Traduções de Espanhol Internacional

source: Visual flag-based language switcher
es: Interruptor de idioma basado en parámetros visuales
fr: Sélecteur de langue basé sur les drapeaux visuels
pt: Alternador de idioma com sinalizadores visuais

source: Persistent language selection across sessions
es: Selección persistente de idioma a través de sesiones
fr: Sélection persistante de la langue à travers les sessions
pt: Seleção de idioma persistente entre sessões

source: Right-to-left language support ready
es: Soporte de idioma de derecha a izquierda listo
fr: Prêt à prendre en charge la langue de droite à gauche
pt: Suporte à direita-para-esquerda pronto

source: User Experience
es: Experiencia de usuario
fr: Expérience utilisateur
pt: Experiência do Usuário

source: **📱 Responsive Design**
es: **📱 Diseño responsable**
fr: **📱 Design adaptatif**
pt: **📱 Design responsivo**

source: Optimized for desktop, tablet, and mobile devices
es: Optimizado para escritorio, tableta y dispositivos móviles
fr: Optimisé pour les ordinateurs de bureau, la tablette et les appareils mobiles
pt: Otimizado para desktop, tablet e dispositivos móveis

source: Touch-friendly interface for mobile users
es: Interfaz fácil de tocar para usuarios móviles
fr: Interface tactile pour les utilisateurs mobiles
pt: Interface amigável para usuários móveis

source: Adaptive layouts that work across screen sizes
es: Diseños adaptativos que funcionan a través de tamaños de pantalla
fr: Dispositions adaptatives qui fonctionnent sur toutes les tailles d'écran
pt: Layouts adaptáveis que funcionam entre os tamanhos de tela

source: Progressive web app capabilities
es: Capacidades de la aplicación web progresivas
fr: Fonctionnalités des applications web progressives
pt: Recursos progressivos de aplicativos web

source: Offline data caching for improved performance
es: Caché de datos sin conexión para mejorar el rendimiento
fr: Mise en cache des données hors ligne pour améliorer les performances
pt: Cache de dados offline para melhor desempenho

source: **🚀 Performance Optimization**
es: **🚀 Optimización de rendimiento**
fr: **🚀 Optimisation des performances**
pt: **🚀 Otimização de desempenho**

source: Lazy loading of data and components
es: Carga perezosa de datos y componentes
fr: Chargement pénible des données et des composants
pt: Carregamento lento de dados e componentes

source: Intelligent caching to reduce server load
es: Caché inteligente para reducir la carga del servidor
fr: Mise en cache intelligente pour réduire la charge du serveur
pt: Cache inteligente para reduzir a carga do servidor

source: Compressed data transfer (up to 96% size reduction)
es: Transferencia de datos comprimidos (hasta 96% de reducción de tamaño)
fr: Transfert de données compressé (jusqu'à 96% de réduction de la taille)
pt: Transferência de dados comprimida (redução de até 96%)

source: Parallel data loading for faster initial page loads
es: Carga paralela de datos para cargas iniciales más rápidas
fr: Chargement parallèle des données pour accélérer le chargement de la page initiale
pt: Carregamento paralelo de dados para carregamento mais rápido da página inicial

source: Background processing for large datasets
es: Procesamiento de fondo para conjuntos de datos grandes
fr: Traitement en arrière-plan pour les jeux de données volumineux
pt: Processamento de fundo para grandes conjuntos de dados

source: Data Access & Export
es: Acceso a datos y exportación
fr: Accès aux données et exportation
pt: Acesso e Exportação de Dados

source: **📁 Flexible Data Export**
es: **📁 Exportación de datos flexibles**
fr: **📁 Exportation de données flexible**
pt: **📁 Exportação de dados flexível**

source: Download filtered datasets in CSV format
es: Descargar conjuntos de datos filtrados en formato CSV
fr: Télécharger les jeux de données filtrés au format CSV
pt: Baixar datasets filtrados no formato CSV

source: Export static visualizations (PNG, SVG)
es: Exportar visualizaciones estáticas (PNG, SVG)
fr: Exporter les visualisations statiques (PNG, SVG)
pt: Exportar visualizações estáticas (PNG, SVG)

source: Generate PDF reports with current dashboard state
es: Generar informes PDF con el estado actual del panel de control
fr: Générer des rapports PDF avec l'état actuel du tableau de bord
pt: Gerar relatórios PDF com o estado atual do painel

source: Custom data selection with field-level control
es: Selección de datos personalizada con control de nivel de campo
fr: Sélection de données personnalisée avec contrôle de niveau de champ
pt: Seleção de dados personalizados com controle de nível de campo

source: Batch export capabilities for multiple organisms
es: Capacidades de exportación de múltiples órganos
fr: Fonctionnalités d'exportation par lots pour plusieurs organismes
pt: Capacidades de exportação em lote para vários organismos

source: **🔌 API Access**
es: **🔌 Acceso a la API**
fr: **🔌 Accès API**
pt: **🔌 Acesso à API**

source: RESTful API with comprehensive documentation
es: API RESTful con documentación completa
fr: API RESTful avec documentation complète
pt: API RESTful com documentação completa

source: Programmatic access to all dashboard data
es: Acceso programático a todos los datos del panel de control
fr: Accès programmatique à toutes les données du tableau de bord
pt: Acesso programático a todos os dados do painel de controle

source: Rate limiting and authentication for production use
es: Limitación de velocidad y autenticación para uso de producción
fr: Limitation des taux et authentification pour utilisation en production
pt: Limitador de taxa e autenticação para produção

source: OpenAPI/Swagger documentation
es: Documentación OpenAPI/Swagger
fr: Documentation OpenAPI/Swagger
pt: Documentação OpenAPI/Swagger

source: SDK libraries for common programming languages
es: Bibliotecas SDK para lenguajes de programación comunes
fr: Librairies SDK pour les langages de programmation communs
pt: Bibliotecas do SDK para linguagens de programação comuns

source: Advanced Features
es: Características avanzadas
fr: Fonctionnalités Avancées
pt: Recursos Avançados

source: **🔬 Scientific Analysis Tools**
es: **🔬 Herramientas de análisis científico**
fr: **🔬 Outils d'analyse scientifique**
pt: **🔬 Ferramentas de Análise Científica**

source: Statistical trend analysis with confidence intervals
es: Análisis estático de tendencias con intervalos de confianza
fr: Analyse statistique des tendances avec intervalles de confiance
pt: Análise de tendência estatística com intervalos de confiança

source: Geographic clustering and hotspot identification
es: Clasificación geográfica e identificación de puntos de acceso
fr: Graphique géographique et identification du point d'accès
pt: Agrupamento geográfico e identificação do hotspot

source: Phylogenetic data integration where available
es: Integración de datos fitogenéticos cuando esté disponible
fr: Intégration des données phylogénétiques si disponible
pt: Integração de dados físicos, quando disponível

source: Resistance mechanism tracking (genotypic vs. phenotypic)
es: Seguimiento del mecanismo de resistencia (genotipado vs. fenotípico)
fr: Suivi du mécanisme de résistance (génotypique vs. phénotypique)
pt: Rastreamento de mecanismo de resistência (genotipico vs. fenotypic)

source: Outbreak detection and monitoring capabilities
es: Capacitación de detección y monitorización de brotes
fr: Capacités de détection et de surveillance d'épidémies
pt: Recursos de detecção e monitoramento de surtos

source: **🛡️ Data Quality & Security**
es: **🛡️ Calidad y seguridad de datos**
fr: **🛡️ Qualité et sécurité des données**
pt: **🛡️ Qualidade de Dados e Segurança**

source: Comprehensive data validation and quality checks
es: Validación completa de datos y comprobaciones de calidad
fr: Validation complète des données et contrôles de qualité
pt: Verificações abrangentes de validação e qualidade de dados

source: Secure data transmission with HTTPS encryption
es: Transmisión segura de datos con cifrado HTTPS
fr: Transmission de données sécurisée avec chiffrement HTTPS
pt: Transmissão segura de dados com criptografia HTTPS

source: User authentication and authorization
es: Autenticación de usuario y autorización
fr: Authentification et autorisation de l'utilisateur
pt: Autenticação de usuário e autorização

source: Audit logging for data access and modifications
es: Registro de auditoría para acceso a datos y modificaciones
fr: Enregistrement de l'audit pour l'accès aux données et les modifications
pt: Registro de auditoria para acesso aos dados e modificações

source: Privacy-compliant data handling procedures
es: Procedimientos de manejo de datos compatibles con la privacidad
fr: Procédures de traitement des données conformes à la vie privée
pt: Procedimentos de processamento de dados compatíveis com privacidade

source: **🔄 Real-time Updates**
es: **🔄 Actualizaciones en tiempo real**
fr: **🔄 Mises à jour en temps réel**
pt: **🔄 Atualizações em tempo real**

source: Automatic data synchronization from surveillance networks
es: Sincronización automática de datos de redes de vigilancia
fr: Synchronisation automatique des données à partir des réseaux de surveillance
pt: Sincronização automática de dados de redes de vigilância

source: Version control for datasets with change tracking
es: Control de versiones para conjuntos de datos con seguimiento de cambios
fr: Contrôle de version des jeux de données avec suivi des changements
pt: Controle de versão para conjuntos de dados com rastreamento de alterações

source: Notification system for data updates
es: Sistema de notificaciones para actualizaciones de datos
fr: Système de notification pour les mises à jour des données
pt: Sistema de notificações para atualizações de dados

source: Backward compatibility for historical data access
es: Compatibilidad con el acceso de datos históricos
fr: Compatibilité ascendante pour l'accès aux données historiques
pt: Compatibilidade com backward para acesso histórico a dados

source: Data provenance tracking and metadata management
es: Seguimiento de datos de procedencia y gestión de metadatos
fr: Suivi de la provenance des données et gestion des métadonnées
pt: Rastreamento de proveniência de dados e gerenciamento de metadados

source: Integration Capabilities
es: Capacidades de integración
fr: Capacités d'intégration
pt: Recursos de Integração

source: **🌐 External System Integration**
es: **🌐 Integración de Sistema Externo**
fr: **🌐 Intégration de système externe**
pt: **🌐 Integração de sistema externo**

source: NCBI pathogen database connectivity
es: Conectividad de base de datos de patógeno NCBI
fr: Connectivité de la base de données d'agents pathogènes NCBI
pt: Conectividade ao banco de dados patogênico NCBI

source: WHO surveillance network integration
es: Integración de la red de vigilancia de la OMS
fr: Intégration du réseau de surveillance de l'OMS
pt: Integração com rede de vigilância OMS

source: ECDC/CDC data pipeline compatibility
es: Compatibilidad de tuberías de datos ECDC/CDC
fr: Compatibilité du pipeline de données ECDC/CDC
pt: ECDC/CDC compatibilidade com pipeline de dados

source: Laboratory information system (LIS) connectors
es: Conectores del sistema de información laboratoria (LIS)
fr: Connecteurs du système d'information de laboratoire (LIS)
pt: Conectores do sistema de informação laboratorial (LIS)

source: Automated data validation and quality scoring
es: Validación automática de datos y puntuación de calidad
fr: Validation automatisée des données et notation de qualité
pt: Validação automatizada de dados e pontuação de qualidade

source: **📊 Analytics & Reporting**
es: **📊 Análisis e Informe**
pt: **📊 Análise e Relatórios**

source: Customizable dashboard views for different user types
es: Visitas de tablero personalizables para diferentes tipos de usuario
fr: Vues personnalisables du tableau de bord pour différents types d'utilisateurs
pt: Visualizações de painel personalizadas para diferentes tipos de usuários

source: Automated report generation with scheduling
es: Generación automática de informes con programación
fr: Génération automatique du rapport avec la planification
pt: Geração de relatórios automatizados com agendamento

source: Key performance indicator (KPI) tracking
es: Llave de seguimiento del indicador de rendimiento (KPI)
fr: Suivi de l'indicateur de performance des clés (KPI)
pt: Indicador de performance principal (KPI) rastreamento

source: Comparative analysis between regions and time periods
es: Análisis comparativo entre regiones y períodos de tiempo
fr: Analyse comparative entre régions et périodes de temps
pt: Análise comparativa entre regiões e períodos de tempo

source: Statistical significance testing for trend analysis
es: Pruebas de importancia estáticas para el análisis de tendencias
fr: Test de l'importance statistique pour l'analyse des tendances
pt: Teste estatístico de significância para análise de tendência
