Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/index.po
Languages: es, fr

source: Dashboard overview
es: Resumen del tablero
fr: Aperçu du tableau de bord

source: Individual pathogen details
es: Detalles del patógeno individual
fr: Détails de l'agent pathogène individuel

source: Source data & tools
es: Herramientas y datos de origen
fr: Données et outils source

source: Dashboard users
es: Usuarios del panel
fr: Utilisateurs du tableau de bord

source: API Reference
es: Referencia API
fr: Référence API

source: Data access
es: Acceso a datos
fr: Accès aux données

source: API users
es: Usuarios API
fr: Utilisateurs de l'API

source: Developer Guide
es: Guía de Desarrollador
fr: Guide du développeur

source: Developers
es: Desarrolladores
fr: Développeurs

source: The `AMRnet dashboard <https://www.amrnet.org/>`_ aims to make high-quality, robust and reliable genome-derived AMR surveillance data accessible to a wide audience. Visualizations are geared towards showing national annual AMR prevalence estimates and trends, that can be broken down and explored in terms of underlying lineages/genotypes and resistance mechanisms. We do not generate sequence data, but we hope that by making publicly deposited data more accessible and useful, we can encourage and motivate more sequencing and data sharing.
es: El `panel de control AMRnet <https://www.amrnet.org/>`_ tiene como objetivo hacer que los datos de vigilancia de AMR derivados del genoma sean accesibles a un público amplio, robustos y fiables. Las visualizaciones están orientadas a mostrar estimaciones y tendencias de prevalencia de AMR anuales a nivel nacional, que pueden ser desglosados y explorados en términos de linajes/genotipos subyacentes y mecanismos de resistencia. No generamos datos de secuencia, pero esperamos que haciendo que los datos depositados públicamente sean más accesibles y útiles, podemos alentar y motivar más secuenciación y compartir datos.
fr: Le `tableau de bord AMRnet <https://www.amrnet.org/>`_ vise à rendre accessibles à un large public les données de surveillance AMR de haute qualité, robustes et fiables. Les visualisations ont pour but de montrer des estimations et des tendances de la prévalence AMR annuelles nationales, qui peuvent être décomposées et explorées en termes de lignes/génotypes sous-jacents et de mécanismes de résistance. Nous ne générons pas de données de séquence, mais nous espérons qu'en rendant les données déposées publiquement plus accessibles et utiles, nous pouvons encourager et motiver davantage le séquençage et le partage de données.

source: We started with *Salmonella* Typhi, based on our `TyphiNET <https://www.typhi.net>`_ dashboard which uses data curated by the `Global Typhoid Genomics Consortium <http://typhoidgenomics.org>`_ (to improve data quality and identify which datasets are suitable for inclusion) and analysed in Pathogenwatch_ (to call AMR determinants and lineages from sequence data). Dashboards are now available for *Klebsiella pneumoniae*, *Neisseria gonorrhoeae*, non-typhoidal *Salmonella*, *E. coli* and *Shigella* using data sourced from the Pathogenwatch_ and `Enterobase <https://enterobase.warwick.ac.uk/>`_ platforms. In the future, we plan to add additional organisms, sourced from these and other platforms.
es: Comenzamos con *Salmonella* Tiphi, basado en nuestro `TyphiNET <https://www.typhi.net>`_ dashboard que utiliza datos curados por el `Global Typhoid Genomics Consortium <http://typhoidgenomics.org>`_ (para mejorar la calidad de los datos e identificar qué conjuntos de datos son adecuados para la inclusión) y analizado en Pathogenwatch_ (para llamar a los determinantes y linajes de la secuencia de datos). Los paneles están ahora disponibles para *Klebsiella pneumoniae*, *Neisseria gonorrhoeae*, non-typhoidal *Salmonella*, *E. coli* y *Shigella* usando los datos originados de las plataformas Pathogenwatch_ y `Enterobase <https://enterobase.warwick.ac.uk/>`_. En el futuro, tenemos previsto añadir organismos adicionales, provenientes de estas y otras plataformas.
fr: Nous avons commencé avec *Salmonella* Typhi, basé sur notre tableau de bord `TyphiNET <https://www.typhi.net>`_ qui utilise des données supervisées par le `Global Typhoid Genomics Consortium <http://typhoidgenomics.org>`_ (pour améliorer la qualité des données et identifier quels jeux de données sont adaptés à l'inclusion) et analysées dans Pathogenwatch_ (pour appeler les déterminants AMR et les lignées des données de séquence). Les tableaux de bord sont maintenant disponibles pour *Klebsiella pneumoniae*, *Neisseria gonorrhoeae*, *Salmonelle non typhoïde*, *E. coli* et *Shigella* en utilisant les données provenant des plateformes Pathogenwatch_ et `Enterobase <https://enterobase.warwick.ac.uk/>`_. À l’avenir, nous prévoyons d’ajouter des organismes supplémentaires, provenant de ces plates-formes et d’autres plates-formes.

source: A major barrier to using public data for surveillance is the need for careful data curation, to identify which datasets are relevant for inclusion in pooled estimates of AMR and genotype prevalence. This kind of curation can benefit a wide range of users and we plan to work with other organism communities to curate data, and to contribute to wider efforts around metadata standards. Please get in touch if you would like to work with us (`amrnetdashboard@gmail.com <amrnetdashboard@gmail.com>`_).
es: Una barrera importante para el uso de datos públicos para la vigilancia es la necesidad de una cuidadosa curación de los datos, identificar qué conjuntos de datos son relevantes para su inclusión en estimaciones agrupadas de AMR y prevalencia genotípica. Este tipo de curación puede beneficiar a una amplia gama de usuarios y tenemos previsto trabajar con otras comunidades de organismos para curar datos, y contribuir a mayores esfuerzos en torno a los estándares de metadatas. Póngase en contacto con nosotros si desea trabajar con nosotros (`amrnetdashboard@gmail.com <amrnetdashboard@gmail.com>`_).
fr: Un obstacle majeur à l'utilisation des données publiques à des fins de surveillance est la nécessité d'une conservation prudente des données, pour identifier quels jeux de données sont pertinents pour être inclus dans les estimations regroupées de AMR et la prévalence du génotype. Ce type de conservation peut bénéficier à un large éventail d'utilisateurs et nous avons l'intention de travailler avec d'autres communautés d'organismes pour organiser des données, et contribuer à des efforts plus larges autour des normes de métadonnées. Veuillez nous contacter si vous souhaitez travailler avec nous (`amrnetdashboard@gmail.com <amrnetdashboard@gmail.com>`_).

source: **Key links:**
es: **Enlaces clave:**
fr: **Liens clés:**

source: The dashboard is accessible at `https://www.amrnet.org <https://www.amrnet.org/>`_.
es: El panel de control es accesible en `https://www.amrnet.org <https://www.amrnet.org/>`_.
fr: Le tableau de bord est accessible sur `https://www.amrnet.org <https://www.amrnet.org/>`_.

source: Info about the project team (based at London School of Hygiene and Tropical Medicine), and our policy advisory group, is `here <https://www.lshtm.ac.uk/amrnet>`__.
es: Información sobre el equipo del proyecto (basado en la London School of Hygiene y Tropical Medicine), y nuestro grupo asesor de políticas, es `aquí <https://www.lshtm.ac.uk/amrnet>`__.
fr: Informations sur l'équipe du projet (basée à la London School of Hygiene and Tropical Medicine), et notre groupe consultatif en matière de politique est `ici <https://www.lshtm.ac.uk/amrnet>`__.

source: Citation, Code and License
es: Citación, código y licencia
fr: Citation, code et licence

source: AMRnet is free and open source software, distributed under the terms of the :doc:`GPLv3 License <license>`.
es: AMRnet es software libre y de código abierto, distribuido bajo los términos de la licencia :doc:`GPLv3 <license>`.
fr: AMRnet est un logiciel libre et open source, distribué sous les termes de la :doc:`GPLv3 License <license>`.

source: The dashboard code is open access and available in `GitHub <https://github.com/amrnet/amrnet>`_.
es: El código del panel es de acceso abierto y está disponible en `GitHub <https://github.com/amrnet/amrnet>`_.
fr: Le code du tableau de bord est ouvert et disponible dans `GitHub <https://github.com/amrnet/amrnet>`_.

source: Issues and feature requests can be posted `here <https://github.com/amrnet/amrnet/issues>`__.
es: Los problemas y las solicitudes de características pueden ser publicados `aquí <https://github.com/amrnet/amrnet/issues>`__.
fr: Les tickets et les demandes de fonctionnalités peuvent être publiés `ici <https://github.com/amrnet/amrnet/issues>`__.

source: API access is described on the :doc:`/data` page.
es: El acceso a la API se describe en la página :doc:`/data`.
fr: L'accès à l'API est décrit sur la page :doc:`/data`.

source: If you want to install the AMRnet code to develop your own dashboard instances, see the :doc:`Installation Guide <installation>`.
es: Si desea instalar el código AMRnet para desarrollar sus propias instancias de dashboard, vea el :doc:`Installation Guide <installation>`.
fr: Si vous voulez installer le code AMRnet pour développer votre propre tableau de bord, consultez le `Guide d'installation :doc: <installation>`.

source: If you use the AMRnet website or code, please cite **AMRnet** Cerdeira LT, Dyson ZA, Sharma V, et al. AMRnet: a data visualization platform to interactively explore pathogen variants and antimicrobial resistance. Nucleic Acids Res. Published online November 6, 2025. doi:[10.1093/nar/gkaf1101](https://doi.org/10.1093/nar/gkaf1101)
es: Si utiliza el sitio web o código de AMRnet, por favor cite **AMRnet** Cerdeira LT, Dyson ZA, Sharma V, et al. AMRnet: a data visualization platform to interactively explore pathogen variants and antimicrobial resistance. Nucleic Acids Res. Published online November 6, 2025. doi:[10.1093/nar/gkaf1101](https://doi.org/10.1093/nar/gkaf1101)

source: Depending on what data and visualizations you are using in AMRnet, you should also consider citing the upstream source databases and typing tools (noted in the pathogen-specific pages and :ref:`here <source>`), or individual source studies (via PubMed IDs or DOIs available in the TSV download at the bottom of each dashboard).
es: Dependiendo de los datos y visualizaciones que esté usando en AMRnet, también debes considerar citar las bases de datos de fuentes originales y las herramientas de escritura (anotadas en las páginas específicas de patógeno y :ref:`aquí <source>`), o estudios de fuentes individuales (a través de PubMed IDs o DOI disponibles en la descarga del TSV en la parte inferior de cada panel).
fr: Selon les données et les visualisations que vous utilisez dans AMRnet, vous devriez également envisager de citer les bases de données source amont et les outils de saisie (notés dans les pages spécifiques aux pathogènes et :ref:`ici <source>`), ou des études de source individuelles (via PubMed IDs ou DOIs disponibles dans le téléchargement TSV au bas de chaque tableau de bord).

source: Disclaimer
es: Descargo de responsabilidad
fr: Clause de non-responsabilité

source: AMRnet is an open source research project, providing access to data and visualisations sourced from publicly accessible sequence databases and analysis platforms. The content on our service is provided for general information only. It is not intended to amount to advice on which you should rely. You must obtain professional or specialist advice before taking, or refraining from, any action on the basis of the content on our service. Although we make reasonable efforts to update the information on our service, we make no representations, warranties or guarantees, whether express or implied, that the content on our service is accurate, complete or up to date. We are not responsible for the results of reliance on any such information.
es: AMRnet es un proyecto de investigación de código abierto, que proporciona acceso a datos y visualizaciones provenientes de bases de datos de secuencia de acceso público y plataformas de análisis. El contenido de nuestro servicio se proporciona únicamente para información general. No se trata de un consejo en el que usted deba confiar. Usted debe obtener asesoramiento profesional o especializado antes de tomar o de contraer cualquier acción sobre la base del contenido de nuestro servicio. Aunque hacemos esfuerzos razonables para actualizar la información de nuestro servicio, no hacemos representaciones, Garantías o garantías, ya sean expresas o implícitas, de que el contenido de nuestro servicio sea exacto, completo o actualizado. No nos hacemos responsables de los resultados de la confianza en dicha información.
fr: AMRnet est un projet de recherche open source, fournissant un accès aux données et aux visualisations provenant de bases de données et de plateformes d'analyse accessibles au public. Le contenu de notre service est fourni à titre indicatif seulement. Il ne s'agit pas d'un conseil sur lequel vous devriez compter. Vous devez obtenir des conseils professionnels ou spécialisés avant de prendre, ou de vous abstenir, toute action sur la base du contenu de notre service. Bien que nous fassions des efforts raisonnables pour mettre à jour les informations sur notre service, nous ne faisons aucune représentation, garantit ou garantit, expresse ou implicite, que le contenu de notre service est exact, complet ou à jour. Nous ne sommes pas responsables des résultats de la dépendance à l'égard de telles informations.

source: Refer to the :doc:`License <license>` for clarification of the conditions of use.
es: Consulte la :doc:`Licencia <license>` para aclarar las condiciones de uso.
fr: Reportez-vous à la `Licence :doc: <license>` pour clarifier les conditions d'utilisation.

source: If you use the AMRnet website or code, please cite **AMRnet** (https://www.amrnet.org) or **GitHub**: https://github.com/amrnet/amrnet, and **DOI**: 10.5281/zenodo.10810219 (Louise Cerdeira, Vandana Sharma, Kathryn Holt).
fr: Si vous utilisez le site Web ou le code AMRnet, citez **AMRnet** (https://www.amrnet.org) ou **GitHub**: https://github.com/amrnet/amrnet, et **DOI**: 10.5281/zenodo.10810219 (Louise Cerdeira, Vandana Sharma, Kathryn Holt).
