Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/installation.po
Languages: es, fr, pt

source: Features
es: Características
fr: Fonctionnalités
pt: Funcionalidades

source: Performance Optimization
es: Optimización de rendimiento
fr: Optimisation des performances
pt: Otimização de desempenho

source: Deployment Guide
es: Guía de despliegue
fr: Guide de déploiement
pt: Guia de implantação

source: Security Guide
es: Guía de seguridad
fr: Guide de sécurité
pt: Guia de segurança

source: Professional Translation Services
es: Servicios profesionales de traducción
fr: Services de traduction professionnels
pt: Serviços de tradução profissional

source: Troubleshooting
es: Solución de problemas
fr: Dépannage
pt: Solução de problemas

source: Contributor Guide
es: Guía del colaborador
fr: Guide du contributeur
pt: Guia do Colaborador

source: Code of Conduct
es: Código de conducta
fr: Code de conduite
pt: Código de Conduta

source: License
es: Licencia
fr: Licence
pt: Tipo:

source: Developer Guide
es: Guía de Desarrollador
fr: Guide du développeur
pt: Guia do Desenvolvedor

source: These instructions will get you a copy of ``AMRnet`` up and running on your machine for development and testing purposes. AMRnet is a full-stack web application built with Node.js, React, and MongoDB.
es: Estas instrucciones le proporcionarán una copia de ``AMRnet`` en funcionamiento en su máquina para fines de desarrollo y prueba. AMRnet es una aplicación web completamente compilada con Node.js, React, y MongoDB.
fr: Ces instructions vous donneront une copie de ``AMRnet`` fonctionnant sur votre machine à des fins de développement et de test. AMRnet est une application web full-stack construite avec Node.js, React et MongoDB.
pt: Essas instruções vão fazer com que você faça uma cópia do ``AMRnet`` esteja a funcionar na sua máquina para fins de desenvolvimento e teste. AMRnet é um aplicativo web completo construído com Node.js, React, e MongoDB.

source: Prerequisites
es: Prerrequisitos
fr: Pré-requis
pt: Pré-requisitos

source: Before installing AMRnet, make sure you have the following software installed:
es: Antes de instalar AMRnet, asegúrese de tener el siguiente software instalado:
fr: Avant d'installer AMRnet, assurez-vous d'avoir le logiciel suivant installé :
pt: Antes de instalar o AMRnet, certifique-se de que você tem o seguinte software instalado:

source: **Node.js**: v18.20.4 or higher (specified in ``.nvmrc``)
es: **Node.js**: v18.20.4 o superior (especificado en ``.nvmrc``)
fr: **Node.js** : v18.20.4 ou supérieur (spécifié dans ``.nvmrc``)
pt: **Node.js**: v18.20.4 ou superior (especificado em ``.nvmrc``)

source: **npm**: Latest version (comes with Node.js)
es: **npm**: Última versión (viene con Node.js)
fr: **npm**: Dernière version (fournie avec Node.js)
pt: **npm**: Versão mais recente (vem com Node.js)

source: **Python**: v3.8+ (for data processing components)
es: **Python**: v3.8+ (para componentes de procesamiento de datos)
fr: **Python** : v3.8+ (pour les composants de traitement de données)
pt: **Python**: v3.8+ (para componentes de processamento de dados)

source: **Git**: Latest version for version control
es: **Git**: última versión para control de versiones
fr: **Git** : Dernière version pour le contrôle de version
pt: **Git**: Versão mais recente para controle de versão

source: **MongoDB**: v6.0+ (local installation or MongoDB Atlas cloud database)
es: **MongoDB**: v6.0+ (instalación local o base de datos de MongoDB Atlas)
fr: **MongoDB** : v6.0+ (installation locale ou base de données du cloud MongoDB)
pt: **MongoDB**: v6.0+ (instalação local ou banco de dados de nuvem do MongoDB Atlas)

source: You can check your installed versions with:
es: Puede comprobar las versiones instaladas con:
fr: Vous pouvez vérifier vos versions installées avec :
pt: Você pode verificar suas versões instaladas com:

source: Quick Start
es: Inicio rápido
fr: Démarrage rapide
pt: Início rápido

source: Follow these steps to get AMRnet running locally:
es: Siga estos pasos para que AMRnet se ejecute localmente:
fr: Suivez ces étapes pour que AMRnet fonctionne localement :
pt: Siga estes passos para que a AMRnet funcione localmente:

source: **1. Clone the Repository**
es: **1. Clonar el Repositorio**
fr: **1. Cloner le dépôt**
pt: **1. Clonar o repositório**

source: **2. Install Dependencies**
es: **2. Instalar dependencias**
fr: **2. Installez les dépendances**
pt: **2. Instale as dependências**

source: **3. Environment Configuration**
es: **3. Configuración de entorno**
fr: **3. Configuration de l'environnement**
pt: **3. Configuração de ambiente**

source: **4. Start Development Servers**
es: **4. Iniciar Servidores de Desarrollo**
fr: **4. Lancer les serveurs de développement**
pt: **4. Iniciar Servidores de Desenvolvimento**

source: **5. Access the Application**
es: **5. Accede a la aplicación**
fr: **5. Accéder à l'application**
pt: **5. Acesse o aplicativo**

source: Open your browser and navigate to ``http://localhost:3000`` to see the AMRnet dashboard.
es: Abra su navegador y vaya a ``http://localhost:3000`` para ver el panel de control de AMRnet.
fr: Ouvrez votre navigateur et accédez à ``http://localhost:3000`` pour voir le tableau de bord AMRnet.
pt: Abra seu navegador e navegue para ``http://localhost:3000`` para ver o painel AMRnet.

source: Development Setup
es: Configuración de desarrollo
fr: Configuration du développement
pt: Configurações de Desenvolvimento

source: For detailed development setup, including code quality tools and best practices:
es: Para una configuración de desarrollo detallada, incluyendo herramientas de calidad de código y mejores prácticas:
fr: Pour une configuration de développement détaillée, incluant des outils de qualité de code et les meilleures pratiques :
pt: Para uma configuração detalhada de desenvolvimento, incluindo ferramentas de qualidade de código e melhores práticas:

source: Node.js Version Management
es: Gestión de versiones Node.js
fr: Gestion des versions de Node.js
pt: Gerenciamento de versões do Node.js

source: AMRnet uses Node.js v18.20.4. If you use nvm (Node Version Manager):
es: AMRnet utiliza Node.js v18.20.4. Si utiliza nvm (Node Version Manager):
fr: AMRnet utilise Node.js v18.20.4. Si vous utilisez nvm (Node Version Manager):
pt: O AMRnet usa o Node.js v18.20.4. Se você usar nvm (Gerenciador de Versão do Não):

source: Python Dependencies
es: Dependencias de Python
fr: Dépendances Python
pt: Dependências do Python

source: For data processing components and documentation building:
es: Para componentes de procesamiento de datos y construcción de documentación:
fr: Pour le traitement des données des composants et la construction de la documentation:
pt: Para componentes de processamento de dados e construção de documentação:

source: Environment Variables
es: Variables de entorno
fr: Variables d'environnement
pt: Variáveis de Ambiente

source: Configure your ``.env`` file with the following variables:
es: Configura tu archivo ``.env`` con las siguientes variables:
fr: Configurez votre fichier ``.env`` avec les variables suivantes :
pt: Configure o seu arquivo ``.env`` com as seguintes variáveis:

source: Production Build
es: Construcción de Producción
fr: Construction de Production
pt: Compilação de Produção

source: To build AMRnet for production deployment:
es: Para construir AMRnet para despliegue de producción:
fr: Pour construire AMRnet pour le déploiement en production :
pt: Para construir o AMRnet para o deploy de produção:

source: The built application will be served from the ``client/build`` directory.
es: La aplicación construida se servirá desde el directorio ``client/build``.
fr: L'application compilée sera servie depuis le répertoire ``client/build``.
pt: A aplicação construída será servida do diretório ``client/build``.

source: Docker Installation
es: Instalación de Docker
fr: Installation de Docker
pt: Instalação do Docker

source: AMRnet can also be run using Docker:
es: AMRnet también puede ejecutarse usando Docker:
fr: AMRnet peut également être exécuté en utilisant Docker:
pt: O AMRnet também pode ser executado usando o Docker:

source: Make sure to replace ``your_mongodb_uri`` with your actual MongoDB connection string.
es: Asegúrese de reemplazar ``your_mongodb_uri`` con su cadena de conexión MongoDB.
fr: Assurez-vous de remplacer ``your_mongodb_uri`` par votre vraie chaîne de connexion MongoDB.
pt: Certifique-se de substituir ``your_mongodb_uri`` pela string de conexão atual do MongoDB.

source: **Common Installation Issues:**
es: **Problemas comunes de instalación:**
fr: **Problèmes d'installation courants:**
pt: **Problemas de instalação comuns:**

source: **Node version mismatch**: Use ``nvm use`` to switch to the correct version
es: **No coincide la versión del nodo**: Usa ``nvm use`` para cambiar a la versión correcta
fr: **Différence de version de Node**: Utilisez ``nvm use`` pour basculer vers la version correcte
pt: **Node version inmatch**: Use ``nvm use`` para alternar para a versão correta

source: **Package conflicts**: Delete ``node_modules`` and run ``npm install`` again
es: **Conflictos de paquete**: Elimina ``node_modules`` y ejecuta ``npm install`` de nuevo
fr: **Conflit de paquets** : Supprimez ``node_modules`` et lancez à nouveau ``npm install``
pt: **Conflito de pacote**: Exclua ``node_modules`` e execute ``npm install`` novamente

source: **Port conflicts**: Make sure ports 3000 and 8080 are available
es: **Conflictos portuarios**: Asegúrate de que los puertos 3000 y 8080 estén disponibles
fr: **Conflit de ports** : Assurez-vous que les ports 3000 et 8080 sont disponibles
pt: **Conflitos da porta**: Certifique-se de que as portas 3000 e 8080 estejam disponíveis

source: **MongoDB connection**: Verify your MongoDB service is running or Atlas credentials are correct
es: **Conexión MongoDB**: Verifique que su servicio MongoDB se está ejecutando o que las credenciales de Atlas son correctas
fr: **Connexion MongoDB** : Vérifiez que votre service MongoDB est en cours d'exécution ou que les informations d'identification de l'Atlas sont correctes
pt: **Conexão do MongoDB**: Verifique se seu serviço do MongoDB está sendo executado ou se as credenciais do Atlas estão corretas

source: **Getting Help:**
es: **Obteniendo ayuda:**
fr: **Obtenir de l'aide:**
pt: **Obter Ajuda:**

source: Check the `Issue Tracker <https://github.com/amrnet/amrnet/issues>`_
es: Consulta el `rastreador de incidencias <https://github.com/amrnet/amrnet/issues>`_
fr: Vérifiez le `Ticket Tracker <https://github.com/amrnet/amrnet/issues>`_
pt: Verifique o `Rastreador de Issues <https://github.com/amrnet/amrnet/issues>`_

source: Review the `Development Guide <../tutorial/development.md>`_
es: Revisa la `Guía de Desarrollo <../tutorial/development.md>`_
fr: Consultez le `Guide de Développement <../tutorial/development.md>`_
pt: Analise o `Guia de Desenvolvimento <../tutorial/development.md>`_

source: Join our `Discussions <https://github.com/amrnet/amrnet/discussions>`_
es: Únete a nuestros `Discusiones <https://github.com/amrnet/amrnet/discussions>`_
fr: Rejoignez nos `Discussions <https://github.com/amrnet/amrnet/discussions>`_
pt: Junte-se às nossas `Discussões <https://github.com/amrnet/amrnet/discussions>`_
