Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/kpneumo.po
Languages: es, fr, pt

source: *Klebsiella pneumoniae* data are sourced from `Pathogenwatch <https://doi.org/10.1093/cid/ciab784>`__, which calls AMR (using `Kleborate <https://github.com/klebgenomics/Kleborate>`_) and genotypes (`MLST <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`__) from genomes assembled from public data. Last update: 5 August 2025.
es: Los datos de *Klebsiella pneumoniae* se obtienen de `Pathogenwatch <https://doi.org/10.1093/cid/ciab784>`__, que llama AMR (usando `Kleborate <https://github.com/klebgenomics/Kleborate>`_) y genotipos (`MLST <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`__) de genomas ensamblados de datos públicos. Última actualización: 5 de agosto de 2025.
fr: Les données de *Klebsiella pneumoniae* proviennent de `Pathogenwatch <https://doi.org/10.1093/cid/ciab784>`__, qui appelle AMR (à l'aide de `Kleborate <https://github.com/klebgenomics/Kleborate>`_) et génotypes (`MLST <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`__) à partir de génomes assemblés à partir de données publiques. Dernière mise à jour : 5 août 2025.
pt: Os dados *Klebsiella pneumoniae* são originados de `Pathogenwatch <https://doi.org/10.1093/cid/ciab784>`__, que chama AMR (usando `Kleborate <https://github.com/klebgenomics/Kleborate>`_) e genótipos (`MLST <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`__) de genomes montados de dados públicos. Última atualização: 5 de Agosto de 2025.

source: The *Klebsiella pneumoniae* data used in AMRnet are not yet curated for purpose-of-sampling, and therefore reflect the biases of global sequencing efforts which have been largely directed at sequencing ESBL and carbapenemase-producing strains or hypervirulent strains. Data curation efforts are ongoing however until then, please be careful when interpreting the data in the dashboard.
es: Los datos *Klebsiella pneumoniae* utilizados en AMRnet aún no están supervisados para el propósito de muestreo, y, por lo tanto, reflejan los sesgos de los esfuerzos de secuenciación global que se han dirigido en gran medida a secuenciar cepas ESBL y carbonapenemase-productivas o cadenas hipervirulentas. Los esfuerzos de curación de datos están en curso sin embargo hasta entonces, por favor tenga cuidado al interpretar los datos en el panel.
fr: Les données *Klebsiella pneumoniae* utilisées dans AMRnet ne sont pas encore conservées à des fins d'échantillonnage, et donc reflètent les préjugés des efforts de séquençage global qui ont été largement orientés vers le séquençage des souches ESBL et des souches hypervirulentes. Les efforts de conservation des données sont cependant en cours jusqu'à ce moment-là, soyez prudent lorsque vous interprétez les données dans le tableau de bord.
pt: O *Klebsiella pneumoniae* utilizado na AMRnet ainda não é curado para o propósito de amostragem, e, por conseguinte, reflectem as preconceitos dos esforços globais de sequenciamento que têm sido dirigidos, em grande medida, à sequenciamento da ESBL e da produção de carbono, ou estirpes hipervirulentas. No entanto, os esforços de curadoria de dados estão em curso até lá, por favor, tenha cuidado ao interpretar os dados no painel.

source: Variable definitions
es: Definiciones variables
fr: Définitions de variables
pt: Definições de variáveis

source: **Genotypes**
es: **Genotipos**
fr: **Génotypes**
pt: **Genotipos**

source: ST: sequence type, defined by the `7-locus MLST scheme <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`_ for *Klebsiella pneumoniae* species complex
es: ST: tipo de secuencia, definido por el `7-locus MLST esquema <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`_ para el complejo de especies *Klebsiella pneumoniae*
fr: ST: type de séquence, défini par le `7 locus MLST scheme <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`_ pour le complexe d'espèces *Klebsiella pneumoniae*
pt: ST: tipo de sequência, definido pelo esquema MLST do `7-locus <https://doi.org/10.1128/jcm.43.8.4178-4182.2005>`_ para o complexo da espécie *Klebsiella pneumoniae*

source: cgST: core genome sequence type, defined by the `core genome MLST scheme <https://doi.org/10.3201/eid2011.140206>`_, maintained by `Institut Pasteur <https://bigsdb.pasteur.fr/klebsiella/>`_
es: cgST: tipo de secuencia del genoma central, definido por el `esquema MLST del genoma núcleo <https://doi.org/10.3201/eid2011.140206>`_, mantenido por `Institut Pasteur <https://bigsdb.pasteur.fr/klebsiella/>`_
fr: cgST: type de séquence de génome core, défini par le `core genome MLST scheme <https://doi.org/10.3201/eid2011.140206>`_, maintenu par `Institut Pasteur <https://bigsdb.pasteur.fr/klebsiella/>`_
pt: cgST: tipo de sequência de genoma fundamental, definido pelo `esquema MLST core <https://doi.org/10.3201/eid2011.140206>`_, mantido por `Institut Pasteur <https://bigsdb.pasteur.fr/klebsiella/>`_

source: Sublineage: defined from core-genome MLST, as described `here <https://doi.org/10.1093/molbev/msac135>`_
es: Sublina: definido por MLST del genoma coral, como se describe `aquí <https://doi.org/10.1093/molbev/msac135>`_
fr: Sous-ligne : définie à partir du code MLST, tel que décrit `ici <https://doi.org/10.1093/molbev/msac135>`_
pt: Sublinhagem: definida de MLST, do core-genoma, como descrito `aqui <https://doi.org/10.1093/molbev/msac135>`_

source: **AMR determinants** are called using `Kleborate v3 <https://github.com/klebgenomics/Kleborate>`_, described `here <https://doi.org/10.1038/s41467-021-24448-3>`__. Ciprofloxacin resistance is defined based on the prediction generated by Kleborate. For all other drugs, resistance is defined by the presence of one or more markers in the corresponding Kleborate output column.
es: **determinantes AMR** son llamados usando `Kleborate v3 <https://github.com/klebgenomics/Kleborate>`_, descrito `aquí <https://doi.org/10.1038/s41467-021-24448-3>`__. La resistencia a Ciprofloxacin se define basándose en la predicción generada por Kleborate. Para todos los demás medicamentos, la resistencia se define por la presencia de uno o más marcadores en la columna de salida Kleborate correspondiente.
fr: Les **déterminants AMR** sont appelés en utilisant `Kleborate v3 <https://github.com/klebgenomics/Kleborate>`_, décrit `ici <https://doi.org/10.1038/s41467-021-24448-3>`__. La résistance à la Ciprofloxacine est définie sur la base de la prédiction générée par Kleborate. Pour tous les autres médicaments, la résistance est définie par la présence d'un ou de plusieurs marqueurs dans la colonne de sortie Kleborate correspondante.
pt: **determinantes AMR** são chamados usando `Kleborate v3 <https://github.com/klebgenomics/Kleborate>`_, descrito `here <https://doi.org/10.1038/s41467-021-24448-3>`__. Resistência de Ciprofloxacio é definida com base na previsão gerada por Kleborate. Para todas as outras drogas, a resistência é definida pela presença de um ou mais marcadores na coluna de saída de Kleborate correspondente.

source: **Pansusceptible**: no resistance determinants identified besides a wildtype beta-lactamase SHV allele associated with intrinsic resistance to ampicillin (i.e. not an ESBL or inhibitor-resistant variant of SHV, see `Tsang et al 2024 <https://www.microbiologyresearch.org/content/journal/mgen/10.1099/mgen.0.001294>`_.
es: **Pansusceptible**: no hay determinantes de resistencia identificados además de un alelo SHV beta-lactamasa de tipo salvaje asociado con resistencia intrínseca a la ampicilina (i. . no es una variante ESBL o resistente a los inhibidores de SHV, vea `Tsang et al 2024 <https://www.microbiologyresearch.org/content/journal/mgen/10.1099/mgen.0.001294>`_.
fr: **Pansusceptible** : aucun déterminants de résistance identifiés à part un allèle de type bêta-lactamase SHV associé à une résistance intrinsèque à l'ampicilline (i. . - pas une variante ESBL ou résistante aux inhibiteurs de SHV, voir `Tsang et al 2024 <https://www.microbiologyresearch.org/content/journal/mgen/10.1099/mgen.0.001294>`_.
pt: **Pansuscetível**: nenhum determinante de resistência identificado além de um alelo beta-lactamase SHV associado à resistência intrínseca à ampicilina (i. . não é uma variante inflexível ou resistente ao poder de SHV, veja `Tsang et al 2024 <https://www.microbiologyresearch.org/content/journal/mgen/10.1099/mgen.0.001294>`_.

source: Abbreviations
es: Abreviaturas
fr: Abréviations
pt: Abreviações

source: **ESBL**: extended-spectrum beta-lactamase
es: **ESBL**: beta-lactamasa de espectro extendido
fr: **ESBL** : bêta-lactamase à spectre étendu
pt: **ESBL**: beta-lactamase do espectro extendido

source: **ST**: sequence type
es: **ST**: tipo de secuencia
fr: **ST** : type de séquence
pt: **ST**: tipo de sequência

source: **cgST**: core-genome sequence type
es: **cgST**: tipo de secuencia de core-genoma
fr: **cgST** : type de séquence core-génome
pt: **cgST**: tipo de sequência de núcleo-genoma
