Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/pathogen.po
Languages: pt

source: Escherichia coli
pt: Esclerichia coli

source: Escherichia coli diarrheagenic
pt: Diarreia entre cores

source: Salmonella (non-typhoidal)
pt: Salmonela (não tufão)

source: Salmonella (invasive non-typhoidal)
pt: Salmonela (invasiva não-tufão)

source: Individual pathogen details
pt: Detalhes individuais do agente patogênico

source: Each dashboard is populated a bit differently, from different sources and with different inclusion criteria, using AMR genotyping and lineage definitions specific to the pathogen.
pt: Cada painel é preenchido de forma um pouco diferente, de diferentes fontes e com diferentes critérios de inclusão, usando as definições de genótipo AMR e de linhagem específica ao agente patogênico.

source: Select a pathogen below to see the details:
pt: Selecione um agente patogênico abaixo para ver os detalhes:

source: *Escherichia coli*
pt: *Esclerichia coli*

source: *Escherichia coli* (diarrheagenic)
pt: *Isquihia coli* (diarreia)

source: *Salmonella* (invasive non-typhoidal)
pt: *Salmonela* (invasivo não-typhoidal)

source: A list of all upstream databases and tools, with links and citations, is available on the :ref:`Source data & tools <source>` page.
pt: Uma lista de todos os bancos de dados e ferramentas a montante, com links e citações, está disponível na página 'Fonte de dados & ferramentas <source>do :ref:'.

source: AMR definitions based on Enterobase/AMRfinderplus data
pt: Definições AMR baseadas em dados Enterobase/AMRfinderplus

source: These definitions are used in the *E. coli*, *Shigella*, and non-typhoidal *Salmonella* dashboards, where data are populated from `Enterobase <https://enterobase.warwick.ac.uk/>`_ which uses `AMRfinderplus <https://www.ncbi.nlm.nih.gov/pathogens/antimicrobial-resistance/AMRFinder/>`_ to identify AMR determinants from genome assemblies. For other organisms, populated from Pathogenwatch, see the pathogen-specific pages above for details of how AMR is detected/defined.
pt: Essas definições são usadas no *E. coli*, *Shigella*, e painéis não-typhoidal *Salmonella*, onde os dados são preenchidos de `Enterobase <https://enterobase.warwick.ac.uk/>`_ que usa `AMRfinderplus <https://www.ncbi.nlm.nih.gov/pathogens/antimicrobial-resistance/AMRFinder/>`_ para identificar determinantes da AMR de montagens de genoma. Para outros organismos, populados por Pathogenwatch, veja as páginas específicas de agentes patogênicos acima para detalhes de como a AMR é detectada/definida.

source: Resistance indicator variable
pt: Indicador de resistência

source: Definition
pt: Definição

source: Enterobase column/s
pt: Enterobase coluna/s

source: Drawn from AMRFinderPlus Class/Subclass
pt: Desenhado da Classe AMRFinderPlus/Subclasse

source: ≥1 marker from any column
pt: ≥ 1 marcador de qualquer coluna

source: Penicillin, Carbapenemase, ESBL
pt: Penicillin, Carbapenemente, ESBL

source: Aminoglycosides
pt: Aminoglicosides

source: ≥1 marker
pt: ≥ 1 marcador

source: Aminoglycoside
pt: Aminoglicoside

source: Class: AMINOGLYCOSIDE
pt: Classe: AMINOGLYCOSIDE

source: Carbapenems
pt: CarbaplosInimigos

source: Carbapenemase
pt: Inimigo

source: Subclass: CARBAPENEM
pt: Subclasse: CARBAPENEM

source: Class: QUINOLONE
pt: Classe: QUINOLONE

source: Chloramphenicol
pt: Cloramenififíco

source: Class: PHENICOL
pt: Classe: PHENICOL

source: Colistin
pt: Colistinha

source: Class: COLISTIN
pt: Classe: COLISTIN

source: ESBL
pt: ESCÓRIA

source: ESBL, Carbapenemase
pt: ESBL, Carbapdo

source: mph(A) or acrB_R717
pt: mph(A) ou acrB_R717

source: Class: MACROLIDE
pt: Classe: MACROLIDE

source: Tetracycline
pt: Tetrícline

source: Class: TETRACYCLINE
pt: Classe: TETRACYCLINE

source: Tigecycline
pt: Tigre

source: Other Classes: Tigecycline
pt: Outras aulas: Tigecycline

source: Subclass: TIGECYCLINE
pt: Subclasse: TIGECYCLINE

source: Trimethoprim
pt: Trimetrô

source: Class: TRIMETHOPRIM
pt: Classe: TRIMETHOPRIM

source: Trimethoprim-Sulfamethoxazole
pt: Trimetioprim-Sulfamethoxazole

source: ≥1 marker from each column
pt: ≥ 1 marcador de cada coluna

source: Trimethoprim, Sulfonamide
pt: Trimetioprim, Sulfonamide

source: Pansusceptible
pt: Pansuscetível

source: 0 markers
pt: 0 marcadores

source: all AMR columns
pt: todas as colunas AMR
