Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/performance.po
Languages: es, fr, pt

source: Performance Optimization
es: Optimización de rendimiento
fr: Optimisation des performances
pt: Otimização de desempenho

source: AMRnet has been extensively optimized to handle large genomic surveillance datasets efficiently. This guide covers performance considerations, optimization strategies, and deployment best practices.
es: AMRnet ha sido ampliamente optimizada para manejar grandes conjuntos de datos de vigilancia genómica de manera eficiente. Esta guía cubre consideraciones de rendimiento, estrategias de optimización y mejores prácticas de implementación.
fr: AMRnet a été largement optimisé pour gérer efficacement les grands ensembles de données de surveillance génomique, couvrant les considérations de performance, les stratégies d'optimisation et les meilleures pratiques de déploiement.
pt: AMRnet foi extensivamente otimizado para lidar com grandes conjuntos de dados de vigilância genómica de forma eficiente. Este guia abrange considerações de desempenho, estratégias de otimização e melhores práticas de implantação.

source: Architecture Overview
es: Resumen de Arquete
fr: Aperçu de l'architecture
pt: Visão Geral da Arquitetura

source: AMRnet's performance optimizations span the entire application stack:
es: Las optimizaciones de rendimiento de AMRnet abarcan toda la pila de aplicaciones:
fr: Les optimisations de performances d'AMRnet couvrent toute la pile d'application :
pt: As otimizações de desempenho da AMRnet abrangem toda a pilha de aplicativos:

source: **Frontend Optimizations:**
es: **Optimizaciones de Frontend:**
fr: **Optimisations du frontend :**
pt: **Otimização de Frontend:**

source: **Lazy Loading**: Components and data loaded on-demand
es: **Carga perezosa**: Componentes y datos cargados bajo demanda
fr: **Chargement à la légère** : Composants et données chargés à la demande
pt: **Carregamento Lazy**: Componentes e dados carregados sob demanda

source: **Virtual Scrolling**: Efficient rendering of large datasets
es: **Desplazamiento Virtual**: Eficiente renderizado de grandes conjuntos de datos
fr: **Défilement Virtuel** : Rendu efficace des grands ensembles de données
pt: **Pergaminho Virtual**: Renderização eficiente de grandes conjuntos de dados

source: **Intelligent Caching**: Browser-based storage for frequently accessed data
es: **Caché Inteligente**: Almacenamiento basado en navegadores para datos de acceso frecuente
fr: **Mise en cache intelligente** : Stockage basé sur le navigateur pour les données fréquemment consultées
pt: **Caching inteligente**: armazenamento baseado em navegador para dados acessados com frequência

source: **Compression**: Gzipped responses reduce transfer by up to 96%
es: **Compresión**: Las respuestas comprimidas reducen la transferencia hasta en 96%
fr: **Compression** : Les réponses compressées réduisent le transfert jusqu'à 96%
pt: **Compressão**: Respostas compactadas reduzem a transferência em até 96%

source: **Progressive Loading**: Priority-based data fetching
es: **Carga Progresiva**: Recuperación de datos basada en prioridad
fr: **Charge progressive** : Récupération des données par priorité
pt: **Carregamento progressivo**: Recuperando dados baseados em prioridade

source: **Backend Optimizations:**
es: **Optimizaciones de backend:**
fr: **Optimisations Backend :**
pt: **Otimizações do Backend:**

source: **Database Indexing**: Optimized MongoDB indexes for common queries
es: **Índice de base de datos**: Índice MongoDB optimizado para consultas comunes
fr: **Indexation de la base de données** : Optimisation des index MongoDB pour les requêtes courantes
pt: **Índice de banco de dados**: Índices MongoDB otimizados para consultas comuns

source: **Aggregation Pipelines**: Server-side data processing
es: **Pipelines de agregación**: Procesamiento de datos del lado del servidor
fr: **Pipelines d'agrégation** : Traitement des données côté serveur
pt: **Agregation Pipelines**: Processamento de dados do lado servidor

source: **Connection Pooling**: Efficient database connection management
es: **Conexión de Conexión**: Gestión eficiente de conexión a la base de datos
fr: **Regroupement de connexions** : Gestion efficace des connexions à la base de données
pt: **Conexão com Conexão**: Gerenciamento eficiente da conexão com a base de dados

source: **Field Projection**: Transfer only necessary data fields
es: **Proyección de campo**: Transfiere sólo campos de datos necesarios
fr: **Projection de champ**: Transférer uniquement les champs de données nécessaires
pt: **Projeto do campo**: Transferir apenas os campos de dados necessários

source: **Parallel Processing**: Concurrent data processing for multiple requests
es: **Procesamiento paralelo**: Procesamiento de datos simultáneo para múltiples peticiones
fr: **Traitement parallèle** : Traitement simultané des données pour plusieurs requêtes
pt: **Processamento Paralelo**: Processamento de dados simultâneos para várias solicitações

source: Load Time Improvements
es: Cargar mejoras de tiempo
fr: Charger des améliorations de temps
pt: Melhorias no Tempo de Carga

source: Recent optimizations have dramatically improved load times across all organisms:
es: Las optimizaciones recientes han mejorado considerablemente los tiempos de carga en todos los organismos:
fr: Les optimisations récentes ont considérablement amélioré les temps de chargement pour tous les organismes:
pt: Otimizações recentes melhoraram drasticamente o tempo de carregamento de todos os organismos:

source: **Performance Benchmarks:**
es: **Marcas de Rendimiento:**
fr: **Benchmarks de performance :**
pt: **Marcadores de desempenho:**

source: Organism
es: Organismo
fr: Organisme
pt: Organismo

source: Before (seconds)
es: Antes (segundos)
fr: Avant (secondes)
pt: Antes (segundos)

source: After (seconds)
es: Después de (segundos)
fr: Après (secondes)
pt: Após (segundos)

source: Improvement
es: Mejora
fr: Amélioration
pt: Melhoria

source: 81% faster
es: 81% más rápido
fr: 81 % plus rapide
pt: 81% mais rápido

source: 7s (13MB)
fr: 7 s (13Mo)

source: 70% faster
es: 70% más rápido
fr: 70% plus rapide
pt: 70% mais rápido

source: coli (diarrheagenic)
es: coli (diarreicente)
fr: coli (diarrhée)
pt: coli (diarreia)

source: 2s (4MB)
fr: 2s (4Mo)

source: 87% faster
es: 87% más rápido
fr: 87% plus rapide
pt: 87% mais rápido

source: **Optimization Strategies:**
es: **Estrategias de optimización:**
fr: **Stratégies d'optimisation :**
pt: **Estratégias de otimização:**

source: **Optimized Endpoints**: ``/api/optimized/*`` routes with minimal payloads
es: **Puntos finales optimizados**: rutas ``/api/optimizado/*`` con cargas mínimas
fr: **Endpoints optimisés** : routes ``/api/optimized/*`` avec une charge minimale
pt: **Fim otimizado**: rotas ``/api/optimized/*`` com mínimo de carga

source: **Pagination**: Large datasets split into manageable chunks
es: **Paginación**: Grandes conjuntos de datos divididos en pedazos manejables
fr: **Pagination** : grands ensembles de données divisés en chunks gérables
pt: **Paginação**: Grandes conjuntos de dados divididos em partes gerenciáveis

source: **Parallel Loading**: Multiple chart sections loaded simultaneously
es: **Carga paralela**: Múltiples secciones de gráficos cargadas simultáneamente
fr: **Chargement parallèle** : plusieurs sections de cartes chargées simultanément
pt: **Carregamento paralelo**: Várias seções de cartas carregadas simultaneamente

source: **Smart Caching**: Frequently accessed data cached locally
es: **Caché Inteligente**: Caché de datos de acceso frecuente localmente
fr: **Smart Caching** : Données fréquemment consultées en cache localement
pt: **Caching inteligente**: Dados acessados frequentemente em cache localmente

source: Database Optimization
es: Optimización de la base de datos
fr: Optimisation de la base de données
pt: Otimização de banco de dados

source: MongoDB performance optimizations ensure fast query responses:
es: Las optimizaciones de rendimiento de MongoDB aseguran respuestas rápidas de consultas:
fr: Les optimisations de performance de MongoDB garantissent des réponses rapides aux requêtes :
pt: Otimizações de desempenho do MongoDB garantem respostas de consulta rápidas:

source: **Indexing Strategy:**
es: **Estrategia de indexación:**
fr: **Stratégie d'indexation :**
pt: **Estratégia de Indexação:**

source: **Aggregation Pipelines:**
es: **Pipelines de agregación:**
fr: **Pipelines d'agrégation :**
pt: **Pipelines de Agregação:**

source: **Connection Optimization:**
es: **Optimización de la conexión:**
fr: **Optimisation de la connexion :**
pt: **Otimização de conexão:**

source: Frontend Performance
es: Rendimiento del Frontend
fr: Performance du frontend
pt: Desempenho Frontend

source: React application optimizations for smooth user experience:
es: Optimizaciones de la aplicación React para una experiencia de usuario suave:
fr: Optimisations d'application React pour une expérience utilisateur fluide:
pt: Otimizações de aplicativos React para uma experiência de usuário suave:

source: **Component Optimization:**
es: **Optimización del componente:**
fr: **Optimisation des composants :**
pt: **Otimização de Componente:**

source: **Data Loading Optimization:**
es: **Optimización de carga de datos:**
fr: **Optimisation du chargement des données :**
pt: **Otimização de carregamento de dados:**

source: **Virtual Scrolling for Large Lists:**
es: **Desplazamiento virtual para listas grandes:**
fr: **Défilement virtuel pour les grandes listes :**
pt: **Rolagem Virtual para Listas Grandes:**

source: Deployment Optimization
es: Optimización de despliegue
fr: Optimisation du déploiement
pt: Otimização de implantação

source: Production deployment configurations for optimal performance:
es: Configuración de despliegue de producción para un rendimiento óptimo:
fr: Configurations de déploiement de production pour des performances optimales :
pt: Configurações de implantação de produção para um melhor desempenho:

source: **Heroku Configuration:**
es: **Configuración de Heroku:**
fr: **Configuration Heroku :**
pt: **Configuração do Heroku:**

source: **CDN Integration:**
es: **Integración CDN:**
fr: **Intégration CDN :**
pt: **Integração de CDN:**

source: **Monitoring and Alerting:**
es: **Monitoreo y Alerta:**
fr: **Surveillance et Alerte :**
pt: **Monitoramento e Alerta:**

source: Caching Strategies
es: Estrategias de caché
fr: Stratégies de mise en cache
pt: Estratégias de cache

source: Multi-level caching for optimal performance:
es: Caché de múltiples niveles para un rendimiento óptimo:
fr: Mise en cache à plusieurs niveaux pour des performances optimales:
pt: Cache de vários níveis para um desempenho ideal:

source: **Browser Caching:**
es: **Caché del navegador:**
fr: **Mise en cache du navigateur:**
pt: **Navegador Caching:**

source: **Redis Caching (Optional):**
es: **Caché de Redis (opcional):**
fr: **Mise en cache Redis (facultatif) :**
pt: **Cache Redis (Opcional) :**

source: Performance Monitoring
es: Monitoreo de Rendimiento
fr: Surveillance des performances
pt: Monitoramento do Desempenho

source: Real-time performance tracking and optimization:
es: Seguimiento y optimización del rendimiento en tiempo real:
fr: Suivi et optimisation des performances en temps réel :
pt: Rastreamento de desempenho em tempo real e otimização:

source: **Server-Side Monitoring:**
es: **Monitoreo lateral del servidor:**
fr: **Surveillance côté serveur :**
pt: **Monitoramento do servidor:**

source: Best Practices
es: Mejores prácticas
fr: Meilleures pratiques
pt: Práticas recomendadas

source: **Development Best Practices:**
es: **Mejores prácticas de desarrollo:**
fr: **Meilleures pratiques de développement :**
pt: **Melhores Práticas de Desenvolvimento:**

source: **Measure First**: Use browser dev tools to identify bottlenecks
es: **Medida primero**: Usa las herramientas de desarrollo del navegador para identificar cuellos de botella
fr: **Mesure d'abord** : Utilisez les outils de développement du navigateur pour identifier les goulets d'étranglement
pt: **Medir primeiro**: usar ferramentas de desenvolvimento do navegador para identificar pontos de estrangulamento

source: **Optimize Queries**: Use database explain plans to optimize queries
es: **Optimizar las consultas**: Utilice la base de datos explicar planes para optimizar las consultas
fr: **Optimiser les requêtes** : Utilisez la base de données pour expliquer les plans d'optimisation des requêtes
pt: **Otimizar Missões**: Use o banco de dados para explicar planos para otimizar consultas

source: **Monitor Bundle Size**: Keep JavaScript bundles under 250KB
es: **Control del tamaño del paquete**: Mantén los paquetes JavaScript por debajo de 250KB
fr: **Taille du lot du moniteur** : Gardez les paquets JavaScript à moins de 250 Ko
pt: **Tamanho do Pacote de Monitor**: mantenha pacotes JavaScript abaixo de 250KB

source: **Image Optimization**: Use modern formats (WebP, AVIF) and responsive images
es: **Optimización de la imagen**: Utilice formatos modernos (WebP, AVIF) e imágenes receptivas
fr: **Optimisation de l'image** : Utilisez des formats modernes (WebP, AVIF) et des images réactives
pt: **Otimização de Imagem**: use formatos modernos (WebP, AVIF) e imagens responsivas

source: **Code Splitting**: Load only necessary code for each page
es: **Dividir código**: Cargar solo el código necesario para cada página
fr: **Répartition du code** : Charger uniquement le code nécessaire pour chaque page
pt: **Divisão de código**: carregue apenas o código necessário para cada página

source: **Production Best Practices:**
es: **Mejores prácticas de producción:**
fr: **Meilleures pratiques de production :**
pt: **Práticas de Melhor Produção:**

source: **Enable Compression**: Use gzip/brotli compression
es: **Habilitar compresión**: Usar compresión gzip/brotli
fr: **Activer Compression** : Utiliser la compression gzip/brotli
pt: **Habilitar Compressão**: Usar a compressão gzip/brotli

source: **CDN Usage**: Serve static assets from CDN
es: **Uso CDN**: Sirve activos estáticos de CDN
fr: **Utilisation du CDN** : Servir les assets statiques depuis CDN
pt: **Uso do CDN**: Serve arquivos estáticos do CDN

source: **Database Indexes**: Ensure proper indexing for all queries
es: **Índices de base de datos**: Asegurar una correcta indexación para todas las consultas
fr: **Index de la base de données** : Assurer une indexation correcte pour toutes les requêtes
pt: **Índice de banco de dados**: Garanta indexação adequada para todas as consultas

source: **Connection Pooling**: Optimize database connection pools
es: **Pooling de Conexiones**: Optimiza los conjuntos de conexiones de base de datos
fr: **Regroupement de connexions** : Optimiser les pools de connexion à la base de données
pt: **Pooling de conexão**: Otimizar bancos de dados

source: **Performance Monitoring**: Set up alerts for performance degradation
es: **Monitoreo de Rendimiento**: Configura alertas para la degradación del rendimiento
fr: **Surveillance des performances** : Configurez des alertes pour la dégradation des performances
pt: **Monitoramento de desempenho**: Configurar alertas para degradação de desempenho

source: Troubleshooting
es: Solución de problemas
fr: Dépannage
pt: Solução de problemas

source: **Common Performance Issues:**
es: **Problemas comunes de rendimiento:**
fr: **Problèmes communs de performance :**
pt: **Problemas comuns de desempenho:**

source: **Slow Page Loads**: Check network tab for large payloads
es: **Carga lenta de páginas**: Compruebe la pestaña de red para cargas grandes
fr: **Chargement lent des pages**: Vérifiez l'onglet réseau pour les grosses charges
pt: **Cargas lentas**: Verificar guia de rede para cargas grandes

source: **High Memory Usage**: Use Chrome DevTools Memory tab
es: **Uso de alta memoria**: Usa la pestaña de Memoria de Chrome DevTools
fr: **Utilisation mémoire élevée** : Utiliser l'onglet Mémoire DevTools Chrome
pt: **Alto uso de memória**: Usar aba de memória do Chrome DevTools

source: **Database Timeouts**: Review MongoDB slow query logs
es: **Tiempo de espera de base de datos**: Revise los registros de consultas lentos de MongoDB
fr: **Délai d'attente de la base de données** : Revoir les logs de requêtes lents de MongoDB
pt: **Database Timeouts**: Revisar logs de consultas lentos do MongoDB

source: **Cache Misses**: Verify cache configuration and TTL settings
es: **Fallo de caché**: Verifica la configuración del caché y los ajustes de TTL
fr: **Manque de cache** : Vérifiez la configuration du cache et les paramètres TTL
pt: **Missões de Cache**: Verificar configuração de cache e configurações de TTL

source: **Performance Testing:**
es: **Prueba de rendimiento:**
fr: **Test des performances :**
pt: **Teste de desempenho:**

source: **Monitoring Tools:**
es: **Herramientas de monitoreo:**
fr: **Outils de Surveillance :**
pt: **Ferramentas de Monitoramento:**

source: Browser DevTools (Performance tab)
es: DevTools del navegador (pestaña Rendimiento)
fr: DevTools du navigateur (onglet Performance)
pt: Navegador DevTools (guia de desempenho)

source: MongoDB Compass (Query performance)
es: Brújula MongoDB (Rendimiento de consulta)
fr: Boussole MongoDB (Requête de performance)
pt: Compass do MongoDB (desempenho de consulta)

source: Heroku metrics (if deployed on Heroku)
es: Métricas de Heroku (si están desplegadas en Heroku)
fr: Métriques Heroku (si déployées sur Heroku)
pt: Métricas do Heroku (se implantadas no Heroku)

source: Web Vitals extension
es: Extensión Web Vitals
fr: Extension Web Vitals
pt: Extensão Web Vitals

source: Lighthouse CI for automated testing
es: CI faro para pruebas automatizadas
fr: Lighthouse CI pour les tests automatisés
pt: IC Farol para testes automatizados
