Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/professional-translation-services.po
Languages: pt

source: Professional Translation Services
pt: Serviços de tradução profissional

source: This guide covers integration with professional translation platforms and medical translation services for AMRnet documentation and interface translations.
pt: Este guia abrange a integração com plataformas de tradução profissional e serviços de tradução médica para a documentação AMRnet e traduções da interface.

source: Overview
pt: Geral

source: AMRnet supports integration with professional translation services to ensure high-quality, medically accurate translations. This is especially important for antimicrobial resistance terminology and clinical interpretations.
pt: A AMRnet suporta a integração com serviços profissionais de tradução para garantir traduções de alta qualidade e com precisão médica. Isto é especialmente importante para terminologia de resistência antimicrobiana e interpretações clínicas.

source: Medical translation requires specialized expertise in microbiology, infectious diseases, and clinical laboratory terminology.
pt: Tradução médica requer especialização especializada em microbiologia, doenças infecciosas e terminologia laboratorial.

source: Supported Translation Platforms
pt: Plataformas de tradução suportadas

source: Weblate Integration
pt: Integração Weblate

source: **Weblate** is an open-source, web-based translation platform ideal for collaborative translation projects.
pt: **Weblate** é uma plataforma de tradução open-source, baseada na web, ideal para projetos de tradução colaborativa.

source: Setup Configuration
pt: Configuração de instalação

source: **Create Weblate Project**
pt: **Criar Projeto Weblate**

source: **Webhook Integration**
pt: **Webhook Integração**

source: **Medical Terminology Glossary**
pt: **Glossário de Terminologia Médica**

source: Crowdin Integration
pt: Integração Crowdin

source: **Crowdin** provides professional translation management with advanced workflows and quality assurance.
pt: **Crowdin** fornece gerenciamento de tradução profissional com fluxos de trabalho avançados e garantia de qualidade.

source: Project Setup
pt: Configuração do Projeto

source: Quality Assurance Configuration
pt: Configuração de garantia de qualidade

source: Automated Workflow Integration
pt: Integração de fluxo de trabalho automatizado

source: Lokalise Integration
pt: Lokalise Integração

source: **Lokalise** offers advanced automation and enterprise-grade translation management.
pt: **Lokalise** oferece uma automação avançada e gerenciamento de tradução de nível empresarial.

source: Configuration Setup
pt: Configuração de Configuração

source: Automated CI/CD Integration
pt: Integração de CI/CD automatizada

source: Medical Translation Services
pt: Serviços de tradução médica

source: Specialized Medical Translation
pt: Tradução Médica Especializada

source: For clinical and regulatory content, consider specialized medical translation services:
pt: Para conteúdo clínico e regulador, considere serviços de tradução médica especializados:

source: Terminology Management
pt: Gerenciamento de terminologia

source: Quality Assurance Workflows
pt: Workflows de Garantia de Qualidade

source: Automated Quality Checks
pt: Verificações Automatizadas de Qualidade

source: Integration Scripts
pt: Scripts de Integração

source: Unified Translation Pipeline
pt: Pipeline de Tradução Unificada

source: Monitoring and Reporting
pt: Monitoramento e Relatório

source: Translation Progress Dashboard
pt: Painel de Progresso da Tradução

source: Deployment Integration
pt: Integração de implantação

source: Read the Docs Configuration
pt: Ler a configuração da documentação

source: Best Practices
pt: Práticas recomendadas

source: Translation Workflow Guidelines
pt: Guia de workflow de tradução

source: **Source Content Preparation**
pt: **Preparação do Conteúdo Fonte**

source: Use clear, concise language
pt: Usar linguagem clara e concisa

source: Avoid idioms and colloquialisms
pt: Evite idiomas e colloquialismos

source: Include context for technical terms
pt: Incluir contexto para termos técnicos

source: Provide glossaries for medical terminology
pt: Fornecer glossários para terminologia médica

source: **Translation Quality Standards**
pt: **Padrões de qualidade de tradução**

source: Medical accuracy verification
pt: Verificação da precisão médica

source: Cultural appropriateness review
pt: Revisão cultural apropriada

source: Technical terminology consistency
pt: consistência de terminologia técnica

source: User interface coherence
pt: Inconsistência da interface

source: **Review Process**
pt: **Processo de revisão**

source: Initial translation by certified translators
pt: Tradução inicial por tradutores certificados

source: Medical review by subject matter experts
pt: Análise médica por especialistas em assuntos

source: Linguistic review for style and clarity
pt: Revisão linguística para estilo e clareza

source: Final approval by project stakeholders
pt: Aprovação final dos interessados do projeto

source: **Maintenance and Updates**
pt: **Manutenção e Atualizações**

source: Regular terminology database updates
pt: Atualizações regulares do banco de dados terminológico

source: Continuous quality monitoring
pt: Monitoramento de qualidade contínuo

source: User feedback integration
pt: Integração de feedback do usuário

source: Version control for translations
pt: Controle de versão para traduções

source: **Security Consideration**: Ensure all translation platforms comply with healthcare data privacy regulations (HIPAA, GDPR) when handling medical content.
pt: **Consideração de segurança**: certifique-se de que todas as plataformas de tradução estejam de acordo com os regulamentos sobre privacidade de dados de saúde (HIPAA, GDPR) ao lidar com conteúdo médico.

source: Conclusion
pt: Conclusão

source: Professional translation services integration ensures that AMRnet's critical antimicrobial resistance information is accurately communicated across language barriers. The combination of automated workflows and specialized medical translation expertise provides the quality assurance necessary for clinical decision-making tools.
pt: A integração de serviços profissionais de tradução garante que a informação crítica de resistência antimicrobiana da AMRnet seja devidamente comunicada através das barreiras linguísticas. A combinação de fluxos de trabalho automatizados com a especialização especializada em tradução médica fornece a garantia de qualidade necessária para ferramentas clínicas de tomada de decisão.

source: For implementation support, consult with medical translation specialists familiar with antimicrobial resistance terminology and clinical microbiology practices.
pt: Para suporte de implementação, consulte os especialistas de tradução médica familiarizados com a terminologia de resistência antimicrobiana e práticas de microbiologia clínica.
