Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/security.po
Languages: es, fr, pt

source: Security Guide
es: Guía de seguridad
fr: Guide de sécurité
pt: Guia de segurança

source: AMRnet implements comprehensive security measures to protect user data and ensure the integrity of antimicrobial resistance surveillance information. This guide covers security policies, best practices, and implementation details.
es: AMRnet implementa medidas de seguridad integrales para proteger los datos del usuario y asegurar la integridad de la información de vigilancia de resistencia antimicrobiana. Esta guía cubre políticas de seguridad, mejores prácticas y detalles de implementación.
fr: AMRnet met en œuvre des mesures de sécurité complètes pour protéger les données des utilisateurs et assurer l'intégrité des informations de surveillance de la résistance antimicrobienne. Ce guide couvre les politiques de sécurité, les meilleures pratiques et les détails de l'implémentation.
pt: A AMRnet implementa medidas de segurança abrangentes para proteger os dados dos usuários e garantir a integridade da informação de vigilância de resistência antimicrobiana. Este guia abrange políticas de segurança, melhores práticas e detalhes de implementação.

source: Security Policy
es: Política de seguridad
fr: Politique de sécurité
pt: Política de Segurança

source: AMRnet follows industry-standard security practices for web applications handling sensitive healthcare and research data.
es: AMRnet sigue las prácticas de seguridad estándar de la industria para aplicaciones web que manejan datos sensibles de salud e investigación.
fr: AMRnet suit les pratiques de sécurité standard de l'industrie pour les applications Web qui traitent les soins de santé sensibles et les données de recherche.
pt: A AMRnet segue práticas de segurança padrão da indústria para aplicações web que manipulam dados sensíveis de saúde e pesquisa.

source: Vulnerability Reporting
es: Reporte de vulnerabilidad
fr: Rapports de vulnérabilité
pt: Relatório de vulnerabilidades

source: **🚨 Responsible Disclosure Process**
es: **🚨 Proceso de divulgación responsable**
fr: **🚨 Processus de divulgation responsable**
pt: **🚨 Processo de Divulgação Responsável**

source: If you discover a security vulnerability, please follow these steps:
es: Si descubre una vulnerabilidad de seguridad, siga estos pasos:
fr: Si vous découvrez une vulnérabilité de sécurité, veuillez suivre ces étapes :
pt: Se você descobrir uma vulnerabilidade de segurança, por favor, siga estes passos:

source: **DO NOT** create a public GitHub issue
es: **NO** crear un problema público en GitHub
fr: **NE PAS créer** un ticket GitHub public
pt: **NÃO** crie uma issue pública no GitHub

source: **Email security report** to: amrnetdashboard@gmail.com
es: **Informe de seguridad por correo electrónico** a: amrnetdashboard@gmail.com
fr: **Rapport de sécurité par e-mail** à: amrnetdashboard@gmail.com
pt: **Relatório de segurança do e-mail** para: amrnetdashboard@gmail.com

source: **Include detailed information**: - Description of the vulnerability - Steps to reproduce the issue - Potential impact assessment - Suggested fixes (if available)
es: **Incluye información detallada**: - Descripción de la vulnerabilidad - Pasos para reproducir el problema - Evaluación de impacto Potential - Correcciones sugeridas (si está disponible)
fr: **Inclure des informations détaillées** : - Description de la vulnérabilité - Étapes pour reproduire le problème - Évaluation de l'impact potentiel - Corrections suggérées (si disponible)
pt: **Incluir informações detalhadas**: - Descrição da vulnerabilidade - Etapas para reproduzir o problema - Avaliação de impacto potencial - Correções sugeridas (se disponível)

source: **Response Timeline:**
es: **Respuesta cronológica:**
fr: **Ligne de réponse :**
pt: **Linha do tempo de resposta:**

source: **24 hours**: Initial acknowledgment
es: **24 horas**: Confirmación inicial
fr: **24 heures** : Reconnaissance initiale
pt: **24 horas**: Confirmação inicial

source: **72 hours**: Preliminary assessment and severity classification
es: **72 horas**: Evaluación preliminar y clasificación de gravedad
fr: **72 heures** : Évaluation préliminaire et classification de la gravité
pt: **72 horas**: Classificação preliminar de avaliação e gravidade

source: **7 days**: Detailed response with fix timeline
es: **7 días**: Respuesta detallada con línea de tiempo fija
fr: **7 jours**: Réponse détaillée avec fil fixe
pt: **7 dias**: resposta detalhada com correção da linha do tempo

source: **30 days**: Target resolution for critical vulnerabilities
es: **30 días**: Resolución objetivo de vulnerabilidades críticas
fr: **30 jours** : Résolution cible pour les vulnérabilités critiques
pt: **30 dias**: Resolução de alvos para vulnerabilidades críticas

source: Supported Versions
es: Versiones soportadas
fr: Versions prises en charge
pt: Versões suportadas

source: Security updates are provided for:
es: Se proporcionan actualizaciones de seguridad para:
fr: Des mises à jour de sécurité sont fournies pour :
pt: Atualizações de segurança fornecidas para:

source: Version Support
es: Soporte para versiones
fr: Support de la version
pt: Suporte à Versão

source: Version
es: Versión
pt: Versão

source: Supported
es: Soportado
fr: Supporté
pt: Suportado

source: 1.1.x
es: 1.x

source: ✅ Yes
es: ✅ Sí
fr: ✅ Oui
pt: ✅ Sim

source: Application Security
es: Seguridad de la aplicación
fr: Sécurité de l'application
pt: Segurança do Aplicativo

source: AMRnet implements multiple layers of security controls:
es: AMRnet implementa múltiples capas de controles de seguridad:
fr: AMRnet implémente plusieurs couches de contrôles de sécurité :
pt: O AMRnet implementa várias camadas de controles de segurança:

source: Environment Security
es: Seguridad del entorno
fr: Sécurité de l'environnement
pt: Segurança do Ambiente

source: **Environment Variable Protection:**
es: **Protección variable de entorno:**
fr: **Protection des variables d'environnement :**
pt: **Proteção de Variável de Ambiente:**

source: **Secure Configuration Example:**
es: **Ejemplo de Configuración Segura:**
fr: **Exemple de Configuration Sécurisée :**
pt: **Exemplo de configuração segura:**

source: Database Security
es: Seguridad de la base de datos
fr: Sécurité de la base de données
pt: Segurança da base

source: **MongoDB Security Configuration:**
es: **Configuración de seguridad de MongoDB:**
fr: **Configuration de sécurité MongoDB :**
pt: **Configuração de Segurança do MongoD:**

source: **Data Sanitization:**
es: **Sanitización de datos:**
fr: **Assainissement des données :**
pt: **Sanitização de Dados:**

source: API Security
es: Seguridad API
fr: Sécurité de l'API
pt: Segurança da API

source: **Authentication and Authorization:**
es: **Autenticación y Autorización:**
fr: **Authentification et Autorisation :**
pt: **Autenticação e Autorização:**

source: **CORS Configuration:**
es: **Configuración CORS:**
fr: **Configuration CORS :**
pt: **Configuração CORS:**

source: Frontend Security
es: Seguridad de Frontend
fr: Sécurité du frontend
pt: Segurança no Frontend

source: **Content Security Policy:**
es: **Política de seguridad del contenido:**
fr: **Politique de sécurité du contenu :**
pt: **Política de Segurança de Conteúdo:**

source: **XSS Prevention:**
es: **Prevención XSS:**
fr: **Prévention XSS :**
pt: **Prevenção XSS:**

source: Data Privacy
es: Privacidad de datos
fr: Confidentialité des données
pt: Privacidade de Dados

source: AMRnet implements privacy-by-design principles for handling surveillance data:
es: AMRnet implementa principios de privacidad por diseño para manejar datos de vigilancia:
fr: AMRnet met en œuvre les principes de confidentialité par conception pour le traitement des données de surveillance:
pt: A AMRnet implementa princípios de privacidade por design para lidar com dados de vigilância:

source: Data Classification
es: Clasificación de datos
fr: Classification des données
pt: Classificação de Dados

source: **Public Data:** - Aggregated surveillance statistics - Country-level prevalence data - Publicly available research datasets
es: **Datos públicos:** - Estadísticas de vigilancia agregadas - Datos de prevalencia a nivel del país - Conjuntos de datos de investigación disponibles públicamente
fr: **Données publiques:** - Statistiques de surveillance agrégées - Données de prévalence au niveau du pays - Jeux de données de recherche disponibles publiquement
pt: **Dados públicos:** - Estatísticas agregadas de vigilância - Dados de prevalência a nível do país - Dados de pesquisa disponíveis publicamente

source: **Restricted Data:** - Individual sample identifiers (when present) - Detailed geographic coordinates - Unpublished research data
es: **Datos restringidos:** - Identificadores individuales de muestra (cuando están presentes) - Coordenadas geográficas detalladas - Datos de investigación no publicados
fr: **Données restreintes:** - Identifiants individuels d'échantillons (lorsqu'ils sont présents) - Coordonnées géographiques détaillées - Données de recherche non publiées
pt: **Dados restritos:** - Amostra individual (quando presente) - Coordenadas geográficas detalhadas - Dados de pesquisa não publicados

source: **Prohibited Data:** - Personal health information (PHI) - Patient identifiers - Clinical details beyond resistance patterns
es: **Datos prohibidos:** - Información personal de salud (PHI) - Identificadores del paciente - Detalles clínicos más allá de los patrones de resistencia
fr: **Données interdites:** - Informations personnelles sur la santé (IPP) - Identifiants du patient - Détails cliniques au-delà des modèles de résistance
pt: **Dados proibidos:** - Informações pessoais de saúde (PHI) - Identificadores pacientes - Detalhes clínicos além dos padrões de resistência

source: Privacy Controls
es: Controles de privacidad
fr: Contrôles de confidentialité
pt: Controles de Privacidade

source: **Data Minimization:**
es: **Minimización de datos:**
fr: **Minimisation des données:**
pt: **Minimização de Dados:**

source: **Anonymization:**
es: **Anonimización:**
fr: **Anonymisation:**
pt: **Anonimização:**

source: Secure Development
es: Desarrollo seguro
fr: Développement sécurisé
pt: Desenvolvimento Seguro

source: Security practices for development and deployment:
es: Prácticas de seguridad para el desarrollo y la implementación:
fr: Pratiques de sécurité pour le développement et le déploiement :
pt: Práticas de segurança para o desenvolvimento e implantação:

source: Code Security
es: Código de seguridad
fr: Sécurité du code
pt: Segurança do Código

source: **Dependency Management:**
es: **Gestión de dependencias:**
fr: **Gestion des dépendances :**
pt: **Gerenciamento de Dependência:**

source: **Security Linting:**
es: **Linting de seguridad:**
fr: **Réduction de la sécurité:**
pt: **Ligação de segurança:**

source: Git Security
es: Seguridad Git
fr: Sécurité Git
pt: Segurança Git

source: **Secure Repository Practices:**
es: **Prácticas de repositorio seguras:**
fr: **Pratiques de sécurisation des dépôts :**
pt: **Práticas de Repositório Seguras:**

source: **Secrets Management:**
es: **Gestión secreta:**
fr: **Gestion des Secrets :**
pt: **Gerenciamento de Segredos:**

source: Deployment Security
es: Seguridad de despliegue
fr: Sécurité de déploiement
pt: Segurança de implantação

source: Security configurations for production deployment:
es: Configuraciones de seguridad para el despliegue de producción:
fr: Configurations de sécurité pour le déploiement de production :
pt: Configurações de segurança para a implantação da produção:

source: Server Security
es: Seguridad del servidor
fr: Sécurité du serveur
pt: Segurança do Servidor

source: **Security Headers:**
es: **Encabezados de seguridad:**
fr: **En-têtes de sécurité :**
pt: **Cabeçalhos de Segurança:**

source: Infrastructure Security
es: Seguridad de la infraestructura
fr: Sécurité des infrastructures
pt: Segurança de infraestrutura

source: **HTTPS Configuration:**
es: **Configuración HTTPS:**
fr: **Configuration HTTPS:**
pt: **Configuração HTTPS:**

source: Monitoring and Incident Response
es: Monitoreo y Respuesta de Incidentes
fr: Surveillance et réponse au ticket
pt: Resposta Monitorada e de Incidente

source: Continuous security monitoring and incident response procedures:
es: Seguimiento continuo de la seguridad y respuesta a incidentes:
fr: Surveillance continue de la sécurité et procédures de réponse aux incidents :
pt: Monitoramento contínuo de segurança e procedimentos de resposta ao incidente:

source: Security Monitoring
es: Monitoreo de seguridad
fr: Surveillance de sécurité
pt: Monitoramento de Segurança

source: **Logging and Alerting:**
es: **Registro y alerta:**
fr: **Journalisation et Alerte :**
pt: **Registro e Alerta:**

source: **Intrusion Detection:**
es: **Detección de intrusión:**
fr: **Détection d'intrusion :**
pt: **Detecção de Intrusão:**

source: Incident Response
es: Respuesta de incidente
fr: Réponse du Ticket
pt: Resposta do incidente

source: **Response Procedures:**
es: **Procedimientos de respuesta:**
fr: **Procédures de réponse:**
pt: **Procedimentos de Resposta:**

source: **Detection**: Automated monitoring alerts security team
es: **Detección**: El equipo de seguridad de las alertas de monitorización automática
fr: **Détection** : Equipe de sécurité des alertes automatisées de surveillance
pt: **Detecção**: Equipe de segurança de alertas automatizada

source: **Assessment**: Determine severity and scope of incident
es: **Evaluación**: Determina la gravedad y el alcance del incidente
fr: **Évaluation** : Déterminer la sévérité et la portée de l'incident
pt: **Avaliação**: Determine a gravidade e o âmbito do incidente

source: **Containment**: Isolate affected systems if necessary
es: **Contenencia**: Aislar los sistemas afectados si es necesario
fr: **Contenu** : Isoler les systèmes affectés si nécessaire
pt: **Contenção **: Isolar sistemas afetados, se necessário

source: **Investigation**: Analyze logs and determine root cause
es: **Investigación**: Analiza los registros y determina la causa raíz
fr: **Enquête** : Analyser les logs et déterminer la cause racine
pt: **Investigação**: Analise logs e determine a causa raiz

source: **Recovery**: Restore normal operations
es: **Recuperación**: Restaurar operaciones normales
fr: **Récupération** : Restaurer les opérations normales
pt: **Recuperação**: Restaurar operações normais

source: **Lessons Learned**: Update security measures based on findings
es: **Lecciones aprendidas**: Actualizar medidas de seguridad basadas en los hallazgos
fr: **Leçons apprises** : Mettre à jour les mesures de sécurité basées sur les conclusions
pt: **Lições aprendidas**: Atualize as medidas de segurança com base nas descobertas

source: Security Testing
es: Prueba de seguridad
fr: Test de sécurité
pt: Teste de Segurança

source: Regular security testing ensures ongoing protection:
es: Las pruebas de seguridad regulares garantizan protección continua:
fr: Des tests de sécurité réguliers garantissent une protection continue :
pt: Teste de segurança regular garante a proteção em andamento:

source: Automated Testing
es: Prueba automatizada
fr: Tests automatisés
pt: Teste Automatizado

source: **Security Test Suite:**
es: **Suite de prueba de seguridad:**
fr: **Suite de test de sécurité :**
pt: **Teste de Segurança Suite:**

source: Penetration Testing
es: Pruebas de penetración
fr: Tests de pénétration
pt: Teste de Penetração

source: **Regular Security Assessments:**
es: **Evaluaciones de seguridad regulares:**
fr: **Évaluations de sécurité régulières :**
pt: **Avaliação de segurança regular:**

source: Quarterly vulnerability scans
es: Análisis de vulnerabilidades trimestrales
fr: Analyses de vulnérabilité trimestrielles
pt: Varredura trimestral de vulnerabilidades

source: Annual penetration testing by third-party security firms
es: Pruebas anuales de penetración por empresas de seguridad de terceros
fr: Examen annuel de la pénétration par des sociétés de sécurité tierces
pt: Teste anual de penetração por empresas de segurança de terceiros

source: Continuous security monitoring
es: Seguimiento continuo de la seguridad
fr: Surveillance continue de la sécurité
pt: Monitoramento contínuo de segurança

source: Bug bounty program for responsible disclosure
es: Programa de recompensas de errores para divulgación responsable
fr: Programme de récompenses de bugs pour la divulgation responsable
pt: Programa de recompensa de bugs para divulgação responsável

source: Best Practices Checklist
es: Lista de mejores prácticas
fr: Liste de contrôle des meilleures pratiques
pt: Checklist das Melhores Práticas

source: **Development Security Checklist:**
es: **Lista de control de seguridad de desarrollo:**
fr: **Liste de contrôle de la sécurité du développement :**
pt: **Checklist de Segurança de Desenvolvimento:**

source: ✅ **Environment Security** - [ ] Never commit secrets to version control - [ ] Use secure environment variable management - [ ] Implement proper secret rotation
es: ✅ **Seguridad del entorno** - [ ] Nunca comprometer secretos al control de versiones - [ ] Usar gestión segura de variables de entorno - [ ] Implementar rotación secreta adecuada
fr: ✅ **Environment Security** - [ ] Ne jamais livrer de secrets au contrôle de version - [ ] Utiliser une gestion des variables d'environnement sécurisé - [ ] Implémenter une rotation secrète appropriée
pt: ✅ **Segurança do Ambiente** - [ ] Nunca commit segredos para controle de versão - [ ] Usar gerenciamento de variáveis de ambiente seguro - [ ] Implementação de rotação secreta adequada

source: ✅ **Application Security** - [ ] Input validation and sanitization - [ ] Output encoding to prevent XSS - [ ] SQL injection prevention - [ ] Authentication and authorization
es: ✅ **Seguridad de la aplicación** - [ ] Validación y saneamiento de la entrada - [ ] Codificación de salida para prevenir XSS - [ ] Prevención de inyección SQL - [ ] Autenticación y autorización
fr: ✅ **Sécurité de l'application** - [ ] Validation et assainissement de l'entrée - [ ] Encodage de sortie pour empêcher XSS - [ ] prévention d'injection SQL - [ ] Authentification et autorisation
pt: ✅ **Aplicação de Segurança** - [ ] Validação de entrada e sanitização - [ ] Codificação de saída para evitar XSS - [ ] Prevenção de injeção de SQL - [ ] Autenticação e autorização

source: ✅ **Infrastructure Security** - [ ] HTTPS enforcement - [ ] Security headers implementation - [ ] Regular dependency updates - [ ] Database access controls
es: ✅ **Seguridad en Infraestructura** - [ ] Implementación de HTTPS - [ ] Implementación de cabeceras de seguridad - [ ] Actualizaciones regulares de dependencias - [ ] Controles de acceso a base de datos
fr: ✅ **Infrastructure Security** - [ ] Application HTTPS - [ ] Implémentation d'en-têtes de sécurité - [ ] Mises à jour régulières des dépendances - [ ] Contrôles d'accès à la base de données
pt: ✅ **Segurança de Infraestrutura** - [ ] Execução de HTTPS - [ ] Implementação de cabeçalhos de segurança - [ ] Atualizações regulares de dependência - [ ] Controles de acesso da base de dados

source: ✅ **Monitoring and Response** - [ ] Security event logging - [ ] Intrusion detection systems - [ ] Incident response procedures - [ ] Regular security assessments
es: ✅ **Monitoreo y Respuesta** - [ ] Registro de eventos de seguridad - [ ] Sistemas de detección de intrusos - [ ] Procedimientos de respuesta a incidentes - [ ] Evaluaciones de seguridad regulares
fr: ✅ **Surveillance et réponse** - [ ] Journalisation d'événements de sécurité - [ ] Systèmes de détection d'intrusion - [ ] Procédures de réponse d'incident - [ ] Évaluations de sécurité régulières
pt: ✅ **Monitoramento e resposta** - [ ] Registro de eventos de segurança - [ ] Sistema de detecção de intrusão - [ ] Processos de resposta de incidente - [ ] Avaliações regulares de segurança

source: Contact Information
es: Información de contacto
fr: Coordonnées
pt: Informação do Contato

source: **Security Team Contact:**
es: **Contacto del equipo de seguridad:**
fr: **Contact de l'équipe de sécurité :**
pt: **Contato do Time de Segurança:**

source: **PGP Key**: Available upon request
es: **Clave PGP**: disponible bajo petición
fr: **Clé PGP** : Disponible sur demande
pt: **Chave PG**: Disponível mediante pedido

source: **Response Time**: 24 hours for initial acknowledgment
es: **Tiempo de respuesta**: 24 horas para reconocimiento inicial
fr: **Temps de réponse**: 24 heures pour la réception initiale
pt: **Tempo de resposta**: 24 horas para confirmação inicial

source: **For General Security Questions:**
es: **Para preguntas de seguridad general:**
fr: **Pour les questions de sécurité générale :**
pt: **Para perguntas gerais de segurança:**

source: **GitHub Discussions**: https://github.com/amrnet/amrnet/discussions
es: **Discusiones de GitHub**: https://github.com/amrnet/amrnet/discussions
fr: **Discussions GitHub**: https://github.com/amrnet/amrnet/discussions
pt: **Discussões no GitHub**: https://github.com/amrnet/amrnet/discussions

source: **Documentation**: https://amrnet.readthedocs.io
es: **Documentación**: https://amrnet.readthedocs.io
pt: **Documentação**: https://amrnet.readthedocs.io

source: ❌ No
fr: ❌ Non
pt: ❌ Não
