Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/source.po
Languages: fr, pt

source: Source data & tools
fr: Données et outils source
pt: Fontes de dados e ferramentas

source: Source Databases
fr: Bases de données sources
pt: Fontes de dados

source: Enterobase
fr: Entréobase
pt: Entregue

source: `EnteroBase in 2025: exploring the genomic epidemiology of bacterial pathogens, Dyer et al 2025 <https://doi.org/10.1093/nar/gkae902>`_
fr: `EnteroBase en 2025: exploration de l'épidémiologie génomique des agents pathogènes bactériens, Dyer et al 2025 <https://doi.org/10.1093/nar/gkae902>`_
pt: `EnteroBase em 2025: explorando a epidemiologia genómica de patogênicos bacterianos, Dyer e o 2025 <https://doi.org/10.1093/nar/gkae902>`_

source: Pathogenwatch
fr: Montre pathogène
pt: Agente

source: *Salmonella* Typhi: `A global resource for genomic predictions of antimicrobial resistance and surveillance of Salmonella Typhi at pathogenwatch, Argimón et al 2021 <https://doi.org/10.1038/s41467-021-23091-2>`_
fr: *Salmonella* Typhi: `Une ressource globale pour les prédictions génomiques de la résistance antimicrobienne et la surveillance de la Salmonella Typhi au montre pathogène, Argimón et al 2021 <https://doi.org/10.1038/s41467-021-23091-2>`_
pt: Tufo *Salmonela*: `Um recurso global para previsões genômicas de resistência antimicrobiana e vigilância da Salmonela Typhi no patogogêwatch, Argimo├n et al 2021 <https://doi.org/10.1038/s41467-021-23091-2>`_

source: *Neisseria gonorrhoeae*: `A community-driven resource for genomic epidemiology and antimicrobial resistance prediction of Neisseria gonorrhoeae at Pathogenwatch, Sánchez-Busó et al 2021 <https://doi.org/10.1186/s13073-021-00858-2>`_
fr: *Neisseria gonorrhoeae* : `Une ressource communautaire pour l'épidémiologie génomique et la prédiction de la résistance antimicrobienne de Neisseria gonorrhoeae à Pathogenwatch, Sánchez-Busó et al 2021 <https://doi.org/10.1186/s13073-021-00858-2>`_
pt: *Neisseria gonorrhoeae*: `Um recurso orientado pela comunidade para epidemiologia genómica e previsão de resistência antimicrobiana Neisseria gonorrhoeae em Pathogenwatch, Sa├nchez-Buso├et al 2021 <https://doi.org/10.1186/s13073-021-00858-2>`_

source: *Klebsiella pneumoniae*: `Rapid Genomic Characterization and Global Surveillance of Klebsiella Using Pathogenwatch, Argímon 2021 <https://doi.org/10.1093/cid/ciab784>`_
fr: *Klebsiella pneumoniae*: `Caractérisation génomique rapide et surveillance globale de Klebsiella à l'aide de Pathogenwatch, Argiómon 2021 <https://doi.org/10.1093/cid/ciab784>`_
pt: *Klebsiella pneumoniae*: `Rapid Genomic Characterization and Global Surveillance of Klebsiella Using Pathogenwatch, Argi├mon 2021 <https://doi.org/10.1093/cid/ciab784>`_

source: Typing tools
fr: Outils de saisie
pt: Ferramentas de digitação

source: AMRFinderPlus
fr: format@@0 AMRFinderPlus

source: Used for AMR typing in *E. coli/Shigella* and non-typhoidal *Salmonella* dashboards
fr: Utilisé pour taper AMR dans les tableaux de bord *E. coli/Shigella* et non-typhoïdes *Salmonella*
pt: Usado para a digitação AMR em *E. coli/Shigella* e painéis *Salmonela* não-typhoidal

source: AMRFinderPlus paper: `AMRFinderPlus and the Reference Gene Catalog facilitate examination of the genomic links among antimicrobial resistance, stress response, and virulence, Feldgarden 2021 <https://doi.org/10.1038/s41598-021-91456-0>`_
fr: Le papier AMRFinderPlus : `AMRFinderPlus et le catalogue de gènes de référence facilitent l'examen des liens génomiques entre la résistance antimicrobienne, la réponse au stress, et la virulence, Feldgarden 2021 <https://doi.org/10.1038/s41598-021-91456-0>`_
pt: Papel AMRFinderPlus: `AMRFinderPlus e o Catálogo de Genes de Referência facilitam o exame dos links genómicos entre resistência antimicrobiana, resposta de stress e virulência, Feldgarden 2021 <https://doi.org/10.1038/s41598-021-91456-0>`_

source: Integration of AMRFinderPlus in Enterobase: `EnteroBase in 2025: exploring the genomic epidemiology of bacterial pathogens, Dyer et al 2025 <https://doi.org/10.1093/nar/gkae902>`_
fr: Intégration de AMRFinderPlus dans Enterobase: `EnteroBase en 2025: exploration de l'épidémiologie génomique des agents pathogènes bactériens, Dyer et al 2025 <https://doi.org/10.1093/nar/gkae902>`_
pt: Integração do AMRFinderPlus na Enterobase: `EnteroBase em 2025: explorando a epidemiologia genómica de patogênicos bacterianos, Dyer e al 2025 <https://doi.org/10.1093/nar/gkae902>`_

source: *Escherichia coli* and *Shigella*
fr: *Escherichia coli* et *Shigella*
pt: *Esquihia coli* e *Shigella*

source: Genotype nomenclature
fr: Nomenclature du génotype
pt: Nnomenclatura genotal

source: Achtman 7-locus MLST scheme: Developed by `Enterobase <https://enterobase.readthedocs.io/en/latest/mlst/mlst-legacy-info-ecoli.html/>`_
fr: Schéma MLST Achtman 7-locus : Développé par `Enterobase <https://enterobase.readthedocs.io/en/latest/mlst/mlst-legacy-info-ecoli.html/>`_
pt: Achtman MLST esquema de 7-locus: desenvolvido por `Enterobase <https://enterobase.readthedocs.io/en/latest/mlst/mlst-legacy-info-ecoli.html/>`_

source: Core genome MLST scheme: `The EnteroBase user's guide, with case studies on Salmonella transmissions, Yersinia pestis phylogeny, and Escherichia core genomic diversity, Zhou et al 2020 <http://www.genome.org/cgi/doi/10.1101/gr.251678.119>`_
fr: Schéma MLST du génome de base : `Le guide de l'utilisateur EnteroBase, avec des études de cas sur les transmissions de Salmonella, Yersinia pestis phylogeny, et Escherichia cœur de la diversité génomique, Zhou et al 2020 <http://www.genome.org/cgi/doi/10.1101/gr.251678.119>`_
pt: Genoma do esquema MLST: `Guia do usuário EnteroBase, com estudos de caso nas transmissões Salmonella, Yersinia pestis fisiologia, e diversidade genómica de Escherichia, Zhou et al 2020 <http://www.genome.org/cgi/doi/10.1101/gr.251678.119>`_

source: Hierarchical clustering: `HierCC: a multi-level clustering scheme for population assignments based on core genome MLST, Zhou et al 2020 <https://doi.org/10.1093/bioinformatics/btab234>`_
fr: Amas hiérarchique : `HierCC: un système de grappe à plusieurs niveaux pour les affectations de population basé sur le génome central MLST, Zhou et al 2020 <https://doi.org/10.1093/bioinformatics/btab234>`_
pt: Agrupamento hierárquico: `HierCC: um esquema de agrupamento de vários níveis para missões da população com base no genoma principal MLST, Zhou e al 2020 <https://doi.org/10.1093/bioinformatics/btab234>`_

source: MLST database: `https://enterobase.warwick.ac.uk/species/index/ecoli/ <https://enterobase.warwick.ac.uk/species/index/ecoli/>`_
fr: Base de données MLST: `https://enterobase.warwick.ac.uk/species/index/ecoli/ <https://enterobase.warwick.ac.uk/species/index/ecoli/>`_
pt: Banco de dados MLST: `https://enterobase.warwick.ac.uk/species/index/ecoli/ <https://enterobase.warwick.ac.uk/species/index/ecoli/>`_

source: Pathotype definition
fr: Définition du Pathotype
pt: Definição de Pathotype

source: The diarrheagenic *E. coli* (DEC) pathotypes are defined using `Enterobase pathotyping logic <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`_
fr: Les pathotypes diarrhéagènes *E. coli* (DEC) sont définis en utilisant la `logique de pathotypage Entréobase <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`_
pt: O diarrheagenic *E. coli* (DEC) pathotypes are defined using `Enterobase pathotyping logic <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`_

source: *Shigella* species identification : `Hierarchical Clustering (HC) <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`_
fr: Identification des espèces *Shigella* : `Clustering Hiérarchique (HC) <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`_
pt: Identificação da espécie *Shigella* : `Hierárquica Clustering (HC) <https://enterobase.readthedocs.io/en/latest/pipelines/backend-pipeline-phylotypes.html?highlight=pathovar>`_

source: Serotyping
fr: Sérotypage
pt: Serotipagem

source: Serotypes: `The Salmonella In Silico Typing Resource (SISTR): An Open Web-Accessible Tool for Rapidly Typing and Subtyping Draft Salmonella Genome Assemblies, Yoshida et al 2016 <https://doi.org/10.1371/journal.pone.0147101>`_
fr: Serotypes: `The Salmonella In Silico Typing Resource (SISTR): Un outil ouvert accessible sur le Web pour taper et sous-typer rapidement les assemblées de Génome Salmonella, Yoshida et al 2016 <https://doi.org/10.1371/journal.pone.0147101>`_
pt: Serotipes: `Recurso de Digitação Salmonela em Silico (SISTR): Ferramenta Aberta para Digitação Rápida e Projecto Subtipante de Salmonela de Genoma, Yoshida et al 2016 <https://doi.org/10.1371/journal.pone.0147101>`_

source: GenoTyphi scheme: `Five Years of GenoTyphi: Updates to the Global Salmonella Typhi Genotyping Framework, Dyson & Holt, 2021 <https://doi.org/10.1093/infdis/jiab414>`_
fr: Schéma GenoTyphi : `Cinq Ans de GenoTyphi: Mises à jour du Global Salmonella Typhi Genotyping Framework, Dyson & Holt, 2021 <https://doi.org/10.1093/infdis/jiab414>`_
pt: Esquema de GenoTyphi: `Cinco Anos de GenoTyphi: Atualizações para a Estrutura Global de Genotipagem Typhi, Dyson & Holt, 2021 <https://doi.org/10.1093/infdis/jiab414>`_

source: AMR prediction: `A global resource for genomic predictions of antimicrobial resistance and surveillance of Salmonella Typhi at pathogenwatch, Argimón et al 2021 <https://doi.org/10.1038/s41467-021-23091-2>`_
fr: Prédiction AMR : `Une ressource globale pour les prédictions génomiques de la résistance antimicrobien et de la surveillance de Salmonella Typhi à la montre pathogène, Argimón et al 2021 <https://doi.org/10.1038/s41467-021-23091-2>`_
pt: Previsão RAM: `Um recurso global para previsões genómicas de resistência antimicrobiana e vigilância da Salmonella Typhi no patogogêwatch, Argimoish, n et al 2021 <https://doi.org/10.1038/s41467-021-23091-2>`_

source: 7-locus MLST scheme: `Species status of Neisseria gonorrhoeae: evolutionary and epidemiological inferences from multilocus sequence typing, Bennett et al 2007 <https://doi.org/10.1186/1741-7007-5-35>`_
fr: Schéma 7-locus MLST : `Statut des espèces de Neisseria gonorrhoeae: Inférences évolutives et épidémiologiques du type de séquence multilocus, Bennett et al 2007 <https://doi.org/10.1186/1741-7007-5-35>`_
pt: Esquema MLST de 7-locus: `Espécies of Neisseria gonorrhoeae: inferências evolucionistas e epidemiológicas de digitação de sequências multilocus, Bennett et al 2007 <https://doi.org/10.1186/1741-7007-5-35>`_

source: 2-locus *N. gonorrhoeae* multi-antigen sequence typing (NG-MAST) scheme `Rapid Sequence-Based Identification of Gonococcal Transmission Clusters in a Large Metropolitan Area, Martin et al 2004 <https://doi.org/10.1086/383047>`_
fr: 2-locus *N. gonorrhoeae* schéma de typage de séquence multi-antigène (NG-MAST) `Identification Rapide Sequence-Based Identification of Gonococcal Transmission Clusters in a Large Metropolitan Area, Martin et al 2004 <https://doi.org/10.1086/383047>`_
pt: 2-locus *N. gonorrhoeae* sequencia de multi antigénio tipagem (NG-MAST) esquema `Identificação Rápida de Confrontos de Transmissão Gonococcal em uma grande área Metropolitana, Martin et al 2004 <https://doi.org/10.1086/383047>`_

source: MLST and NG-MAST databases: `PubMLST <https://pubmlst.org/neisseria/>`_
fr: Base de données MLST et NG-MAST : `PubMLST <https://pubmlst.org/neisseria/>`_
pt: Banco de dados MLST e NG-MAST: `PubMLST <https://pubmlst.org/neisseria/>`_

source: AMR prediction: `A community-driven resource for genomic epidemiology and antimicrobial resistance prediction of Neisseria gonorrhoeae at Pathogenwatch, Sánchez-Busó et al 2021 <https://doi.org/10.1186/s13073-021-00858-2>`_
fr: Prédiction AMR : `Une ressource communautaire pour l'épidémiologie génomique et la prédiction de la résistance antimicrobienne de Neisseria gonorrhoeae à Pathogenwatch, Sánchez-Busó et al 2021 <https://doi.org/10.1186/s13073-021-00858-2>`_
pt: Previsão RAM: `Um recurso orientado pela comunidade para epidemiologia genómica e previsão de resistência antimicrobiana Neisseria gonorrhoeae em Pathogenwatch, Sa├nchez-Busoč et al 2021 <https://doi.org/10.1186/s13073-021-00858-2>`_

source: Core genome MLST scheme: `Genomic Definition of Hypervirulent and Multidrug-Resistant Klebsiella pneumoniae Clonal Groups, Bialek-Davenet et al 2014 <https://doi.org/10.3201/eid2011.140206>`_
fr: Schéma MLST du génome central : `Définition génomique de Klebsiella pneumoniae Clonal Groups, Bialek-Davenet et al 2014 <https://doi.org/10.3201/eid2011.140206>`_
pt: Esquema núcleo do tipo MLST: `Definição Genônica de Hypervirulent e Multidrug-Resistant Klebsiella pneumoniae Clonal, Bialek-Davenet al 2014 <https://doi.org/10.3201/eid2011.140206>

source: Sublineages: `A Dual Barcoding Approach to Bacterial Strain Nomenclature: Genomic Taxonomy of Klebsiella pneumoniae Strains, Hennart et al 2022 <https://doi.org/10.1093/molbev/msac135>`_
fr: Sublineages: `A Dual Barcoding Approach to Bacterial Strain Nomenclature : Taxonomy Genomic of Klebsiella pneumoniae Strains, Hennart et al 2022 <https://doi.org/10.1093/molbev/msac135>`_
pt: Sublinhagens: `Uma Abordagem de Código de Barras Duplas à Nomenclatura Bacterial: Taxonomia Genômica de Klebsiella pneumoniae Strains, Hennart et al 2022 <https://doi.org/10.1093/molbev/msac135>`_

source: MLST databases: `BIGSdb Institut Pasteur <https://bigsdb.pasteur.fr/klebsiella/>`_
fr: Base de données MLST: `BIGSdb Institut Pasteur <https://bigsdb.pasteur.fr/klebsiella/>`_
pt: Banco de dados MLST: `BIGSdb Institut Pasteur <https://bigsdb.pasteur.fr/klebsiella/>`_

source: AMR typing
fr: Saisie AMR
pt: Digitação AMR

source: Kleborate paper: `A genomic surveillance framework and genotyping tool for Klebsiella pneumoniae and its related species complex, Lam et al 2021 <https://doi.org/10.1038/s41467-021-24448-3>`_
fr: Papier Kleborate : `Un cadre de surveillance génomique et un outil de génotypage pour Klebsiella pneumoniae et son complexe d'espèces liées, Lam et al 2021 <https://doi.org/10.1038/s41467-021-24448-3>`_
pt: Papel Kleborate: `Um quadro genômico de vigilância e ferramenta de genotipação para Klebsiella pneumoniae e seu complexo de espécies relacionadas, Lam et al 2021 <https://doi.org/10.1038/s41467-021-24448-3>`_
