Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/styphi.po
Languages: fr, pt

source: *Salmonella* Typhi data in AMRnet are drawn from `Pathogenwatch <http://Pathogen.watch>`__, which calls AMR determinants and `GenoTyphi <https://doi.org/10.1093/infdis/jiab414>`_ genotypes from genome assemblies. The *Salmonella* Typhi data in Pathogenwatch are curated by the `Global Typhoid Genomics Consortium <https://www.typhoidgenomics.org>`_, as described `here <https://doi.org/10.7554/eLife.85867>`_.
fr: *Salmonella* Les données Typhi dans AMRnet sont tirées à partir de `Pathogenwatch <http://Pathogen.watch>`__, qui appelle les déterminants AMR et les génotypes `GenoTyphi <https://doi.org/10.1093/infdis/jiab414>`_ des assemblages de génomes. Les données de *Salmonella* Typhi en Pathogenwatch sont supervisées par le `Global Typhoid Genomics Consortium <https://www.typhoidgenomics.org>`_, tel que décrit `ici <https://doi.org/10.7554/eLife.85867>`_.
pt: Os dados do Tyfi *Salmonella* na AMRnet são desenhados de `Pathogenwatch <http://Pathogen.watch>`__, que chama determinantes da AMR e `GenoTyphi <https://doi.org/10.1093/infdis/jiab414>`_ genótipos das montagens de genoma. O *Salmonella* dados do Tyfi em Pathogenwatch são curados pelo `Consortium <https://www.typhoidgenomics.org>do genoma do Typhoid Global (Global Typhoid Genoma <https://www.typhoidgenomics.org> `_, como descrito `here <https://doi.org/10.7554/eLife.85867>`_.

source: The prevalence estimates shown are calculated using genome collections derived from non-targeted sampling frames (i.e. surveillance and burden studies, as opposed to AMR focused studies or outbreak investigations) with known year of isolation and country of origin. Last update: 5 August 2025.
fr: Les estimations de prévalence affichées sont calculées à l'aide de collections de génomes dérivées de cadres d'échantillonnage non ciblés (i.e. les études de surveillance et de chargement, par opposition aux études centrées sur la RMA ou aux enquêtes sur l'épidémie) avec l'année d'isolement et le pays d'origine connu. Dernière mise à jour : 5 août 2025.
pt: As estimativas de prevalência mostradas são calculadas utilizando coleções de gêneros derivadas de quadros de amostragem não direcionados (ou seja, estudos de vigilância e encargos, em vez de estudos específicos sobre RAM ou investigações de epidemia) com o ano conhecido de isolamento e país de origem. Última atualização: 5 de Agosto de 2025.

source: Variable definitions
fr: Définitions de variables
pt: Definições de variáveis

source: **Genotypes**: GenoTyphi scheme, see `Dyson & Holt, 2021 <https://doi.org/10.1093/infdis/jiab414>`_.
fr: **Génotypes** : Schéma GénéoTyphi, voir `Dyson & Holt, 2021 <https://doi.org/10.1093/infdis/jiab414>`_.
pt: **Genotipes**: GenoTyphi, veja `Dyson & Holt, 2021 <https://doi.org/10.1093/infdis/jiab414>`_.

source: **AMR determinants** are described in the `Typhi Pathogenwatch paper <https://doi.org/10.1038/s41467-021-23091-2>`_, .
fr: Les **déterminants AMR** sont décrits dans le `papier Typhi Pathogenwatch paper <https://doi.org/10.1038/s41467-021-23091-2>`_, .
pt: **determinantes AMR** estão descritos no `papel do Typhi Pathogenwatch <https://doi.org/10.1038/s41467-021-23091-2>`_.

source: **Travel-associated cases** are attributed to the country of travel, not the country of isolation, see `Ingle et al, 2019 <https://doi.org/10.1371/journal.pntd.0007620>`_.
fr: Les **cas associés au voyage** sont attribués au pays de voyage, et non au pays d'isolement, voir `Ingle et al, 2019 <https://doi.org/10.1371/journal.pntd.0007620>`_.
pt: **Casos associados a viagens** são atribuídos ao país de viagem, não ao país de isolamento, veja `Ingle et al, 2019 <https://doi.org/10.1371/journal.pntd.0007620>`_.

source: Abbreviations
fr: Abréviations
pt: Abreviações

source: **MDR**: multidrug resistant (resistant to ampicillin, chloramphenicol, and trimethoprim-sulfamethoxazole)
fr: **MDR** : multi-résistante (résistant à l'ampicilline, au chloramphénicol et au triméthoprim-sulfamethoxazole)
pt: **DR**: multidroga-resistente (resistente à ampicillin, cloro fenícolo e trimetioprim-sulfamethoxazole)

source: **XDR**: extensively drug resistant (MDR plus resistant to ciprofloxacin and ceftriaxone)
fr: **XDR** : grande résistance aux médicaments (MDR plus résistance à la ciprofloxacine et au céftriaxone)
pt: **XDR**: extensivamente resistente a drogas (MDR mais resistente a profloxacios e ceftriaxone)

source: **Ciprofloxacin NS**: ciprofloxacin non-susceptible (MIC >=0.06 mg/L, due to presence of one or more *qnr* genes or mutations in *gyrA/parC/gyrB*)
fr: **Ciprofloxacine NS** : ciprofloxacin non sensible (MIC >=0,06 mg/L, en raison de la présence d'un ou de plusieurs gènes *qnr* ou mutations dans *gyrA/parC/gyrB*)
pt: **Ciprofloxacin NS**: ciprofloxacin não suscetível (MIC >=0.06 mg/L, devido à presença de um ou mais genes *qnr* ou mutações em *gyr/parC/gyrB*)

source: **Ciprofloxacin R**: ciprofloxacin resistant (MIC >=0.5 mg/L, due to presence of multiple mutations and/or genes)
fr: **Ciprofloxacine R** : Résistance à la ciprofloxacine (MIC >=0,5 mg/L, en raison de la présence de mutations et/ou de gènes multiples)
pt: **Ciprofloxacin R**: resistente a ciprofloxacin (MIC >=0.5 mg/L, devido à presença de várias mutações e/ou genes)

source: Related tools
fr: Outils connexes
pt: Ferramentas relacionadas

source: The AMRnet project is based on the TyphiNET dashboard, available at `https://www.typhi.net/ <https://www.typhi.net/>`_ and described in the paper: `Dyson et al, Genome Medicine 2025 <https://doi.org/10.1186/s13073-025-01470-4>`_. The TyphiNET dashboard includes some different visualisations to AMRnet, and is maintained in the form described in the TyphiNET paper, in parallel to AMRnet and populated with the same underlying data as curated by the GTGC. Notably, `TyphiNET <https://www.typhi.net/>`_ has the additional feature of plotting combinations of AMR markers (for a single drug/class), per genotype.
fr: Le projet AMRnet est basé sur le tableau de bord TyphiNET, disponible sur `https://www.typhi. et/ <https://www.typhi.net/>`_ et décrit dans le document : `Dyson et al, Genome Medicine 2025 <https://doi.org/10.1186/s13073-025-01470-4>`_. Le tableau de bord TyphiNET inclut des visualisations différentes de AMRnet, et est maintenu sous la forme décrite dans le papier TyphiNET, en parallèle à AMRnet et peuplé avec les mêmes données sous-jacentes que celles conservées par le GTGC. Notamment, `TyphiNET <https://www.typhi.net/>`_ a la caractéristique supplémentaire de tracer des combinaisons de marqueurs AMR (pour un seul médicament/classe), par génotype.
pt: O projeto AMRnet é baseado no painel TyphiNET, disponível em `https://www.typhi. et/ <https://www.typhi.net/>`_ e descrito no papel: `Dyson et al, Genome Medicine 2025 <https://doi.org/10.1186/s13073-025-01470-4>`_. O painel do TyphiNET inclui algumas visualizações diferentes para AMRnet e é mantido na forma descrita no papel do TyphiNET, em paralelo com AMRnet e preenchido com os mesmos dados subjacentes que foram curados pelo GTGC. Notavelmente, o `TyphiNET <https://www.typhi.net/>`_ tem o recurso adicional de desenhar combinações de marcadores AMR (para uma única droga/classe), por genótipo.
