Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/troubleshooting.po
Languages: es, fr

source: Troubleshooting Guide
es: Guía de solución de problemas
fr: Guide de dépannage

source: This comprehensive troubleshooting guide covers common issues encountered when developing, deploying, and maintaining AMRnet. The solutions are based on real-world problems and their tested fixes.
es: Esta guía completa de solución de problemas cubre los problemas comunes encontrados en el desarrollo, despliegue y mantenimiento de AMRnet.
fr: Ce guide complet de dépannage couvre les problèmes courants rencontrés lors du développement, du déploiement et de la maintenance d'AMRnet.

source: Performance Issues
es: Problemas de rendimiento
fr: Problèmes de performance

source: Slow Data Loading (2+ Minute Load Times)
es: Carga lenta de datos (2+ minutos de carga)
fr: Chargement lent des données (2+ de minutes de charge)

source: **Symptoms:** - E. coli data taking 3+ minutes to load - K. pneumoniae taking 2+ minutes - Browser freezing during data fetch - Large payload sizes (75MB+)
es: **Síntomas:** - Datos de E. coli que tardan más de 3 minutos en cargar - K. pneumoniae tardando 2+ minutos - Navegador congelado durante la obtención de datos - Tamaños grandes de carga útil (75MB+)
fr: **Symptômes:** - Les données de E. coli prennent 3+ minutes à charger - K. pneumoniae en prenant 2+ minutes - Gelage du navigateur lors de la récupération de données - Grandes tailles de charge (75MB+)

source: **Diagnosis Script:**
es: **Diagnóstico Script:**
fr: **Script de diagnostic :**

source: **Root Causes:** - Unoptimized MongoDB queries returning all fields - Large datasets (227K+ documents for E. coli) - Single monolithic API calls - Lack of pagination or progressive loading
es: **Causas de root:** - Las consultas de MongoDB no optimizadas que devuelven todos los campos - Conjuntos de datos grandes (227K+ documentos para E. coli) - Llamadas de API monolíticas únicas - falta de paginación o carga progresiva
fr: **Causses racines:** - Requêtes non-officialisées MongoDB renvoyant tous les champs - Grands ensembles de données (227K+ documents pour E. coli) - Single monolithic API calls - Manque de pagination ou chargement progressif

source: **Solutions:**
es: **Soluciones:**

source: **Use Optimized Endpoints:**
es: **Usar puntos finales optimizados:**
fr: **Utiliser les points terminaux optimisés :**

source: **Implement Pagination for Large Datasets:**
es: **Implementar paginación para conjuntos de datos grandes:**
fr: **Implémenter la pagination pour les grands ensembles de données :**

source: **Use Parallel Loading:**
es: **Usar carga paralela:**
fr: **Utiliser le chargement parallèle :**

source: **Performance Validation:**
es: **Validación de rendimiento:**
fr: **Validation des performances :**

source: Browser Freezing on Large Datasets
es: Congelación del navegador en conjuntos de datos grandes
fr: Gel du navigateur sur les jeux de données volumineux

source: **Symptoms:** - Browser becomes unresponsive - UI freezes during data processing - "Page Unresponsive" warnings
es: **Symptoms:** - Navegador se vuelve poco sensible - Interfaz de usuario se congela durante el procesamiento de datos - advertencias "Page Unresponsive"
fr: **Symptômes:** - Le navigateur ne répond plus - L’interface utilisateur bloque pendant le traitement des données - Avertissements « Page non réactive»

source: **Diagnosis:**
es: **Diagnóstico:**
fr: **Diagnostic :**

source: **Progressive Genotype Loading:**
es: **Carga progresiva de genotipo:**
fr: **Chargement progressif du génotype :**

source: **Web Workers for Heavy Processing:**
es: **Trabajadores Web para el procesamiento pesado:**
fr: **Travailleurs Web pour le traitement lourd :**

source: **Validation:**
es: **Validación:**

source: Development Issues
es: Problemas de desarrollo
fr: Problèmes de développement

source: ESLint Errors and Warnings
es: Avisos y errores ESLint
fr: Erreurs ESLint et avertissements

source: **Symptoms:** - Build failures due to linting errors - Unused variable warnings - Import/export errors
es: **Symptoms:** - Build failures due to linting errors - Unused variable warnings - Importe/export errors
fr: **Symptômes :** - Échecs de compilation dus aux erreurs de linting - Avertissements de variables inutilisés - Import/export erreurs

source: **Quick Fix:**
es: **Corrección rápida:**
fr: **Réparation Rapide :**

source: **Manual Fixes:**
es: **Correcciones manuales:**
fr: **Corrections manuelles :**

source: **Common Issues and Fixes:**
es: **Problemas y arreglos comunes:**
fr: **Problèmes et corrections courants:**

source: MongoDB Connection Issues
es: Problemas de conexión de MongoDB
fr: Problèmes de connexion MongoDB

source: **Symptoms:** - "Failed to load resource: 500 Internal Server Error" - Connection timeouts - Authentication failures
es: **Symptoms:** - "Error al cargar el recurso: 500 Error interno del servidor" - Tiempo de espera de conexión - Fallos de autenticación
fr: **Symptômes:** - "Impossible de charger la ressource: 500 Erreur interne du serveur" - Délai de connexion - Échec d'authentification

source: **Common Solutions:**
es: **Soluciones comunes:**
fr: **Solutions communes:**

source: **Check Environment Variables:**
es: **Comprobar variables de entorno:**
fr: **Vérifier les variables d'environnement :**

source: **Fix Connection String Format:**
es: **Fijar formato de cadena de conexión:**
fr: **Corriger le format de la chaîne de connexion :**

source: **Test Connection with Retry Logic:**
es: **Prueba de conexión con la lógica de reintento:**
fr: **Tester la connexion avec une nouvelle tentative Logic:**

source: Server Startup Issues
es: Problemas de inicio del servidor
fr: Problèmes de démarrage du serveur

source: **Symptoms:** - Server not starting on correct port - "EADDRINUSE" port errors - Import/export syntax errors
es: **Sintomas:** - Servidor que no comienza en el puerto correcto - errores de puerto "EADDRINUSE" - Importar/exportar errores de sintaxis
fr: **Symptômes:** - Le serveur ne démarre pas sur le port correct - Erreurs de port "EADDRINUSE" - Erreurs de syntaxe d'import/export

source: **Port Configuration:**
es: **Configuración del puerto:**
fr: **Configuration du port :**

source: **Kill Existing Processes:**
es: **Matar procesos existentes:**
fr: **Processus existants de Kill Existant:**

source: **Use Minimal Test Server:**
es: **Usar servidor mínimo de prueba:**
fr: **Utiliser le serveur de test minimal:**

source: Deployment Issues
es: Problemas de despliegue
fr: Problèmes de déploiement

source: Heroku Deployment Failures
es: Fallos de Despliegue de Heroku
fr: Échec du déploiement de Heroku

source: **Symptoms:** - Build failures during deployment - Memory limit exceeded - Slow response times
es: **Síntomas:** - Construir fallos durante la implementación - Límite de memoria excedido - Veces de respuesta lenta
fr: **Symptômes:** - Pannes de construction pendant le déploiement - Limite de mémoire dépassée - Temps de réponse lent

source: **Pre-deployment Check:**
es: **Comprobación de preimplementación:**
fr: **Vérification du pré-déploiement :**

source: **Common Fixes:**
es: **Arreglos comunes:**
fr: **Corrections courantes :**

source: **Environment Variables:**
es: **Variables de entorno:**
fr: **Variables d'environnement :**

source: **Optimize for Heroku:**
es: **Optimizar para Heroku:**
fr: **Optimiser pour Heroku :**

source: MongoDB Atlas Performance
es: Desempeño Atlas de MongoDB
fr: Performance de l'Atlas MongoDB

source: **Symptoms:** - High latency connections - Timeout errors - Poor query performance
es: **Síntomas:** - Conexiones de alta latencia - Errores de espera - Pobre rendimiento de la consulta
fr: **Symptômes:** - Connexions à haute latence - Erreurs de délai - Faible performance de requête

source: **Optimizations:**
es: **Optimizaciones:**
fr: **Optimisations :**

source: 1. **Region Proximity:** - Ensure Heroku and Atlas are in same region - Use ``us-east-1`` for both services
es: 1. **Proximidad de la Región:** - Asegúrate de que Heroku y Atlas estén en la misma región - Usa ``Ninguno-este-1`` para ambos servicios
fr: 1. **Proximité de la Région :** - Assurez-vous que Heroku et Atlas sont dans la même région - Utilisez ``us-east-1`` pour les deux services

source: **Connection Pooling:**
es: **Conexión combinando:**
fr: **Regroupement de connexions:**

source: Translation and Internationalization
es: Traducción e Internacionalización
fr: Traduction et internationalisation

source: Translation Workflow Issues
es: Problemas de flujo de trabajo de traducción
fr: Problèmes de flux de travail de traduction

source: **Symptoms:** - Missing translation keys - Translation workflow not triggering - JSON syntax errors
es: **Síntomas:** - Faltan claves de traducción - Flujo de trabajo de traducción no desencadenando - errores de sintaxis JSON
fr: **Symptômes:** - Clés de traduction manquantes - Workflow de traduction non déclenché - Erreurs de syntaxe JSON

source: **File Structure:**
es: **Estructura de archivo:**
fr: **Structure du fichier:**

source: **JSON Validation:**
es: **Validación JSON:**
fr: **Validation JSON :**

source: Code Quality Issues
es: Calidad del código de problemas
fr: Problèmes de qualité de code

source: Cleanup and Maintenance
es: Limpieza y mantenimiento
fr: Nettoyage et maintenance

source: **Symptoms:** - Excessive console.log statements - Commented-out code - Unused files and dependencies
es: **Symptoms:** - Excesivas declaraciones console.log - Código comentado - Archivos no utilizados y dependencias
fr: **Symptômes:** - Excès de console.log - Code commenté - Fichiers et dépendances inutilisés

source: **Automated Cleanup:**
es: **Limpieza automática:**
fr: **Nettoyage automatisé:**

source: **Manual Cleanup:**
es: **Limpieza manual:**
fr: **Nettoyage manuel :**

source: Security Issues
es: Problemas de seguridad
fr: Problèmes de sécurité

source: **Symptoms:** - Exposed credentials in repository - Security warnings - Vulnerable dependencies
es: **Symptoms:** - Credenciales expuestas en el repositorio - Avisos de seguridad - Dependencias vulnerables
fr: **Symptômes :** - Identifiants exposés dans le dépôt - Avertissements de sécurité - Dépendances vulnérables

source: **Immediate Actions:**
es: **Acciones inmediatas:**
fr: **Actions immédiates:**

source: **Prevention:**
es: **Prevención:**
fr: **Prévention :**

source: Performance Optimization
es: Optimización de rendimiento
fr: Optimisation des performances

source: Monitoring and Validation
es: Monitoreo y validación
fr: Surveillance et validation

source: **Real-time Monitoring:**
es: **Monitoreo en tiempo real:**
fr: **Surveillance en temps réel :**

source: **Load Testing:**
es: **Prueba de Carga:**
fr: **Test de la charge :**

source: **Performance Benchmarks:**
es: **Marcas de Rendimiento:**
fr: **Benchmarks de performance :**

source: **Expected Results:** - K. pneumoniae: <2s load time - E. coli: <7s with pagination - E. coli (diarrheagenic): <3s load time - Payload reduction: 60-90%
es: **Resultados esperados:** - K. pneumoniae: <2s load time - E. coli: <7s with pagination - E. coli (diarrheagenica): <3s load time - Payload reduction: 60-90%
fr: **Résultats attendus :** - K. pneumoniae: <2s load time - E. coli: <7s with pagination - E. coli (diarrheagenic): <3s load time - Payload reduction: 60-90%

source: Diagnostic Scripts Reference
es: Referencia de Diagnósticos
fr: Référence des scripts de diagnostic

source: **Quick Diagnostics:**
es: **Diagnóstico rápido:**
fr: **Diagnostics Rapide:**

source: **Comprehensive Analysis:**
es: **Análisis exhaustivo:**
fr: **Analyse complète :**

source: **Status Checks:**
es: **Comprobaciones de Estado:**
fr: **Vérifications de statut:**

source: Emergency Procedures
es: Procedimientos de emergencia
fr: Procédures d'urgence

source: Critical Performance Issues
es: Problemas de rendimiento crítico
fr: Problèmes critiques de performance

source: **If users report 2+ minute load times:**
es: **Si los usuarios reportan 2+ minutos de tiempo de carga:**
fr: **Si les utilisateurs rapportent plus de 2 minutes de temps de chargement :**

source: **Immediate Response:**
es: **Respuesta inmediata:**
fr: **Réponse immédiate :**

source: **Verify Fix:**
es: **Verificar la solución:**
fr: **Vérifier la correction :**

source: **Monitor Results:**
es: **Controlar resultados:**
fr: **Résultats du suivi :**

source: Server Down Emergency
es: Emergencia Abajo del Servidor
fr: Urgence du Serveur Bas

source: **If server is unresponsive:**
es: **Si el servidor no responde:**
fr: **Si le serveur ne répond pas :**

source: **Start Minimal Server:**
es: **Iniciar servidor mínimo:**
fr: **Démarrer le serveur minimal :**

source: **Check Logs:**
es: **Registros de verificación:**
fr: **Journal de vérification:**

source: **Restart with Fixed Configuration:**
es: **Reinicia con la configuración fija:**
fr: **Redémarrer avec la configuration fixe :**

source: Getting Help
es: Obteniendo ayuda
fr: Obtenir de l'aide

source: **When to Use Each Script:**
es: **Cuándo usar cada Script:**
fr: **Quand utiliser chaque script:**

source: **Performance Issues**: ``organism-performance-debugger.js``
es: **Problemas de rendimiento**: ``organism-performance-debugger.js``
fr: **Problèmes de performance** : ``organism-performance-debugger.js``

source: **Deployment Problems**: ``deployment-readiness.js``
es: **Problemas de despliegue**: ``deployment-readiness.js``
fr: **Problèmes de déploiement** : ``deployment-readiness.js``

source: **MongoDB Issues**: ``test-fixie-connection.js``
es: **Problemas de MongoDB**: ``test-fixie-connection.js``
fr: **Problèmes MongoDB** : ``test-fixie-connection.js``

source: **Code Quality**: ``cleanup_script.sh``
es: **Calidad del código**: ``cleanup_script.sh``
fr: **Qualité du code** : ``cleanup_script.sh``

source: **Translation Issues**: ``test-translation-setup.sh``
es: **Problemas de traducción**: ``test-translation-setup.sh``
fr: **Problèmes de traduction** : ``test-translation-setup.sh``

source: **Community Support:** - GitHub Issues: https://github.com/amrnet/amrnet/issues - Discussions: https://github.com/amrnet/amrnet/discussions - Email: amrnetdashboard@gmail.com
es: **Soporte de la comunidad:** - Problemas de GitHub: https://github.com/amrnet/amrnet/issues - Discusiones: https://github.com/amrnet/amrnet/discussions - Email: amrnetdashboard@gmail.com
fr: **Support de la communauté:** - Problèmes GitHub : https://github.com/amrnet/amrnet/issues - Discussions: https://github.com/amrnet/amrnet/discussions - Email: amrnetdashboard@gmail.com

source: **Emergency Contacts:** - Critical bugs: GitHub Issues with "urgent" label - Security issues: amrnetdashboard@gmail.com
es: **Contactos de emergencia:** - Errores críticos: Problemas de GitHub con etiqueta "urgente" - Problemas de seguridad: amrnetdashboard@gmail.com
fr: **Contacts d'urgence:** - bugs critiques : problèmes GitHub avec étiquette "urgent" - Problèmes de sécurité : amrnetdashboard@gmail.com

source: **Build Script Issues:**
fr: **Problèmes de Build Script :**
