Repository: amrnet/amrnet
Catalog: docs/locale/*/LC_MESSAGES/usage.po
Languages: es, pt

source: Dashboard overview
es: Resumen del tablero
pt: Resumo do painel

source: Header
es: Cabecera
pt: Cabeçalho

source: Use the menu to **select a species or pathogen group** to display. Each pathogen has its own dashboard configuration that is customised to show genotypes, resistances and other relevant parameters. Numbers indicate the total number of genomes and genotypes currently available in the selected dashboard.
es: Utilice el menú para **seleccionar una especie o grupo de patógenos** para mostrar. Cada patógeno tiene su propia configuración de tablero que se personaliza para mostrar genotipos, resistencias y otros parámetros relevantes. Los números indican el número total de genomas y genotipos actualmente disponibles en el panel de control seleccionado.
pt: Use o menu para selecionar **uma espécie ou grupo patogênico** para mostrar. Cada agente patogênico tem sua própria configuração de painel que é personalizada para mostrar genótipos, resistências e outros parâmetros relevantes. Números indicam o número total de gênios e genótipos disponíveis atualmente no painel selecionado.

source: header
es: cabecera
pt: cabeçalho

source: Map
es: Mapa
pt: Mapear

source: Use the **Plotting options** panel on the right to **select a variable to display per-country summary data** on the world map. Prevalence data are pooled weighted estimates of proportion for the selected resistance or genotype. A country must have N≥20 samples (using the current filters) for summary data to be displayed otherwise, it will be coloured grey to indicate insufficient data are available.
es: Usa el panel **Opciones de Ploting** de la derecha para **seleccionar una variable para mostrar los datos sumarios por país** en el mapa del mundo. Los datos de prevalencia son estimaciones ponderadas de la proporción para la resistencia o genotipo seleccionados. Un país debe tener muestras de 20 n° (usando los filtros actuales) para que los datos de resumen se muestren de otro modo, será de color gris para indicar que no hay suficientes datos disponibles.
pt: Use o painel de **Plotting options** à direita para **selecionar uma variável para exibir dados de resumo por país** no mapa mundial. Os dados de preparação são combinados com estimativas ponderadas sobre proporção para a resistência ou genotipo seleccionado. Um país deve ter N≥ 20 amostras (usando os filtros atuais) para que os dados resumidos sejam exibidos de outra forma, ficará cinza colorido se indicar que dados insuficientes estão disponíveis.

source: Use the **Global Filter** panel on the left to recalculate summary data for a specific time period and/or subgroup/s (options available vary by pathogen). Filters set in the **Global Filter** panel apply not only to the map, but to all plots on the page.
es: Utilice el panel de **Filtro Global** de la izquierda para recalcular los datos de resumen para un período de tiempo específico y/o subgrupo/s (las opciones disponibles varían según el patógeno). Los filtros establecidos en el panel de **Filtro Global** se aplican no sólo al mapa, sino también a todas las parcelas de la página.
pt: Use o painel **Filtro Global** à esquerda para recalcular os dados de resumo para um período de tempo específico e/ou subgrupos/s (opções disponíveis variam por patogênico). Os filtros definidos no painel **Filtro Global** se aplicam não apenas ao mapa, mas a todas as parcelas da página.

source: **Clicking on a country in the map** also functions as a filter, so that the **Summary plots** in the panels below reflect data for the selected country only. Per-country values displayed in the map can be downloaded by clicking the downward-arrow button at the top right of the panel.
es: **Hacer clic en un país del mapa** también funciona como un filtro, para que las **parcelas de resumen** en los paneles de abajo reflejen únicamente los datos del país seleccionado. Los valores por país mostrados en el mapa se pueden descargar haciendo clic en el botón de flecha hacia abajo en la parte superior derecha del panel.
pt: **Clicar em um país no mapa** também funciona como um filtro, para que os **pontos resumidos** nos painéis abaixo reflitam os dados somente para o país selecionado. Os valores por país exibidos no mapa podem ser baixados clicando no botão de seta para baixo no canto superior direito do painel.

source: **Plot-specific downloads:** The summary statistics currently displayed in the plot (e.g. resistance prevalence per country; with numerator, denominator and percentage) can be downloaded in tabular (TSV) format by clicking the down arrow (top-right of panel). A static image (PNG format) of the current map view can be downloaded by clicking the camera icon.
es: **Descargas específicas de parámetro:** Las estadísticas de resumen que se muestran actualmente en la parcela (p. ej. la prevalencia de resistencia por país; con numerador, denominador y porcentaje) se puede descargar en formato tabular (TSV) haciendo clic en la flecha hacia abajo (arriba a la derecha del panel). Una imagen estática (formato PNG) de la vista actual del mapa se puede descargar haciendo clic en el icono de la cámara.
pt: **Downloads específicos do Plot:** As estatísticas resumidas exibidas atualmente no gráfico (por exemplo, a prevalência da resistência por país; com numerador, denominador e porcentagem) pode ser baixada em formato tabular (TSV) clicando na seta para baixo (canto superior direito do painel). Uma imagem estática (formato PNG) da visualização do mapa atual pode ser baixada clicando no ícone da câmera.

source: map
es: mapa
pt: Mapa

source: Summary plots
es: Resumen de parcelas
pt: Gráficos resumidos

source: All plots are interactive. Use the **Plotting options** panel on the right to modify the region/country to display, or to select other options available for the current plot such as which variables to display, and whether to show **counts or percentages**.
es: Todas las parcelas son interactivas. Usa el panel **Opciones de Ploting** de la derecha para modificar la región/país para mostrar, o para seleccionar otras opciones disponibles para la gráfica actual como qué variables mostrar, y si mostrar **contadores o porcentajes**.
pt: Todos os gráficos são interativos. Use o painel de **opções de ploting** à direita para modificar a região/país para exibir, ou para selecionar outras opções disponíveis para o gráfico atual, como quais variáveis devem ser exibidas e se devem mostrar **contagens ou percentagens**.

source: Line and bar plot have a dynamic legend to the right; click on an x-axis value to display counts and percentages of secondary variables calculated amongst genomes matching that x-axis value. For example, all pathogens have an ‘AMR by genotype’ plot; click a genotype to display counts and percentages of resistance estimated for each drug or class.
es: Las parcelas de línea y barra tienen una leyenda dinámica a la derecha; haga clic en un valor de eje x para mostrar los recuentos y porcentajes de variables secundarias calculados entre los genomas que coinciden con ese valor de eje X. Por ejemplo, todos los patógenos tienen una trama ‘AMR por genotipo’; haga clic en un genotipo para mostrar los recuentos y porcentajes de resistencia estimados para cada medicamento o clase.
pt: O gráfico de linhas e barras tem uma legenda dinâmica à direita; clique em um valor de eixo x para exibir contagens e percentagens de variáveis secundárias calculadas entre genomas que correspondem àquele valor de eixo x. Por exemplo, todos os agentes patogénicos têm uma conspiração “AMR por genótico”; clique em um genótipo para exibir contagens e percentagens de resistência estimadas para cada medicamento ou classe.

source: **Plot-specific downloads:** Summarised values displayed in the current plot can be downloaded by clicking the down arrow button (top-right of panel). A static image (PNG format) of the current plotting view can be downloaded by clicking the camera icon.
es: **Descargas específicas de basura:** Los valores resumidos mostrados en la parcela actual se pueden descargar haciendo clic en el botón de flecha hacia abajo (arriba a la derecha del panel). Una imagen estática (formato PNG) de la vista de trazado actual se puede descargar haciendo clic en el icono de la cámara.
pt: **Plot-especificamente downloads:** Valores resumidos exibidos no gráfico atual podem ser baixados clicando no botão seta para baixo (canto superior direito do painel). Uma imagem estática (formato PNG) da exibição de plotagem atual pode ser baixada clicando no ícone da câmera.

source: Geographic comparisons
es: Comparaciones geográficas
pt: Comparações geográficas

source: This panel uses heatmaps to explore how the prevalence of AMR or genotypes varies between countries or regions. The default view is AMR prevalence per country.
es: Este panel utiliza mapas de calor para explorar cómo la prevalencia de AMR o genotipos varía entre países o regiones. La vista por defecto es AMR prevalencia por país.
pt: Este painel utiliza mapas de calor para explorar como a prevalência de AMR ou genótipos varia entre países ou regiões. A exibição padrão é prevalência AMR por país.

source: Use the **Plotting options** panel on the right to stratify rows by region rather than country, to view genotype prevalence instead of AMR (in columns). For some organisms, there is also the option to plot columns as resistance markers (for a selected drug).
es: Utilice el panel **Opciones de Ploting** de la derecha para estratificar filas por región en lugar de país, para ver prevalencia genotípica en lugar de AMR (en columnas). Para algunos organismos, existe también la opción de trazar columnas como marcadores de resistencia (para un medicamento seleccionado).
pt: Use o painel de **ploting options** à direita para estratificar linhas por região ao invés do país, para ver prevalência genótipo ao invés de AMR (em colunas). Para alguns organismos, há também a opção de traçar colunas como marcadores de resistência (para um medicamento selecionado).

source: **Plotting options** can also be modified to restrict the view to selected countries or regions (in rows), or to specific subsets of genotypes or drugs (in columns). Countries are not plotted (and not available to select) if the number of samples passing the current global filter is below 20. By default, the 20 most common genotypes or drugs (passing current filters) will be included in the plot; in the drop-down list to modify the specific set of drugs or genotypes shown, the available options will be ordered by their frequency in the current selection.
es: Las **opciones de trazado** también pueden ser modificadas para restringir la vista a países o regiones seleccionados (en filas), o a subconjuntos específicos de genotipos o medicamentos (en columnas). Los países no están trazados (y no están disponibles para seleccionar) si el número de muestras que pasan el filtro global actual está por debajo de 20. De forma predeterminada, los 20 genotipos o medicamentos más comunes (pasando los filtros actuales) se incluirán en la gráfica; en la lista desplegable para modificar el conjunto específico de medicamentos o genotipos mostrados, las opciones disponibles se ordenarán por su frecuencia en la selección actual.
pt: **Opções de plotagem** também podem ser modificadas para restringir a visão para países ou regiões selecionados (em linhas), ou para subconjuntos específicos de genótipos ou drogas (em colunas). Os países não estão plotados (e não estão disponíveis para selecionar) se o número de amostras que passam o atual filtro global for inferior a 20. Por padrão, os 20 genótipos ou drogas mais comuns (passando filtros atuais) serão incluídos no plot; na lista suspensa para modificar o conjunto específico de drogas ou genótipos mostrados, as opções disponíveis serão ordenadas pela sua frequência na seleção atual.

source: **Plot-specific downloads:** Summarised values displayed in the current heatmap can be downloaded by clicking the down arrow button (top-right of panel). A static image (PNG format) of the current plotting view can be downloaded by clicking the camera icon.
es: **Descargas específicas de basura:** Los valores resumidos mostrados en el mapa de calor actual se pueden descargar haciendo clic en el botón de flecha hacia abajo (arriba a la derecha del panel). Una imagen estática (formato PNG) de la vista de trazado actual se puede descargar haciendo clic en el icono de la cámara.
pt: **Plot-especificamente downloads:** Valores resumidos exibidos no mapa de calor atual podem ser baixados clicando no botão de seta para baixo (canto superior direito do painel). Uma imagem estática (formato PNG) da exibição de plotagem atual pode ser baixada clicando no ícone da câmera.

source: geographic_comparisons
es: comparaciones geográficas
pt: comparações_geográficas

source: Downloads
es: Descargas

source: At the bottom are buttons to download (1) the individual genome-level information that is used to populate the dashboard (‘Download database (TSV format)’); and (2) a static report of the currently displayed plots, together with a basic description of the data sources and variable definitions (‘Download PDF’).
es: En la parte inferior hay botones para descargar (1) la información individual a nivel de genoma que se utiliza para rellenar el panel de control (‘Descargar base de datos (formato TSV)’); y (2) un informe estático de las gráficas mostradas actualmente, junto con una descripción básica de las fuentes de datos y definiciones de variables (‘Descargar PDF’).
pt: Na parte inferior estão os botões para baixar (1) as informações individuais do genoma que são usadas para preencher o painel ("Baixar banco de dados (formato TSV)"); e (2) um relatório estático dos gráficos atualmente exibidos, juntamente com uma descrição básica das fontes de dados e definições de variáveis (‘Download de PDF’).

source: downloads
es: descargas
