msgid ""
msgstr ""
"Project-Id-Version: amrnet\n"
"Report-Msgid-Bugs-To: \n"
"POT-Creation-Date: 2025-08-04 23:45+0100\n"
"PO-Revision-Date: 2025-08-05 01:46\n"
"Last-Translator: \n"
"Language: fr\n"
"Language-Team: French\n"
"Plural-Forms: nplurals=2; plural=(n > 1);\n"
"MIME-Version: 1.0\n"
"Content-Type: text/plain; charset=UTF-8\n"
"Content-Transfer-Encoding: 8bit\n"
"Generated-By: Babel 2.15.0\n"
"X-Crowdin-Project: amrnet\n"
"X-Crowdin-Project-ID: 816064\n"
"X-Crowdin-Language: fr\n"
"X-Crowdin-File: /devrev-final/docs/locale/es/LC_MESSAGES/codeofconduct.po\n"
"X-Crowdin-File-ID: 28\n"

#: ../../codeofconduct.rst:2
msgid "Code of Conduct"
msgstr ""

#: ../../codeofconduct.rst:5
msgid "Our Pledge"
msgstr ""

#: ../../codeofconduct.rst:8
msgid "We as members, contributors, and leaders pledge to make participation in our community a harassment-free experience for everyone, regardless of age, body size, visible or invisible disability, ethnicity, sex characteristics, gender identity and expression, level of experience, education, socio-economic status, nationality, personal appearance, race, caste, color, religion, or sexual identity and orientation."
msgstr ""

#: ../../codeofconduct.rst:15
msgid "We pledge to act and interact in ways that contribute to an open, welcoming, diverse, inclusive, and healthy community."
msgstr ""

#: ../../codeofconduct.rst:19
msgid "Our Standards"
msgstr ""

#: ../../codeofconduct.rst:22
msgid "Examples of behavior that contributes to a positive environment for our community include:"
msgstr ""

#: ../../codeofconduct.rst:25
msgid "Demonstrating empathy and kindness toward other people"
msgstr ""

#: ../../codeofconduct.rst:26
msgid "Being respectful of differing opinions, viewpoints, and experiences"
msgstr ""

#: ../../codeofconduct.rst:27
msgid "Giving and gracefully accepting constructive feedback"
msgstr ""

#: ../../codeofconduct.rst:28
msgid "Accepting responsibility and apologizing to those affected by our mistakes, and learning from the experience"
msgstr ""

#: ../../codeofconduct.rst:30
msgid "Focusing on what is best not just for us as individuals, but for the overall community"
msgstr ""

#: ../../codeofconduct.rst:33
msgid "Examples of unacceptable behavior include:"
msgstr ""

#: ../../codeofconduct.rst:35
msgid "The use of sexualized language or imagery, and sexual attention or advances of any kind"
msgstr ""

#: ../../codeofconduct.rst:37
msgid "Trolling, insulting or derogatory comments, and personal or political attacks"
msgstr ""

#: ../../codeofconduct.rst:39
msgid "Public or private harassment"
msgstr ""

#: ../../codeofconduct.rst:40
msgid "Publishing others' private information, such as a physical or email address, without their explicit permission"
msgstr ""

#: ../../codeofconduct.rst:42
msgid "Other conduct which could reasonably be considered inappropriate in a professional setting"
msgstr ""

#: ../../codeofconduct.rst:46
msgid "Enforcement Responsibilities"
msgstr ""

#: ../../codeofconduct.rst:49
msgid "Community leaders are responsible for clarifying and enforcing our standards of acceptable behavior and will take appropriate and fair corrective action in response to any behavior that they deem inappropriate, threatening, offensive, or harmful."
msgstr ""

#: ../../codeofconduct.rst:54
msgid "Community leaders have the right and responsibility to remove, edit, or reject comments, commits, code, wiki edits, issues, and other contributions that are not aligned to this Code of Conduct, and will communicate reasons for moderation decisions when appropriate."
msgstr ""

#: ../../codeofconduct.rst:60
msgid "Scope"
msgstr ""

#: ../../codeofconduct.rst:63
msgid "This Code of Conduct applies within all community spaces, and also applies when an individual is officially representing the community in public spaces. Examples of representing our community include using an official e-mail address, posting via an official social media account, or acting as an appointed representative at an online or offline event."
msgstr ""

#: ../../codeofconduct.rst:70
msgid "Enforcement"
msgstr ""

#: ../../codeofconduct.rst:73
msgid "Instances of abusive, harassing, or otherwise unacceptable behavior may be reported to the community leaders responsible for enforcement at amrnetdashboard@gmail.com. All complaints will be reviewed and investigated promptly and fairly."
msgstr ""

#: ../../codeofconduct.rst:78
msgid "All community leaders are obligated to respect the privacy and security of the reporter of any incident."
msgstr ""

#: ../../codeofconduct.rst:82
msgid "Enforcement Guidelines"
msgstr ""

#: ../../codeofconduct.rst:85
msgid "Community leaders will follow these Community Impact Guidelines in determining the consequences for any action they deem in violation of this Code of Conduct:"
msgstr ""

#: ../../codeofconduct.rst:90
msgid "1. Correction"
msgstr ""

#: ../../codeofconduct.rst:93
msgid "**Community Impact**: Use of inappropriate language or other behavior deemed unprofessional or unwelcome in the community."
msgstr ""

#: ../../codeofconduct.rst:96
msgid "**Consequence**: A private, written warning from community leaders, providing clarity around the nature of the violation and an explanation of why the behavior was inappropriate. A public apology may be requested."
msgstr ""

#: ../../codeofconduct.rst:102
msgid "2. Warning"
msgstr ""

#: ../../codeofconduct.rst:105
msgid "**Community Impact**: A violation through a single incident or series of actions."
msgstr ""

#: ../../codeofconduct.rst:108
msgid "**Consequence**: A warning with consequences for continued behavior. No interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, for a specified period of time. This includes avoiding interactions in community spaces as well as external channels like social media. Violating these terms may lead to a temporary or permanent ban."
msgstr ""

#: ../../codeofconduct.rst:116
msgid "3. Temporary Ban"
msgstr ""

#: ../../codeofconduct.rst:119
msgid "**Community Impact**: A serious violation of community standards, including sustained inappropriate behavior."
msgstr ""

#: ../../codeofconduct.rst:122
msgid "**Consequence**: A temporary ban from any sort of interaction or public communication with the community for a specified period of time. No public or private interaction with the people involved, including unsolicited interaction with those enforcing the Code of Conduct, is allowed during this period. Violating these terms may lead to a permanent ban."
msgstr ""

#: ../../codeofconduct.rst:130
msgid "4. Permanent Ban"
msgstr ""

#: ../../codeofconduct.rst:133
msgid "**Community Impact**: Demonstrating a pattern of violation of community standards, including sustained inappropriate behavior, harassment of an individual, or aggression toward or disparagement of classes of individuals."
msgstr ""

#: ../../codeofconduct.rst:138
msgid "**Consequence**: A permanent ban from any sort of public interaction within the community."
msgstr ""

#: ../../codeofconduct.rst:142
msgid "Attribution"
msgstr ""

#: ../../codeofconduct.rst:145
msgid "This Code of Conduct is adapted from the `Contributor Covenant <https://www.contributor-covenant.org>`__, version 2.1, available at https://www.contributor-covenant.org/version/2/1/code_of_conduct.html."
msgstr ""

#: ../../codeofconduct.rst:150
msgid "Community Impact Guidelines were inspired by `Mozilla's code of conduct enforcement ladder <https://github.com/mozilla/diversity>`__."
msgstr ""

#: ../../codeofconduct.rst:153
msgid "For answers to common questions about this code of conduct, see the FAQ at https://www.contributor-covenant.org/faq. Translations are available at https://www.contributor-covenant.org/translations."
msgstr ""

